{"pages":[{"title":"Personal Projects","text":"These projects are licensed under Creative Common BY-NC 4.0. Explorations in MathematicsCollection of my own course notes and expositions in mathematics, titled Explorations in Mathematics. This Week I LearnedMy personal weekly column in mathematics, titled This Week I Learned.","link":"/projects/index.html"},{"title":"Welcome!","text":"Hi and welcome to The Singularity, a blog focused on pure mathematics! My name is Yunhai Xiang (in Chinese: 项云海, pronounced as “yee-o-en-hi si-ang”), and I also go by Daniel. I’m an undergraduate pure math student at University of Waterloo in Canada. I can be reached via email. I started this math blog when I was a third year undergraduate student as a motivation for myself to learn and as a way of recording my learning progress. Here, I usually write about the mathematics that I learned, and I sometimes share my own expository notes on math topics. Also, check out my personal projects!","link":"/about/index.html"}],"posts":[{"title":"Project Lambda: This Week I Learned","text":"This Week I Learned is my personal weekly column in mathematics. Each week, I post a new article under the category This Week I Learned on Friday, Saturday or Sunday. In each article, I write about interesting theorems I learned, exercises I did, and confusions I had over the past week. Moreover, I write about anything else that interests me: physics, computer science, philosophy, puzzles, games, anecdotes, math education, and more. Enjoy!","link":"/archives/1d22c5ec/"},{"title":"Nine Point Circle and Feuerbach's Theorem","text":"I’ve been playing with the Manim library lately. Here’s a test animation I made demonstrating the nine point circle and part of Feuerbach’s theorem. It should be noted that Feuerbach’s Theorem also tells us that the nine point circle of a triangle is tangent to the three excircles of that triangle, but I did not include that in the video.","link":"/archives/e3b6140a/"},{"title":"Project Sigma: Explorations in Mathematics","text":"Explorations in Mathematics is a collection of my personal course notes and expositions in mathematics. I decided to start this project primarily as a motivation for myself to learn and as a way of recording my learning progress. That being said, it would also make me very happy if someone else benefits from them. They will probably contain errors and typos, and if you found one, you are welcomed to open an issue page in the corresponding repository and point out my mistake. See the list below. Topic Repository Release Algebraic Geometry Project-Sigma-ALG Incomplete To download, either click the link under the Release tab for a compiled .pdf file or go to the corresponding repository and clone the repository. When writing these notes, I try to adhere to the following principles: Consistent and unambiguous notation: I use clear notation, follow the same notation conventions for everything, and clearly state any abuse of notation I use. Sketches of proof: In many cases, I provide bullet points of my reasoning for many of the exercises and theorems instead of providing full proofs. I try to make them as perspicuous and coherent as I can. Prototypical examples: I give quintessential examples and non-examples for important notions, as they help myself to build intuitions for abstract concepts. I hope you enjoy reading them as I enjoyed writing them!","link":"/archives/2b4d8af0/"},{"title":"Forgetful Functor, Fall 2021","text":"Forgetful Functor is an online learning seminar in algebraic geometry held by undergraduate students at University of Waterloo in Fall 2021. Anyone with a strong interest in algebraic geometry is welcomed to join! To join the seminar, contact the organizer Yunhai Xiang via email &#121;&#x33;&#56;&#x78;&#x69;&#x61;&#110;&#103;&#x40;&#117;&#119;&#97;&#x74;&#101;&#114;&#108;&#x6f;&#x6f;&#x2e;&#99;&#97;. This seminar has ended! I thank all of you wonderful people for participating! The main text we follow is Foundations of Algebraic Geometry by Ravi Vakil. We read 0.5 to 1 chapters per week, and have a 30 minute to 1 hour discussion each Sunday on 7 PM EDT, in which a main speaker gives a short overview of the reading material of the past week and we discuss problems together. Some other texts we use are Algebraic Geometry by Robin Hartshorne and Categories and Homological Algebra by Pierre Schapira. Here are the details for each week’s meeting. Unfortunately, the recordings and notes for some weeks are missing. Week Notes Recordings Speaker Topics 1 Sept 18 Week 1 Yunhai Xiang categories, functors, limits, presheaves, sheaves 2 Sept 26 Week 2 Yunhai Xiang morphisms of sheaves, sheafification, stalks 3 Oct 3 Week 3 Jonathan Yang structure sheaf, schemes, ringed spaces 4 Oct 10 Week 4 Shuo Gao structure sheaf, OX-modules, pushforward sheaf 5 Oct 17 Week 5 Shuo Gao sheaf hom, cocycle condition, sheafification 6 Oct 24 Week 6 Yunhai Xiang sheaf on base, sheaf of abelian groups, OX-modules 7 Oct 31 Week 7 Yunhai Xiang affine space, Hilbert's Nullstellensatz, localization 8 Nov 7 Week 8 Yunhai Xiang Zariski topology, distinguished sets 9 Nov 14 Week 9 Yunhai Xiang specialization, generalization, noetherian properties 10 Nov 21 Week 10 Yunhai Xiang structure sheaf, schemes, projective spaces 11 Dec 5 Week 11 Yunhai Xiang properties of schemes 12 Dec 19 Week 12 Yunhai Xiang reading of Behrend's notes on moduli spaces","link":"/archives/607fbcab/"},{"title":"Week 3: Fppf site and fibered category","text":"“Serious mathematics (contrary to a popular misconception) is not ‘about’ proofs and logic any more than serious literature is ‘about’ grammar, or music is ‘about’ notes.” Ethan D. Bloch This week, I think I will write more about PMATH 965. In particular, we will introduce topoi and fibered categories. This will help us to build our way to the definition of a stack. The important result we need is that for any scheme \\(X\\), the functor \\(\\mathscr{H}_X\\) is a sheaf on the fppf site of \\(X\\). Another important result is something called faifully flat descent. The idea is that a certain property of schemes can be via a cartesian square with a fppf side. I will also talk a little about Grothendieck’s relative point of view, which is a concept fairly new to me as well.","link":"/archives/9693c172/"},{"title":"Week 1: Galois cohomology and Mordell—Weil theorem","text":"“In mathematics the art of proposing a question must be held of higher value than solving it.” George Cantor This week I finally finished my final project for my PMATH 499 reading course in arithmetic geometry. My project is called “Galois cohomology and weak Mordell—Weil theorem”, which is available here. Galois cohomology is the application of group cohomology to Galois groups. In particular, we know that for a perfect field \\(k\\) with an algebraic closure \\(K\\), the Galois group \\(\\mathrm{Gal}(K/k)\\) is isomorphic to an inverse limit of topological Galois groups \\(\\mathrm{Gal}(L/k)\\) ranging over the finite Galois extensions \\(L/k\\) with the natural projections. This fact makes \\(G\\) a profinite group, and the Krull topology, the topology of \\(G\\) endowed by the inverse limit process by viewing each finite Galois group as a topological group with the discrete topology, is a topology where a basis for the neighborhood at the identity is the collection of normal subgroups having finite index in \\(G\\). This is a motivation to use homological algebra in such situation. My final project focuses on the proof of the weak Mordell—Weil theorem, which states that for any elliptic curve \\(E\\), the group \\(E(k)/nE(k)\\) is finite for all \\(n\\ge 2\\). This is an important step in the proof of the Mordell—Weil theorem which states the elliptic curve groups are finitely generated. The proof of Mordell—Weil involves in applying an infinite descent argument to weak Mordell—Weil, which I will not go into detail. The motivating observation is that we have an exact sequence of topological \\(\\mathrm{Gal}(K/k)\\)-modules \\[\\mathbf{0}\\rightarrow E(K)[n]\\rightarrow E(K)\\xrightarrow{n}E(K)\\rightarrow\\mathbf{0}\\]This short exact sequence induces a long exact sequence of cohomology groups, which we truncate after the first cohomology groups. The first cohomology group can be viewed as the group of crossed homomorphisms module the principal crossed homomorphisms, where a crossed homomorphism is some \\(f\\) with \\(f(gh)=gf(h)+f(g)\\) for all \\(g,h\\) and a principal crossed homomorphism is a homomorphism where there exists \\(m\\) with \\(f(g)=gm-m\\) for all \\(g\\). This can be verified by just computing out the differential. Next, we define the \\(n\\)-Selmer groups and the Tate-Shafarevich group, which is applied to the induced exact sequence we just found in order to obtain a better bound for the group \\(E(k)/nE(k)\\). Finally, the finiteness of \\(E(k)/nE(k)\\) is obtained from the finiteness of the Selmer groups.","link":"/archives/7dbb66b9/"},{"title":"Week 2: Grothendieck topology, sites, and topoi","text":"“Complex analysis is the good twin and real analysis the evil one: beautiful formulas and elegant theorems seem to blossom spontaneously in the complex domain, while toil and pathology rule the reals.” Charles Pugh This week I plan to start writing about what I’ve learned in PMATH 965 on algebraic stacks. In the end of this semaster hopefully I will have written enough about them in this blog so that I can complie them into actual typesetted notes. We start by revisiting étale morphisms and introducing Grothendieck topologies and sites, and we define presheaves and sheaves on sites and show that they work almost the same as the usual presheaves and sheaves we are accostomed to. Then, we will define important sites such as the big and small Zariski sites and étale sites as well as the fppf site. Étale morphisms of schemesFirst, we revisit the definitions and properties of étale morphisms of schemes. Definition 3. A morphism of schemes \\(f:X\\rightarrow Y\\) is étale if one of these equivalent conditions holds \\(f\\) is smooth and locally quasi-finite, \\(f\\) is smooth and unramified, \\(f\\) is flat and unramified, \\(f\\) is locally of finite presentation and formally étale \\(f\\) is locally of finite presentation and locally a standard étale morphism, There are many more equivalent definitions of étale morphisms listed on wikipedia. Intuitively, I think of étale morphisms analogous to covering maps. We need this notion to define the étale topology which we will need to use later. As a side note, there is also something called the étale fundamental group, which also uses the notion of étale morphisms. We recall these properties of étale morphisms. Proposition 4. compotision of étale maps are étale, if \\(f:Y\\rightarrow X\\) is étale then its base change \\(Y\\times_XZ\\rightarrow Z\\) is étale, if \\(f:Y\\rightarrow X\\) and \\(g:Z\\rightarrow X\\) are étale and \\(g=f\\circ h\\) where \\(h:Z\\rightarrow Y\\), then \\(h\\) is étale given algebraically closed field \\(k\\) and \\(k\\)-algebra \\(A\\), then the morphism \\(\\mathrm{Spec}(A)\\rightarrow\\mathrm{Spec}(k)\\) is étale iff it is the disjoint union of spectra of finite separable field extensions of \\(k\\). Now, we are ready to define Grothendieck topology and sites. Grothendieck topology, sites, and topoiRecall that a presheaf (of sets) on a topological space \\(X\\) is a contravariant functor \\(\\mathscr{F}:\\mathrm{Op}(X)\\rightarrow\\mathbf{Set}\\), and a presheaf is a sheaf when \\(\\mathscr{F}(U)\\rightarrow\\prod_{i}\\mathscr{F}(U_i)\\rightrightarrows\\prod_{i,j}\\mathscr{F}(U_i\\cap U_j)\\) is an equalizer for every open cover \\(\\{U_{i}\\}\\) of any open \\(U\\subseteq X\\), which is equivalent to the identity and gluability axioms. We want to extend this from \\(\\mathrm{Op}(X)\\) to any category \\(\\mathcal C\\). To do this, we need to add some additional structure on the category \\(\\mathcal C\\) so that its objects can be viewed as “open sets” and morphisms can be viewed as “inclusions”. Grothendieck’s insight is that we don’t need the full strength of a topology to define sheaves, we only need intersections and a notion of when a collection of an open set forms an open cover of it. Definition 1. A Grothendieck topology on a category \\(\\mathcal C\\) is the data of a set of coverings of \\(U\\), written as \\(\\mathrm{Cov}(U)\\), for each object \\(U\\in \\mathcal C\\), where each covering \\(S\\in\\mathrm{Cov}(U)\\) is a set of morphisms of \\(\\mathcal C\\) with \\(U\\) as targets, such that for all \\(U\\in\\mathcal C\\) for each isomorphism \\(\\varphi:V\\rightarrow U\\), we have \\(\\{\\varphi\\}\\in \\mathrm{Cov}(U)\\) if \\(\\{V_i\\rightarrow U\\}\\in\\mathrm{Cov}(U)\\) and \\(\\{W_{i,j}\\rightarrow V_i\\}\\in\\mathrm{Cov}(V_i)\\) for each \\(i\\), then \\(\\{W_{i,j}\\rightarrow U\\}\\in\\mathrm{Cov}(U)\\) for \\(\\{V_i\\rightarrow U\\}\\in\\mathrm{Cov}(U)\\) and \\(W\\rightarrow U\\), all \\(W\\times_UV_i\\) exists and \\(\\{W\\times_UV_i\\rightarrow W\\}\\in\\mathrm{Cov}(W)\\) A category \\(\\mathcal C\\) equipped with a choice of Grothendieck topology, also denoted \\(\\mathcal C\\), is a site. A continuous map of sites \\(f:\\mathcal C\\rightarrow\\mathcal D\\) is a functor such that \\(\\{f(X_i)\\rightarrow f(X)\\}\\in \\mathrm{Cov}_{\\mathcal D}(f(X))\\) for all \\(\\{X_i\\rightarrow X\\}\\in \\mathrm{Cov}_{\\mathcal C}(X)\\). For example, \\(\\mathrm{Op}(X)\\) for a topological space \\(X\\) can be made into a site using the usual notion of covering. We note that in \\(\\mathrm{Op}(X)\\) we have the fibered product \\(U\\times_X V=U\\cap V\\) for all open \\(U,V\\subseteq X\\), which agrees with the usual notion of intersection. For a category \\(\\mathcal C\\) with \\(X\\in\\mathcal C\\), the category of objects over \\(X\\), denoted \\(\\mathcal C/X\\) is the category where objects are morphisms \\(Y\\rightarrow X\\) in \\(\\mathcal C\\) and morphisms between \\(Y_1\\rightarrow X\\) and \\(Y_2\\rightarrow X\\) are all morphisms \\(Y_1\\rightarrow Y_2\\) in \\(\\mathcal C\\) such that the obvious triangle commutes, i.e. \\((Y_1\\rightarrow Y_2\\rightarrow X)=Y_1\\rightarrow X\\). If \\(\\mathcal C\\) is a site, then \\(\\mathcal C/X\\) can be given a site structure, by letting \\(\\mathrm{Cov}(U\\rightarrow X)\\) in \\(\\mathcal C/X\\) be \\(\\mathrm{Cov}(U)\\) in \\(\\mathcal C\\). The site \\(\\mathcal C/X\\) is called the localization of the site \\(\\mathcal C\\) at \\(X\\). Suppose \\(X\\) is a scheme, then we say that the big Zariski (resp. big étale, resp. fppf) site, denoted \\((\\mathbf{Sch}/X)_{\\mathrm{Zar}}\\) (resp. \\((\\mathbf{Sch}/X)_{\\mathrm{ét}}\\), resp. \\((\\mathbf{Sch}/X)_{\\mathrm{fppf}}\\)) of \\(X\\), is the site with the category \\(\\mathbf{Sch}/X\\) and \\(\\{Y_i\\rightarrow Y\\}\\in\\mathrm{Cov}(U)\\) iff each \\(Y_i\\rightarrow Y\\) is an open immersion with \\(Y=\\bigcup_i Y_i\\) (resp. each \\(Y_i\\rightarrow Y\\) is étale with \\(\\coprod_i Y_i\\rightarrow Y\\) surjective, resp. each \\(Y_i\\rightarrow Y\\) is flat and locally of finite presentation with \\(\\coprod_i Y_i\\rightarrow Y\\) surjective). An element of \\(\\mathrm{Cov}(U\\rightarrow X)\\) is called a Zariski cover (resp. étale cover, resp. fppf cover) of \\(U\\). The small Zariski site (resp. small étale site) of \\(X\\), denoted \\(X_{\\mathrm{Zar}}\\) (resp. \\(X_{\\mathrm{ét}}\\)) is the site whose category is the full subcategory of \\(\\mathrm{Sch}/X\\) where each object \\(U\\rightarrow X\\) is an open immersion (resp. étale), and the coverings are the same as the big Zariski (resp. big étale) site. The small Zariski site of \\(X\\) is equivalent to the site \\(\\mathrm{Op}(X)\\). Moreover, we have the following inclusions\\[\\{\\mathrm{Zariski\\ cover}\\}\\hookrightarrow\\{\\mathrm{étale\\ cover}\\}\\hookrightarrow\\{\\mathrm{fppf\\ cover}\\}\\]Next, we discuss presheaves and sheaves on a site. This whole business is to get new cohomology theories such as étale cohomology, because basic sheaf cohomology is insufficient for our needs. Definition 2. A presheaf (of sets) on a site \\(\\mathcal C\\) is a contravariant functor \\(\\mathscr{F}:\\mathcal C\\rightarrow\\mathbf{Set}\\), and a presheaf is a sheaf iff \\(\\mathscr{F}(U)\\rightarrow\\prod_{i}\\mathscr{F}(U_i)\\rightrightarrows\\prod_{i,j}\\mathscr{F}(U_i\\times_U U_j)\\) is an equalizer for all \\(U\\in\\mathcal C\\) and \\(\\{U_i\\rightarrow U\\}\\in\\mathrm{Cov}(U)\\). A presheaf is called separated if for all \\(U\\in\\mathcal C\\) and \\(\\{U_i\\rightarrow U\\}\\in\\mathrm{Cov}(U)\\), the map \\(\\mathscr{F}(U)\\rightarrow \\prod_i\\mathscr{F}(U_i)\\) is injective. We write \\(\\mathrm{Sh}(\\mathcal C)\\) (resp. \\(\\mathrm{PSh}(\\mathcal C)\\)) for the category of sheaves (resp. presheaves) of the site \\(\\mathcal C\\). Note that a separated presheaf can be viewed as a presheaf that only satisfies one of the axioms of a sheaf, the identity axiom, but not necessaily the gluability axiom, therefore we have the obvious inclusions\\[\\{\\mathrm{sheaves}\\}\\hookrightarrow\\{\\mathrm{separated\\ presheaves}\\}\\hookrightarrow\\{\\mathrm{presheaves}\\}\\]all of which admits left adjoints, the composition of them being sheafification. Usually, we can formulate sheafification in terms of compatible germs, but since we are working over sites, it does not make sense to take a point in an object and take the product of stalks. The way we construct the adjoint from presheaves to separated presheaves is to map a presheaf \\(\\mathscr{F}\\) to \\(\\mathscr{F}^{\\mathrm s}(U)=\\mathscr{F}(U)/\\sim\\) where \\(a\\sim b\\) iff exists \\(\\{U_i\\rightarrow U\\}\\in\\mathrm{Cov}(U)\\) such that \\(a,b\\) are mapped to the same element by the map \\(\\mathscr{F}(U)\\rightarrow \\prod_i\\mathscr{F}(U_i)\\). We can check that this is in fact a separated presheaf. All of the above works for (pre)sheaves of rings, abelian groups, etc. Definition 3. A topos is a category equivalent to \\(\\mathrm{Sh}(\\mathcal C)\\) for a site \\(\\mathcal C\\). A morphism of topoi \\(f:\\mathcal{T}_1\\rightarrow \\mathcal{T}_2\\) is an adjoint pair \\(f^*\\dashv f_*\\) of functors \\(f^*:\\mathcal{T}_1\\rightarrow \\mathcal{T}_2\\) and \\(f_*:\\mathcal{T}_2\\rightarrow \\mathcal{T}_1\\) with a choice of natural isomorphism\\[\\Phi:\\mathrm{Mor}_{\\mathcal T_1}(f^*(-),-)\\rightarrow \\mathrm{Mor}_{\\mathcal T_2}(-,f_*(-))\\]where each naturality here means \\(\\Phi\\) is natural in each of the two dashes, and \\(f^*\\) commutes with finite limits (or equivalently \\(f_*\\) with finite colimits) when they exist. Define composition in the obvious way. We remark that in the above definition, commuting with finite limits is equivalent to checking that \\(f^*\\) commutes with finite products and preserve equalizers.","link":"/archives/46fca3c5/"}],"tags":[{"name":"Number Theory","slug":"Number-Theory","link":"/tags/Number-Theory/"},{"name":"Euclidean Geometry","slug":"Euclidean-Geometry","link":"/tags/Euclidean-Geometry/"},{"name":"Algebraic Geometry","slug":"Algebraic-Geometry","link":"/tags/Algebraic-Geometry/"},{"name":"Arithmetic Geometry","slug":"Arithmetic-Geometry","link":"/tags/Arithmetic-Geometry/"},{"name":"Complex Geometry","slug":"Complex-Geometry","link":"/tags/Complex-Geometry/"}],"categories":[{"name":"Projects","slug":"Projects","link":"/categories/Projects/"},{"name":"This Week I Learned","slug":"This-Week-I-Learned","link":"/categories/This-Week-I-Learned/"},{"name":"Articles","slug":"Articles","link":"/categories/Articles/"}]}