{"pages":[{"title":"Personal Projects","text":"The following projects of mine are licensed under Creative Common BY-NC 4.0, which means that you are free to share or adapt these works for non-commercial purposes if you give appropriate credit. Project Sigma: The EgregiumIn a nutshell, Project Sigma is a collection of my personal course notes on various math subjects, titled The Egregium. All course notes in this collection will have their own GitHub repository. Read more: Project Sigma. Project Lambda: This Week I LearnedProject Lambda is my personal project of a weekly column titled This Week I Learned, where I write about the interesting theorems, examples, and exercises that I came across in the past week, and more. All articles of this column are in the category This Week I Learned. Read more: Project Lambda.","link":"/projects/index.html"},{"title":"Welcome to \"The Singularity\"!","text":"Hi, my name is Yunhai Xiang (in Chinese: 项云海, pronounced as “yun-hi shang”). I’m an undergraduate pure math student at the University of Waterloo, Canada. I can be reached via email y38xiang@uwaterloo.ca, and my GitHub profile is yunhaixiang. The Singularity is my personal blog where I post math related content at least biweekly. I am interested in algebraic geometry, and hence the majority of my posts will be related to it. I will also post about my Personal Projects which range from collections of my course notes to my weekly column posts. Moreover, I occasionally post about my life, the books I read, video games I played, and more.","link":"/about/index.html"}],"posts":[{"title":"Project Lambda: This Week I Learned","text":"Project Lambda is my personal project of a weekly column titled This Week I Learned, where I post a new article under the category This Week I Learned each week on Friday or Saturday. In each of those articles, I will write about the following things An overview of the past week. I will briefly go over the things I studied in the past week: which books and papers I’ve read and what exercises I’ve done. In particular, I will highlight any interesting or important theorems, facts, examples or exercises I came over, as well as my questions and confusions. Objectives of next week. I will talk about what I want to study for the next week. Anythings else that’s interesting. I will write about anything else that interests me, such as math competition problems, brain teasers, mathematical anecdotes, or even things completely unrelated to math. Note that this project is licensed under Creative Common BY-NC 4.0, which means that you are free to share or adapt these documents for non-commercial purposes if you give appropriate credit.","link":"/archives/1d22c5ec/"},{"title":"Week 1: Galois cohomology and Mordell-Weil theorem","text":"“In mathematics the art of proposing a question must be held of higher value than solving it.” George Cantor This week I finally finished my final project for my PMATH 499 reading course in arithmetic geometry. My project is called “Galois cohomology and weak Mordell–Weil theorem”, which is available here. Galois cohomology is the application of group cohomology to Galois groups. In particular, we know that for a perfect field \\(k\\) with an algebraic closure \\(K\\), the Galois group \\(\\mathrm{Gal}(K/k)\\) is isomorphic to an inverse limit of topological Galois groups \\(\\mathrm{Gal}(L/k)\\) ranging over the finite Galois extensions \\(L/k\\) with the natural projections. This fact makes \\(G\\) a profinite group, and the Krull topology, the topology of \\(G\\) endowed by the inverse limit process by viewing each finite Galois group as a topological group with the discrete topology, is a topology where a basis for the neighborhood at the identity is the collection of normal subgroups having finite index in \\(G\\). This is a motivation to use homological algebra in such situation. My final project focuses on the proof of the weak Mordell–Weil theorem, which states that for any elliptic curve \\(E\\), the group \\(E(k)/nE(k)\\) is finite for all \\(n\\ge 2\\). This is an important step in the proof of the Mordell–Weil theorem which states the elliptic curve groups are finitely generated. The proof of Mordell–Weil involves in applying an infinite descent argument to weak Mordell–Weil, which I will not go into detail. The motivating observation is that we have an exact sequence of topological \\(\\mathrm{Gal}(K/k)\\)-modules \\[\\mathbf{0}\\rightarrow E(K)[n]\\rightarrow E(K)\\xrightarrow{n}E(K)\\rightarrow\\mathbf{0}\\]This short exact sequence induces a long exact sequence of cohomology groups, which we truncate after the first cohomology groups. The first cohomology group can be viewed as the group of crossed homomorphisms module the principal crossed homomorphisms, where a crossed homomorphism is some \\(f\\) with \\(f(gh)=gf(h)+f(g)\\) for all \\(g,h\\) and a principal crossed homomorphism is a homomorphism where there exists \\(m\\) with \\(f(g)=gm-m\\) for all \\(g\\). This can be verified by just computing out the differential. Next, we define the \\(n\\)-Selmer groups and the Tate-Shafarevich group, which is applied to the induced exact sequence we just found in order to obtain a better bound for the group \\(E(k)/nE(k)\\). Finally, the finiteness of \\(E(k)/nE(k)\\) is obtained from the finiteness of the Selmer groups.","link":"/archives/7dbb66b9/"},{"title":"Nine Point Circle and Feuerbach's Theorem","text":"I’ve been playing with the Manim library lately. Here’s a test animation I made demonstrating the nine point circle and part of Feuerbach’s theorem. It should be noted that Feuerbach’s Theorem also tells us that the nine point circle of a triangle is tangent to the three excircles of that triangle, but I did not include that in the video.","link":"/archives/e3b6140a/"},{"title":"Project Sigma: The Egregium","text":"Project Sigma is a collection of my personal course notes on various mathematical topics, titled The Egregium. I decided to start this project primarily as a motivation for myself to learn and as a way of recording my learning progress. That being said, it would also make me very happy if someone else benefits from my work. Each of the subject will have their own GitHub repository, typically named as “Project-Sigma-XXX” where XXX is an abbriviation of the subject. They will probably contain errors, and if you found one, you are welcomed to open an issue page on the respective repository and point out my mistake. Currently, the following subjects are planned. Subject Repository Release Algebraic Geometry Project-Sigma-ALG Incomplete I also plan to add new subjects in the future, but only after the current ones are almost completed. To download, either click the link under the Release tab or go to the corresponding repository and clone the repository directly. When writing these notes, I will try to adhere to the following philosophies: Consistent and unambiguous notation: this means that I will follow the same notation conventions for all of the course notes and exercises. I will also clearly state any abuse of notation I will use. Sketches of proof: this means that I will provide bullet points of my reasoning for many of the exercises and theorems instead of providing full proofs. I will try to make them as perspicuous and coherent as I can. Prototypical examples: this means that I will give quintessential examples and non-examples for important notions. Examples help myself to build intuitions for abstract concepts. Finally, note that this project is licensed under Creative Common BY-NC 4.0, which means that you are free to share or adapt these documents for non-commercial purposes if you give appropriate credit. I hope you enjoy reading these notes as I enjoyed writing them!","link":"/archives/2b4d8af0/"},{"title":"Forgetful Functor, Fall 2021","text":"Forgetful Functor is an online learning seminar in algebraic geometry held by undergraduate students at University of Waterloo in Fall 2021. Anyone with a strong interest in algebraic geometry is welcomed to join! To join the seminar, contact the organizer Yunhai Xiang via email &#121;&#51;&#56;&#x78;&#105;&#x61;&#110;&#103;&#x40;&#x75;&#119;&#97;&#x74;&#101;&#114;&#x6c;&#111;&#111;&#x2e;&#x63;&#97;. The main text we follow is Foundations of Algebraic Geometry by Ravi Vakil. We read 1.5 chapters per week, and have a 30 minute to 1 hour discussion each Saturday on 7 PM EDT, in which a main speaker gives an overview of the reading material of the past week and we discuss problems together. Some other texts we use are Algebraic Geometry by Robin Hartshorne and Categories and Homological Algebra by Pierre Schapira. Here are the details for each week’s meeting. Week Notes Recording Speaker Topics 1 Sept 18 Week 1 Yunhai Xiang categories, functors, limits, adjoints, sheaves","link":"/archives/607fbcab/"}],"tags":[{"name":"Number Theory","slug":"Number-Theory","link":"/tags/Number-Theory/"},{"name":"Euclidean Geometry","slug":"Euclidean-Geometry","link":"/tags/Euclidean-Geometry/"},{"name":"Algebraic Geometry","slug":"Algebraic-Geometry","link":"/tags/Algebraic-Geometry/"},{"name":"Arithmetic Geometry","slug":"Arithmetic-Geometry","link":"/tags/Arithmetic-Geometry/"}],"categories":[{"name":"Projects","slug":"Projects","link":"/categories/Projects/"},{"name":"This Week I Learned","slug":"This-Week-I-Learned","link":"/categories/This-Week-I-Learned/"},{"name":"Articles","slug":"Articles","link":"/categories/Articles/"}]}