{"pages":[{"title":"Welcome!","text":"Hello and welcome to The Singularity, a blog about mathematics and many other interesting things! My name is Yunhai Xiang (in Chinese: 项云海, pronounced “yee-o-en-hi si-ang”), he/him, and I also go by Daniel. I’m a grad student of pure mathematics at Western University. For more information, see my academic website. I started this math blog when I was a third year undergraduate student as a motivation for myself to learn and a way of recording my learning progress. Here, I write expositions about the math that I learned recently. I also write about my recent projects, talks, thoughts, ideas, and many things outside math that I enjoy.","link":"/about/index.html"}],"posts":[{"title":"A Topological Proof of the Insolvability of the Quintic","text":"It is a well known fact that there is no general formula for quintic equations or algebraic equations of any higher degree, and a typical proof of this fact uses heavy machinery from Galois theory. However, there is a far more elementary but much less well known proof by V.I. Arnold using nothing more than basic knowledge of complex numbers and topology. Last week, I gave a talk on the Short Attention Span Math Seminars organized by the Pure Math Club at University of Waterloo. In my talk, I explained the main idea of his proof: moving the coefficients along loops to induce permutations of the roots. I also talked about how it could be turned into a rigorous proof using Riemann surfaces of algebraic functions and their monodromy groups, as well as its connections to Galois theory. In the end, I also discussed briefly some ideas related to this proof. Here are my slides. In my talk I used Fred Akalin’s javascript program which visualizes the permutations of roots. He also has a very well written exposition on the same topic which you should definitely check out. I’m also very grateful to Faisal Al-Faisal for suggesting me to do this topic.","link":"/archives/31598439/"},{"title":"Bruhat Order and Sperner Property","text":"“Mathematics is the music of reason.” James J. Sylvester This week is the first week of the spring term and also my first week of undergraduate research with Prof. Satriano, so I decided to write about a research paper I’ve given to read, this one. In a nutshell, the paper proves a combinatorical conjecture posed by McKinnon, Satriano and Huang, about orbits on a hyperplane under permutation. Specifically, suppose that \\(\\sigma\\in S_n\\) acts on \\(v\\in\\mathbf R^n\\) by permutation, and let \\(\\mathcal{O}(v, w)=\\{\\sigma\\in S_n: w\\cdot \\sigma v=0\\}\\). We prove a best bound for the number of vectors obtained by permutation of coordinates that are contained in a hyperplane through the origin except for \\(\\sum_ix_i=0\\), where \\(n\\ge 3\\). In notations, we have the following theorem. Theorem 1. For \\(n\\ge 3\\), we have\\[\\max\\{|\\mathcal{O}(v,w)|: v\\in S,w\\in\\mathbf{R}^n\\}=2\\lfloor n/2\\rfloor (n-2)!\\]where \\(S=\\{v\\in \\mathbf R^n: v\\cdot \\mathbf{1}\\ne 0, v\\mathrm{\\ has\\ distinct\\ coordinates}\\}\\). An explicit construction that achieves this bound is given by McKinnon, Satriano and Huang, so it suffice to show that this is the best bound. The proof uses Bruhat order and Sperner property. Bruhat orderSuppose \\(\\alpha\\vdash n\\) with \\(\\ell(\\alpha)=m\\), and \\(i_j=\\sum_{k=1}^j\\alpha_j\\) for \\(j=0,1\\dots,m\\). Let \\(X_{\\alpha}\\) be the set of ordered set partitions of type \\(\\alpha\\). Naturally, we have \\(\\alpha^*\\in X_{\\alpha}\\) where \\(\\alpha^*_j=\\{i_j+1,i_j+2,\\dots,i_{j+1}\\}\\). Let \\(S(\\alpha)=\\{i_1,\\dots,i_{m-1}\\}\\). We have \\(S_n\\) acts on \\(X_{\\alpha}\\) by element, which is a transitive action. Thus identify \\(X_{\\alpha}\\cong S_n/S_\\alpha\\) where \\(S_{\\alpha}\\) is the stabilizer of \\(\\alpha^*\\). Denote \\(\\alpha!=|S_{\\alpha}|=\\prod_{i}\\alpha_i!\\) Definition 2. The Bruhat order on \\(S_n/S_\\alpha\\) is the transitive closure (they are connected by relations of the following kind) of \\(B&lt;(i\\ j)B\\) for \\(B\\in S_n/S_\\alpha\\) where \\(i\\in B_a\\) and \\(j\\in B_b\\) and \\(a&lt;b\\) and \\(i&lt;j\\). We note that the Bruhat order on \\(S_n/S_{(1,\\dots,1)}\\) is just the usual Bruhat order on \\(S_n\\). For \\(B\\in S_n/S_\\alpha\\) let \\(\\operatorname{word}(B)\\) be the permutation by concatonating the numbers in each set written in their usual order. This sends ordered set partitions to a more common definition: \\(\\sigma\\in S_n\\) where \\(\\sigma(i)&gt;\\sigma(i+1)\\) implies \\(i\\in S(\\alpha)\\), and Bruhat order restricted to such permutations. There is an obvious bijection \\((S_n/S_\\alpha)\\times S_\\alpha\\rightarrow S_n\\) by \\((B,\\sigma)\\mapsto \\operatorname{word}(B)\\sigma\\). The \\(\\alpha\\)-Bruhat order \\(\\le_{\\alpha}\\) on \\(S_n\\) is the image of \\((B,\\sigma)\\le (B^\\prime,\\sigma^\\prime)\\) iff \\(\\sigma=\\sigma^\\prime\\) and \\(B\\le B^\\prime\\) in Bruhat order under the aforementioned bijection, which is isomorphic to \\(\\alpha!\\) isomorphic copies of \\(S_n/S_\\alpha\\). If \\(w\\in\\mathbf R^n\\), define \\(\\operatorname{comp}(w)\\vdash n\\) as the composition of lengths of the weekly increasing components. An antichain in a poset is a set consisting of elements from different disjoint components. Lemma 3. Suppose \\(v\\in\\mathbf R^n\\) is stricly increasing and \\(w\\in\\mathbf R^n\\) weakly increasing, then \\(\\mathcal O(v,w)\\) is an antichain in the \\(\\alpha\\)-Bruhat order where \\(\\alpha=\\operatorname{comp}(w)\\). Proof Suppose \\(\\pi\\in S_{\\alpha}\\) and \\(\\tau=\\operatorname{word}(B)\\) for some \\(B\\in S_n/S_\\alpha\\). Suppose \\(i\\in B_a\\) and \\(j\\in B_b\\) for \\(i&lt;j\\) and \\(a&lt;b\\). We have \\(\\tau \\pi&lt; (i\\ j)\\tau \\pi\\). Next, we compute that\\[w\\cdot \\tau\\pi v-w\\cdot (i\\ j)\\tau \\pi v=(w_j-w_i)(v_{\\pi^{-1}\\tau^{-1}(j)}-v_{\\pi^{-1}\\tau^{-1}(i)})\\]Since \\(\\tau^{-1}(i)\\) is at a lower interval than \\(\\tau^{-1}(j)\\) (since \\(a&lt;b\\)) and \\(\\pi^{-1}\\) preserves these intervals, we have \\(v_{\\pi^{-1}\\tau^{-1}(j)}&gt;v_{\\pi^{-1}\\tau^{-1}(i)}\\). Since we have \\(w_i&lt;w_j\\) by assumption, we have \\(w\\cdot \\tau\\pi v&gt;w\\cdot (i\\ j)\\tau \\pi v\\). Therefore, if \\(\\sigma&lt;_{\\alpha}\\sigma^\\prime\\) then \\(w\\cdot \\sigma v&gt;w\\cdot \\sigma^\\prime v\\). Therefore, we can bound the sizes of antichains in the \\(\\alpha\\)-Bruhat order. Sperner propertyWe use \\(q\\)-polynomials to bound the sizes of antichains. Specifically, we will make use of the Sperner property of \\(S_n/S_\\alpha\\): it is a ranked poset where the set of elements of rank \\(r\\), for some fixed \\(r\\), forms an antichain of maximal size. The rank generating function of \\(S_n/S_\\alpha\\) is the \\(q\\)-binomial coefficient \\(\\begin{bmatrix}n\\\\ \\alpha\\end{bmatrix}_q\\). Theorem 4. Let \\(v,w\\in\\mathbf R^n\\) where \\(v\\) has distinct coordinates, then\\[|\\mathcal{O}(v,w)|\\le \\alpha!M\\left(\\begin{bmatrix}n\\\\ \\alpha\\end{bmatrix}_q\\right)\\]where \\(\\alpha=\\operatorname{comp}(w)\\) and \\(M:\\mathbf{Z}[q]\\rightarrow\\mathbf Z\\) is the map that takes the maximum coefficient. Proof Since \\(|\\mathcal{O}(v,w)|=|\\mathcal{O}(\\sigma v,\\tau w)|\\) for any \\(\\sigma,\\tau\\in S^n\\), we can assume \\(v\\) is strictly increasing and \\(w\\) weakly increasing. By the previous lemma, we have \\(\\mathcal{O}(v,w)\\) is an antichain in the \\(\\alpha\\)-Bruhat order on \\(S_n\\), and hence also on \\(S_n/S_\\alpha\\times S_\\alpha\\). By the Sperner property, we have this bound. Therefore, it suffice to bound the coefficients of \\(\\begin{bmatrix}n\\\\ \\alpha\\end{bmatrix}_q\\). Bounding coefficientsGiven \\(\\alpha,\\beta\\vdash n\\), then we say \\(\\beta\\) refines \\(\\alpha\\), written as \\(\\alpha\\prec \\beta\\), if \\(\\beta\\) is obtained from \\(\\alpha\\) by decomposing its entries. Lemma 5. If \\(\\alpha,\\beta\\vdash n\\) and \\(\\alpha\\prec \\beta\\), then \\(\\beta !M\\left(\\begin{bmatrix}n\\\\ \\beta\\end{bmatrix}_q\\right)\\le \\alpha! M\\left(\\begin{bmatrix}n\\\\ \\alpha\\end{bmatrix}_q\\right)\\). Proof Assume \\(\\beta=(\\alpha_1,\\dots,\\alpha_{i-1},\\alpha_{i}-p,p,\\alpha_{i+1},\\dots,\\alpha_m)\\), then\\[\\beta!\\begin{bmatrix}n\\\\ \\beta\\end{bmatrix}_q=\\binom{\\alpha_i}{p}^{-1}\\begin{bmatrix}\\alpha_i\\\\ p\\end{bmatrix}_q \\alpha!\\begin{bmatrix}n\\\\ \\alpha\\end{bmatrix}_q\\]The lemma follows from \\(M(fg)\\le f(1)M(g)\\). Eventually, with some lengthy calculations, we have \\(M\\left(\\begin{bmatrix}n\\\\ k\\end{bmatrix}_q\\right)\\le \\displaystyle\\frac{1}{n}\\binom{n}{k}\\) for \\(n\\ge 0\\) and \\(2 &lt; k &lt; n-2\\). Theorem 1. For \\(n\\ge 3\\), we have\\[\\max\\{|\\mathcal{O}(v,w)|: v\\in S,w\\in\\mathbf{R}^n\\}=2\\lfloor n/2\\rfloor (n-2)!\\]where \\(S=\\{v\\in \\mathbf R^n: v\\cdot \\mathbf{1}\\ne 0, v\\mathrm{\\ has\\ distinct\\ coordinates}\\}\\). Proof If \\(\\operatorname{comp}(w)\\) has \\(1\\) part then obviously \\(|\\mathcal{O}(v,w)|=0\\). Assume \\(\\operatorname{comp}(w)\\) has at least \\(2\\) parts.\\[\\begin{aligned}|\\mathcal{O}(v,w)|&amp;\\le \\operatorname{comp}(w)!M\\left(\\begin{bmatrix}n\\\\ \\operatorname{comp}(w)\\end{bmatrix}_q\\right)\\\\ &amp;\\le \\operatorname{max}_{\\alpha\\vdash n, \\ell(\\alpha)\\ge 2}\\alpha!M\\left(\\begin{bmatrix}n\\\\ \\alpha\\end{bmatrix}_q\\right)\\\\ &amp;\\le \\operatorname{max}_{0&lt;k&lt;n}k!(n-k)!M\\left(\\begin{bmatrix}n\\\\ k\\end{bmatrix}\\right)\\end{aligned}\\]For \\(2&lt;k&lt;n-2\\), \\[k!(n-k)!M\\left(\\begin{bmatrix}n\\\\ k\\end{bmatrix}\\right)\\le k!(n-k)!\\frac{1}{n}\\binom{n}{k}=(n-1)!\\] We see that if \\(k=1\\) then \\(1!(n-1)!M\\left(\\begin{bmatrix}n\\\\ 1\\end{bmatrix}\\right)=(n-1)!\\) and if \\(k=2\\) then \\[2!(n-2)!M\\left(\\begin{bmatrix}n\\\\ 2\\end{bmatrix}\\right)=2(n-2)!\\lfloor n/2\\rfloor=\\left\\{\\begin{matrix}(n-1)!&amp;n\\mathrm{\\ odd}\\\\ n(n-2)!&amp; n\\mathrm{\\ even}\\end{matrix}\\right.\\]","link":"/archives/66165fd0/"},{"title":"Elementary School Arithmetic from a Higher Perspective","text":"“The introduction of the cipher 0 or the group concept was general nonsense too, and mathematics was more or less stagnating for thousands of years because nobody was around to take such childish steps.” Alexander Grothendieck Recently, I came across a paper by Dan Isaksen, which I find very interesting. It shows that even incredibly basic math, such as the way we learned to add integers in elementary school, could be seen from a much deeper and beautifully illuminating light of group cohomology. The original paper is very accessibe, but I still wanted to share this with you in my own exposition. We begin by revisiting the classic algorthim for adding and subtracting non-negative whole numbers: we align the numbers vertically, we do the operation digit-by-digit, and carrying a \\(1\\) when the digits add to \\(10\\) or more. The “carrying” here is the essence, we will see that this could be interpreted as 2-cocycles in a certain group cohomology. Definition. Suppose \\(Q,N\\) are two groups, then an extension group of \\(Q\\) by \\(N\\) is a group \\(G\\) along with a short exact sequence of groups \\[\\mathbb{1}\\rightarrow N \\xrightarrow{\\ i\\ } G\\xrightarrow{\\ \\pi\\ }Q\\rightarrow \\mathbb{1}\\]i.e. we have (the image of) \\(N\\) is a normal subgroup of \\(G\\) and \\(G/N\\cong Q\\). The extension is said to be a central extension if \\(N\\) lies in the center of \\(G\\), a cyclic extension if \\(G\\) is cyclic, and a split extension if the exact sequence splits, i.e. there exists a map \\(\\tau:Q\\rightarrow G\\) such that \\(\\pi\\circ \\tau=\\mathrm{id}\\) (this is a proper generalization of split exact sequences in the category of abelian groups). The archetypical example in this article is the following. Let \\(\\mathbb Z/100\\mathbb Z\\) be our simplified model of the classic addition algorithm, which captures carrying from the ones digit to the tens digit, so it will suffice for our purpose. Let \\(T\\) be the subgroup of \\(\\mathbb Z/100\\mathbb Z\\) consisting of multiples of \\(10\\), which we call “tens”, and \\(O\\) be the quotient group of \\(\\mathbb Z/100\\mathbb Z\\) by \\(T\\) which we call the “ones”. Obviously \\(T\\cong \\mathbb Z/10\\mathbb Z\\cong O\\), but we note that they have different relationships to \\(\\mathbb Z/100\\mathbb Z\\). We then have a short exact sequence \\(\\mathbb{1}\\rightarrow T \\hookrightarrow \\mathbb Z/100\\mathbb Z\\xrightarrow{\\ \\pi\\ }O\\rightarrow \\mathbb{1}\\), viewed as a group extension. This extension is central, cyclic, but not split. In the following, we will work more generally with an arbitrary extension \\(G\\) of \\(Q\\) by \\(N\\), where all these groups are assumed abelian and written additively. We pick a set-theoretic map \\(\\tau:Q\\rightarrow G\\) s.t. \\(\\pi\\circ\\tau=\\mathrm{id}\\) and \\(\\tau(0)=0\\), and then we have a (set-theoretic) bijective correspondance \\(G\\leftrightharpoons N\\times Q\\) given by \\[G\\ \\xrightleftharpoons[(n,q)\\mapsto n+\\tau(q)]{g\\mapsto (g-\\tau(\\pi(g)),\\pi(g))}\\ N\\times Q\\] Bijectivity is easily verified. In the case of the archetypical example, this bijective correspondance \\(\\mathbb Z/100\\mathbb Z\\leftrightharpoons T\\times O\\) separates the tens and ones digit, e.g. \\(14\\mapsto (10,4)\\), when \\(\\tau\\) is appropriately chosen. We can then express the new addition function in this form, we could easily calculate as \\[(n_1,q_1)+(n_2,q_2)=(n_1+n_2+z(q_1,q_2), q_1+q_2)\\] where \\(z(q_1,q_2)=\\tau(q_1)+\\tau(q_2)-\\tau(q_1+q_2)\\), which we call the carrying function. In the case of our example, we have e.g. \\(z(6,7)=10\\) and \\(z(4,5)=0\\), when \\(\\tau\\) is appropriately chosen. More generally, Definition. We say that a function \\(z:Q\\times Q\\rightarrow N\\) is a carrying function if it satisfies (cocycle condition) \\(z\\left(b, c\\right)-z\\left(a+b, c\\right)+z\\left(a, b+c\\right)-z\\left(a, b\\right)=0\\) (normalization condition) \\(z(a,0)=z(0,a)=0\\) We can verify that \\(z(q_1,q_2)=\\tau(q_1)+\\tau(q_2)-\\tau(q_1+q_2)\\) does satisfy these two conditions. The cocycle condition is derived from the associativity of addition, and the normalization condition is easily verified. Conversely, given two abelian groups \\(N,Q\\) and a (set-theoretic) carrying function \\(z:Q\\times Q\\rightarrow N\\), the set \\(N\\times Q\\) with addition \\((n_1,q_1)+(n_2,q_2)=(n_1+n_2+z(q_1,q_2), q_1+q_2)\\) is a well-defined abelian group. Let \\(G\\) be this group, then \\(G\\) is a group extension of \\(Q\\) by \\(N\\) in the obvious way. For example, let \\(Q=O\\) and \\(N=T\\), and let the carrying function carry 2 when it normally carries 1, then we get the group \\(G=\\mathbb Z/50\\oplus \\mathbb Z/2\\mathbb Z\\). We saw that an extension gives a carrying function, and a carrying function gives rise to an extension. This correspondance is, however, not bijective. An isomorphism of extension is \\(\\phi:G\\rightarrow G^\\prime\\) which restricts to the identity map on \\(N\\rightarrow N^\\prime\\) and induces isomorphism \\(Q\\rightarrow Q^\\prime\\), i.e. an isomorphism must preserve \\(N\\) and \\(Q\\). We then have the following Theorem. Suppose \\(G,G^\\prime\\) are extensions with induced carrying functions \\(z,z^\\prime\\), then TAFE exists a function \\(h:Q\\rightarrow N\\) s.t. for all \\(q_1,q_2\\in Q\\) \\[z(q_1,q_2)-z^\\prime(q_1,q_2)=h(q_1)+h(q_2)-h(q_1+q_2)\\] and satisfies \\(h(0)=0\\) \\(G\\cong G^\\prime\\) as extensions. Proof In one direction, define isomorphism \\(\\phi:G\\rightarrow G^\\prime\\) by \\(\\phi(n,q)=(n+h(q),q)\\), and the rest is a routine check. In the other direction, define \\(h\\) by the formula \\(\\phi(0,q)=(h(q),q)\\). Then we compare the first component of \\(\\phi(0,q_1)+\\phi(0,q_2)=\\phi((0,q_1)+(0,q_2))\\) This gives us motivation to link this to group cohomology. We note that the carrying functions are precisely the 2-cocycles, and the RHS are the 2-coboundaries in the group cohomology \\(H^2(Q;N)=\\operatorname{Ext}^1_{\\mathbb{Z}}(Q, N)\\). Where \\(N\\) is a \\(Q\\)-module acting by conjugation. We can write out explicitly the coboundary map \\(d^{2}: C^1(Q, N) \\rightarrow C^{2}(Q, N)\\) by \\((dh)(q_1,q_2)=h(q_1)+h(q_2)-h(q_1+q_2)\\), which checks out comparing to the previous calculations.","link":"/archives/4cd60098/"},{"title":"Localization of Categories and Derived Category","text":"“Algebraic geometry seems to have acquired the reputation of being esoteric, exclusive, and very abstract, with adherents who are secretly plotting to take over all the rest of mathematics. In one respect this last point is accurate.” David Mumford Continuing last week, we are finally going to define the derived category \\(D(\\mathcal A)\\) for an abelian category \\(\\mathcal A\\). Before we actually do that, we need to introduce localization of categories, and we will define the derived category in terms of a localization of the homotopy category of complexes. Localization of categories is very analogous to localization of rings or modules. Given any category (with no assumption of abelian, additive, triangulated, etc), we formally invert a class of morphisms. We will give one definition in terms of a localization construction and show that it is unsatisfactory in that it does not have a lot of useful and desirable properties. We will then develop a better description of derived categories in terms of roofs. Definition 1. Let \\(\\mathcal A\\) be a category and \\(S\\) a class of morphisms of it, then define its localization as a category \\(\\mathcal A[S^{-1}]\\) and a functor \\(Q:\\mathcal A\\rightarrow A[S^{-1}]\\) s.t. \\(Q(s)\\) is an isomorphism for all \\(s\\in S\\) and \\(Q\\) is universal w.r.t. this property, i.e. if the functor \\(F:\\mathcal A\\rightarrow\\mathcal B\\) is such that \\(F(s)\\) is an isomorphism for each \\(s\\), then there exists a unique functor \\(G:\\mathcal A[S^{-1}]\\rightarrow\\mathcal B\\) s.t. \\(F=G\\circ Q\\). The way we obtain a construction that satisfies this universal property is quite convoluted. We define it this way. Let \\(\\mathcal A[S^{-1}]\\) have the same objects as \\(\\mathcal A\\). For each \\(X,Y\\in\\mathcal A[S^{-1}]\\), let a directed edge between them be a morphism \\(f\\in\\mathrm{Hom}(X,Y)\\) or if \\(s\\in S\\cap \\mathrm{Hom}(X,Y)\\), an edge in the opposite direction \\(s:Y\\rightarrow X\\). A path between two objects \\(M,N\\in A[S^{-1}]\\) is a sequence of directed edges \\(M=L_0, L_1,\\dots,L_n=N\\), where the direction does not need to be the same. We define \\(\\mathrm{Hom}(M,N)\\) as the equivalence class of paths where two paths are equivalent if they can be transformed to each other via a sequence of the following transformations. for \\(X\\xrightarrow{f}Y\\xrightarrow{g}Z\\), replace with \\(X\\xrightarrow{gf}Z\\), for \\(X\\xrightarrow{s} Y\\xleftarrow{s}X\\) where \\(s\\in S\\), replace with \\(X\\xrightarrow{\\mathbf{1}_X} X\\), for \\(Y\\xleftarrow{s} X\\xrightarrow{s}Y\\) where \\(s\\in S\\), replace with \\(Y\\xrightarrow{\\mathbf{1}_Y} Y\\), for \\(X\\xrightarrow{\\mathbf{1}_X}X\\xleftarrow{s} Y\\), replace with \\(X\\xleftarrow{s}Y\\) Long story short, this is a well defined equivalence relation, so it forms a category where composition is concatonation. For the localization functor \\(Q:\\mathcal A\\rightarrow \\mathcal A[S^{-1}]\\), it sends objects to themselves, and morphisms to the equivalence class with the path being the single morphism. Here we should give extra care that the arrows can some times mean directed edges, and is \\(Y\\leftarrow X\\) can mean a path from \\(Y\\) to \\(X\\), only with the directed edge in the opposite direction. We can verify that this indeed satisfies the universal property of localization. We may also check that by this localization construciton, one can write morphisms in the form \\[\\left(Q\\left(f_1\\right) \\circ Q\\left(s_1\\right)^{-1}\\right) \\circ \\cdots \\circ\\left(Q\\left(f_n\\right) \\circ Q\\left(s_n\\right)^{-1}\\right)\\] where \\(s_i\\in S\\). A localizing class \\(S\\) of a category \\(\\mathcal A\\) is a class of morphisms such that all identity morphisms are in \\(S\\). if two morphisms in \\(S\\) compose, then their composition in in \\(S\\). for any \\(f:M\\rightarrow N\\) and \\(s:L\\rightarrow N\\) with \\(s\\in S\\), exists \\(g:K\\rightarrow L\\) and \\(t:K\\rightarrow M\\) with \\(t\\in S\\) s.t. commutes. for any \\(f:N\\rightarrow M\\) and \\(s:N\\rightarrow L\\) with \\(s\\in S\\), exists \\(g:L\\rightarrow K\\) and \\(t:M\\rightarrow K\\) with \\(t\\in S\\) s.t. commutes. for any morphisms \\(f,g:M\\rightarrow N\\), we have \\(\\exists s\\in S, sf=sg \\Longleftrightarrow \\exists t\\in S, ft=gt\\) This is the categorification of the notion of denominator set when localizing non-commutative rings, see Ore condition. In fact a ring can be viewed as an additive category (by delooping). The localizing classes are classes of “nice” morphisms to localize at for which we could develop a description of roofs. For a category \\(\\mathcal A\\) and a localizing class \\(S\\). A morphism \\(Q(f)\\circ Q(s)^{-1}\\) in \\(\\mathcal A[S^{-1}]\\) is represented by a left roof, which is a diagram \\(M\\xleftarrow{s}L\\xrightarrow{f}N\\), and a morphism \\(Q(t)^{-1}\\circ Q(g)\\) with \\(t\\in S\\) is represented by a right roof which is a diagram \\(M\\xrightarrow{g}L\\xleftarrow{t}N\\). We say that the two left roofs \\(M\\xleftarrow{s}L\\xrightarrow{f}N\\) and \\(M\\xleftarrow{t}K\\xrightarrow{g}N\\) are equivalent if there exists \\(p:H\\rightarrow L\\) and \\(q:H\\rightarrow K\\) such that \\(sp,tq\\in S\\) and the diagram commutes. We can show that this is an equivalence relation. The only difficult part is transitivity. This can be done using a diagram chasing argument. We can also define composition of roofs. The composition of the previous two roofs is defined as a composition of the diagram where \\(U\\) and the associated maps are induced from the fact that \\(S\\) is a localizing class. We could check that these satisfies all the desirable properties of a composition. Composition respects equivalence of roofs, is associative, and has an identity given by \\(M\\xleftarrow{\\mathbf{1}_M} M\\xrightarrow{\\mathbf{1}_M} M\\). One can check that the category of (equivalence classes of) left roofs \\(\\mathcal A_S\\) is equivalent to right roofs, so we might as well just work with left roofs. We define a functor \\(Q:\\mathcal A\\rightarrow \\mathcal A_S\\) by letting it be identity on objects and for each morphism \\(f:M\\rightarrow N\\), let \\(Q(f)\\) be the equivalence class of roofs \\(M\\xleftarrow{\\mathbf 1_M}M\\xrightarrow{f} N\\). This satisfies the universal property of localization, hence isomorphic to \\(\\mathcal A[S^{-1}]\\). Theorem 2. For \\(S\\) a localizing class of category \\(\\mathcal A\\), the category \\(\\mathcal A_S\\) and functor \\(Q:\\mathcal A\\rightarrow \\mathcal A_S\\) satisfies the universal property of localization, i.e. \\(Q(s)\\) is an isomorphism for each \\(s\\in S\\) and is universal w.r.t. it. Proof For the first property, \\(M\\xleftarrow{\\mathbf{1}_M}M\\xrightarrow{s}N\\) has an inverse \\(N\\xleftarrow{s}M\\xrightarrow{\\mathbf{1}_M}M\\). Next, suppose \\(F:\\mathcal A\\rightarrow \\mathcal B\\) is such that \\(F(s)\\) is an isomorphism for all \\(s\\in S\\), define functor \\(G:\\mathcal A_S\\rightarrow \\mathcal B\\) as identity on objects, and for morphisms, the following. If \\(\\phi:M\\rightarrow N\\) in \\(\\mathcal A_S\\), choose a representing roof \\(M\\xleftarrow{s}L\\xrightarrow{f}N\\), and define \\(G(\\phi)=F(f)\\circ F(s)^{-1}\\). It’s not immediately obvious that this is well defined on equivalence classes, but we omit the verification. This obviously satisfies \\(F=G\\circ Q\\). It is left to the reader to verify that \\(G\\) respects composition, which is the last piece of verification necessary. If \\(\\mathcal A\\) is an additive category, then localizing it would also have an additive structure. In fact if \\(\\mathcal A\\) is additive, we may restate the last axiom of localizing class as: for \\(f:M\\rightarrow N\\) exists \\(\\exists s\\in S, sf=0\\Longleftrightarrow \\exists t\\in S, tf=0\\). And the inherited additive structure is the obvious one. It is not trivial to check that it is well defined, but again we ommit the verification. Again everything works out as we expected, biproducts, zero objects are preserved, and localization functor is additive. We can also check that \\(f=0\\) in the localization iff exists \\(t\\in S\\) with \\(tf=0\\) iff exists \\(t\\in S\\) with \\(ft=0\\), and \\(M=\\mathbf 0\\) in the localization iff exists \\(N\\in\\mathcal A\\) with \\((N\\xrightarrow{0}M)\\in S\\) iff exists \\(N\\in\\mathcal A\\) with \\((M\\xrightarrow{0}N)\\in S\\). These are easy to prove and left as an exercise. Similarly, one can show the localization of abelian categories is abelian. Given a triangulated category, a natural question to ask is: when is a localization of it also triangulated? In other words, when is the localizing class compatible with triangulation? For a localizing class \\(S\\) in the triangulated category \\(\\mathcal C\\), the localization is compatible with triangulation if the following conditions hold for each morphism \\(f\\), we have \\(f\\in S\\) iff \\(f[1]\\) in \\(S\\). a diagram with \\(s,t\\in S\\) and distinguished rows can be completed to a morphism of distinguished triangles. We can show that if these conditions hold then the localization \\(\\mathcal C[S^{-1}]\\) inherits the triangulated structure \\(QT_{\\mathcal C}\\), and a triangle is distinguished if it is isomorphic to an image of a distinguished triangle. One can show that a cohomological functor on \\(\\mathcal C\\) induces a corresponding cohomological functor on \\(\\mathcal C[S^{-1}]\\). Definition 3. The derived category \\(D(\\mathcal A)\\) of an abelian categroy \\(\\mathcal A\\) is the localization \\(K(\\mathcal A)[S^{-1}]\\) where \\(S\\) is the class of quasi-isomorphisms. Let \\(D^{+}(\\mathcal A),D^{-}(\\mathcal A),D^{b}(\\mathcal A)\\) be the full subcategory of \\(D(\\mathcal A)\\) to the bounded below, bounded above, and bounded complexes. It is an arduous process to verify that the class of quasi-isomorphisms is a localizing class compatible with triangulation, which the readers can do in their own time. Theorem 4. For an abelian category \\(\\mathcal A\\), the functor \\(\\mathcal A\\rightarrow D(\\mathcal A)\\) by \\(X\\mapsto X\\) is fully faithful. Proof I will prove this later.","link":"/archives/d806580c/"},{"title":"Galois Category and Étale Fundamental Group","text":"I’m in a good mood today because it’s my birthday 🎉 and I finally finished recording my final presentation for PMATH 965! For my final presentation, I did an exposition on Galois categories and étale fundamental groups. Here’s the Youtube video of my presentation, and you can download the slides here. In a nutshell, first I gave some motivations from Galois theory and algebraic topology where I made an analogy between the fundamental theorems of Galois theory and covering spaces, I then explained some backgrounds on Galois category and finite étale morphisms, and finally I use these backgrounds to define étale fundamental groups.","link":"/archives/cb0d1d4a/"},{"title":"Galois Cohomology and Mordell—Weil Theorem","text":"“In mathematics the art of proposing a question must be held of higher value than solving it.” George Cantor This week I finally finished my final project for my PMATH 499 reading course in arithmetic geometry. My project is called “Galois cohomology and weak Mordell–Weil theorem”, which is available here. Galois cohomology is the application of group cohomology to Galois groups. In particular, we know that for a perfect field \\(k\\) with an algebraic closure \\(K\\), the Galois group \\(\\mathrm{Gal}(K/k)\\) is isomorphic to an inverse limit of topological Galois groups \\(\\mathrm{Gal}(L/k)\\) ranging over the finite Galois extensions \\(L/k\\) with the natural projections. This fact makes \\(G\\) a profinite group, and the Krull topology, the topology of \\(G\\) endowed by the inverse limit process by viewing each finite Galois group as a topological group with the discrete topology, is a topology where a basis for the neighborhood at the identity is the collection of normal subgroups having finite index in \\(G\\). This is a motivation to use homological algebra in such situation. My final project focuses on the proof of the weak Mordell–Weil theorem, which states that for any elliptic curve \\(E\\), the group \\(E(k)/nE(k)\\) is finite for all \\(n\\ge 2\\). This is an important step in the proof of the Mordell–Weil theorem which states the elliptic curve groups are finitely generated. The proof of Mordell–Weil involves in applying an infinite descent argument to weak Mordell–Weil, which I will not go into detail. The motivating observation is that we have an exact sequence of topological \\(\\mathrm{Gal}(K/k)\\)-modules \\[\\mathbf{0}\\rightarrow E(K)[n]\\rightarrow E(K)\\xrightarrow{n}E(K)\\rightarrow\\mathbf{0}\\]This short exact sequence induces a long exact sequence of cohomology groups, which we truncate after the first cohomology groups. The first cohomology group can be viewed as the group of crossed homomorphisms module the principal crossed homomorphisms, where a crossed homomorphism is some \\(f\\) with \\(f(gh)=gf(h)+f(g)\\) for all \\(g,h\\) and a principal crossed homomorphism is a homomorphism where there exists \\(m\\) with \\(f(g)=gm-m\\) for all \\(g\\). This can be verified by just computing out the differential. Next, we define the \\(n\\)-Selmer groups and the Tate-Shafarevich group, which is applied to the induced exact sequence we just found in order to obtain a better bound for the group \\(E(k)/nE(k)\\). Finally, the finiteness of \\(E(k)/nE(k)\\) is obtained from the finiteness of the Selmer groups.","link":"/archives/7dbb66b9/"},{"title":"Fppf Site, Faithfully Flat Descent, and Fibred Categories","text":"“Serious mathematics (contrary to a popular misconception) is not ‘about’ proofs and logic any more than serious literature is ‘about’ grammar, or music is ‘about’ notes.” Ethan D. Bloch In this week we discuss fppf sites (recall that we defined \\((\\mathbf{Sch}/X)_{\\mathrm{fppf}}\\) in last week) and faithfully flat descent. This will help us to build our way to the definition of a stack. The idea of faifully flat descent is that a certain property of schemes can be descended via a cartesian square with a fppf side. The important result we are building towards is that for any scheme \\(X\\), the functor of points \\(\\mathscr{H}_X\\) is a sheaf on the fppf site of \\(X\\). After this, we can talk about fibred categories. Fibred categories plus descents is categorical stacks, plus geometry is algebraic stacks. Fppf site and faithfully flat descentWe recall that a map of schemes is fppf iff it is faithfully flat (i.e. flat and surjective) and locally of finite presentation, and recall that the fppf site \\((\\mathbf{Sch}/X)_{\\mathrm{fppf}}\\) consists of the fppf covers, i.e. the jointly surjective, flat and locally of finite presentation families of morphisms. We have the following problem. Theorem 1. Suppose \\(X\\rightarrow Y\\) is a morphism of schemes, the functor of points \\(\\mathscr{H}_X\\) is a sheaf on \\((\\mathbf{Sch}/Y)_{\\mathrm{fppf}}\\). Proof Proof is very long, see Theorem 4.1.2 in Olsson’s book. This theorem has a very long proof and the reason it is important is delayed to later. Another important result is faithfully flat descent. The idea is, if \\(P\\) is some property of morphism of schemes, given morphisms of schemes \\(f_1:X_1\\rightarrow Y_1\\) and \\(f_2:X_2\\rightarrow Y_2\\) and suppose there is a commutative diagram then frequently \\(f_1\\) has property \\(P\\) iff \\(f_2\\) does. We say that \\(P\\) is local on the base (target) for the fppf topology (et al. Zariski, etc.) if \\(f_1\\) has property \\(P\\) implies \\(f_2\\) does. Examples of properties that are local on the base for the fppf topology inlcude: surjective, locally of finite type, locally of finite presentation, universally closed/open, separated, proper, etc. The full proof can be found on stacks project. Fibred categoriesFor a category \\(\\mathcal C\\), a category over \\(\\mathcal C\\) is some category \\(\\mathcal F\\) equipped with a functor \\(\\mathscr{P}_{\\mathcal F}:\\mathcal F\\rightarrow\\mathcal C\\). We draw diagrams with the notation \\(\\xi\\mapsto U\\) to mean \\(\\mathscr{P}_{\\mathcal F}(\\xi)=U\\), and a diagram of the form commutes iff \\(\\mathscr{P}_{\\mathcal F}\\phi=f\\). Moreover, we say that a morphism \\(\\phi:\\xi\\rightarrow\\eta\\) in \\(\\mathcal F\\) is cartesian if for all \\(\\zeta\\in\\mathcal F\\) and morphisms \\(\\psi:\\zeta \\rightarrow \\eta\\) and \\(h:\\mathscr{P}_{\\mathcal F}(\\zeta)\\rightarrow \\mathscr{P}_{\\mathcal F}(\\xi)\\) such that \\(\\mathscr{P}_{\\mathcal F}\\phi \\circ h=\\mathscr{P}_{\\mathcal F}\\psi\\), there exists unique \\(\\theta:\\zeta\\rightarrow\\xi\\) such that \\(\\mathscr{P}_{\\mathcal F}\\theta=h\\) and \\(\\psi=\\phi\\circ\\theta\\), as indicated in the diagram and when \\(\\phi:\\xi\\rightarrow\\eta\\) is cartesian, we say that \\(\\xi\\) is a pullback of \\(\\eta\\) (to \\(U\\) along \\(\\mathscr{P}_{\\mathcal F}\\phi\\)). This diagram is sometimes known as the “universal property” of cartesian morphisms. Note that given two pullbacks \\(\\phi_1:\\xi_1\\rightarrow\\eta\\) and \\(\\phi_2:\\xi_2\\rightarrow\\eta\\) then substitute \\(\\psi=\\xi_i\\) for \\(i=1,2\\) will give us an isomorphism \\(\\xi_1\\cong\\xi_2\\). Thus, pullbacks are unique up to a unique isomorphism. Note that in SGA1 the definition of cartesian arrow is different and this definition is sometimes known as strongly cartesian. Next, we introduce the following properties, which is easy to check, Proposition 2. Let \\(\\mathscr{P}_{\\mathcal F}:\\mathcal F\\rightarrow\\mathcal C\\) be a category over the category \\(\\mathcal C\\). composite of cartesian arrows are cartesian, if \\(\\psi:\\eta\\rightarrow \\zeta\\) and \\(\\phi:\\xi\\rightarrow\\eta\\) are arrows in \\(\\mathcal F\\) with \\(\\psi\\) cartesian, then \\(\\phi\\) is cartesian iff \\(\\psi\\circ\\phi\\) is, if \\(\\phi:\\xi\\rightarrow\\eta\\) is an arrow and \\(\\mathscr{P}_{\\mathcal F}\\phi\\) is an isomorphism, then \\(\\phi\\) is cartesian iff it is an isomorphism, With these knowledge, we can introduce fibred categories. Fibred categories are used to provide a general framework for descent theory. They formalize various situations in geometry and algebra where pullbacks of objects are defined. A motivating example is the category of vector bundles on a topological space. Definition 3. A fibred category over a category \\(\\mathcal C\\) is a category \\(\\mathcal F\\) over \\(\\mathcal C\\) such that for each \\(f:U\\rightarrow V\\) in \\(\\mathcal C\\) where \\(V=\\mathscr{P}_{\\mathcal F}(\\eta)\\) for some \\(\\eta\\in \\mathcal F\\), there exists \\(\\xi\\in\\mathcal F\\) with \\(U=\\mathscr{P}_{\\mathcal F}(\\xi)\\) and cartesian arrow \\(\\phi:\\xi\\rightarrow\\eta\\) such that \\(f=\\mathscr{P}_{\\mathcal F}\\phi\\). Suppose \\(\\mathcal F,\\mathcal G\\) are fibred categories over \\(\\mathcal C\\), then a morphism of fibred categories \\(\\mathscr{F}:\\mathcal F\\rightarrow \\mathcal G\\) is a functor such that \\(\\mathscr{P}_{\\mathcal G}\\circ \\mathscr{F}=\\mathscr{P}_{\\mathcal F}\\) and \\(\\mathscr{F}\\) sends cartesian arrows to cartesian arrows. Suppose \\(\\mathcal F\\) is a category over \\(\\mathcal C\\) and \\(U\\in\\mathcal C\\), write \\(\\mathcal F(U)\\) as the subcategory of \\(\\mathcal F\\) whose objects are \\(\\xi\\in\\mathcal F\\) such that \\(\\mathscr{P}_{\\mathcal F}(\\xi)=U\\) and morphisms are \\(\\phi:\\xi\\rightarrow \\eta\\) where \\(\\mathscr{P}_{\\mathcal F}\\phi=\\mathbf{1}_U\\). If \\(\\mathscr{F},\\mathscr{G}:\\mathcal F\\rightarrow \\mathcal G\\) are morphisms of fibred categories, a base-preserving natural transformation \\(\\alpha:\\mathscr{F}\\rightarrow \\mathscr{G}\\) is a natural transformation such that for all \\(u\\in\\mathcal F\\) we have \\(\\alpha(u):\\mathscr{F}(u)\\rightarrow \\mathscr{G}(u)\\) is such that \\(\\mathscr{P}_\\mathcal{G}(\\mathscr{F}(u))=\\mathscr{P}_\\mathcal{G}(\\mathscr{G}(u))\\) and \\(\\mathscr{P}_{\\mathcal G}\\alpha(u)=\\mathbf 1_{\\mathscr{P}_\\mathcal{G}(\\mathscr{F}(u))}\\), i.e. \\(\\alpha(u)\\) is a morphism in \\(\\mathcal G(\\mathscr{P}_\\mathcal{G}(\\mathscr{F}(u)))\\). Denote by \\(\\mathrm{MOR}_{\\mathcal C}(\\mathcal F,\\mathcal G)\\) the category whose objects are morphisms of fibred categories and morphisms are base-preserving natural transformations. For a morphism of fibred categories \\(\\mathscr{F}:\\mathcal F\\rightarrow\\mathcal G\\) over \\(\\mathcal C\\) and \\(U\\in\\mathcal C\\), we write \\(\\mathscr{F}_U:\\mathcal F(U)\\rightarrow \\mathcal G(U)\\) to denote the functor where \\(\\mathscr{F}_U(\\xi)=\\mathscr{F}(\\xi)\\) and \\(\\mathscr{F}_U\\phi=\\mathscr{F}\\phi\\). Thus in a fibred category we can pullback objects along any arrow. For example, for a category \\(\\mathcal C\\) with \\(X\\in\\mathcal C\\), we have \\(\\mathcal C/X\\) is fibred over \\(\\mathcal C\\) via \\(\\mathscr{P}_{\\mathcal C/X}:\\mathcal C/X\\rightarrow \\mathcal C\\) given by \\((Y\\rightarrow X)\\mapsto Y\\) and morphisms are mapped to themsleves. It should be easy to check that this is well-defined. Why do we need fibred categories? Suppose \\(f:X\\rightarrow Y\\) is a morphism of schemes. For any morphism of schemes \\(t:T\\rightarrow Y\\) we can form a fibred product \\(T\\times_Y X\\) which is only unique up to a unique isomorphism. Thus implicitly there is a choice being made. This becomes a technical obstacle in developing the theory of stacks, and fibred categories are used to address this problem. For more detail, see Example 3.1.5 in Olsson’s book. The collection of categories fibred over a fixed category is an example of a \\(2\\)-category. Roughly speaking, a \\(2\\)-category is a category where the morphisms between two objects form a category. However, we will not use higher categorical language. Lemma 4. Let \\(\\mathscr{F}:\\mathcal F\\rightarrow\\mathcal G\\) be a morphism of fibred categories over \\(\\mathcal C\\), \\(\\mathscr{F}\\) is fully faithful (as a functor) iff \\(\\mathscr{F}_U:\\mathcal F(U)\\rightarrow \\mathcal G(U)\\) is fully faithful for all \\(U\\in\\mathcal C\\), \\(\\mathscr{F}\\) is an equivalence (of categories) iff \\(\\mathscr{F}_U:\\mathcal F(U)\\rightarrow \\mathcal G(U)\\) is an equivalence for all \\(U\\in\\mathcal C\\). Proof Lemma 3.1.8, Olsson. Recall the classical Yoneda lemma: for each object \\(A\\in\\mathcal C\\) we have a natural isomorphism between the collection of natural transformations \\(\\mathrm{Nat}(\\mathscr{F},\\mathscr{H}^A)\\), and the set \\(\\mathscr{F}(A)\\). This point of view is crucial for the development of algebraic spaces, and also for fibred categories we need a variant of this lemma. Theorem 5 (\\(2\\)-Yoneda lemma). Suppose \\(\\mathcal F\\) is fibred over \\(\\mathcal C\\), there is an equivalence\\[\\mathrm{MOR}_{\\mathcal C}(\\mathcal C/X,\\mathcal F)\\cong \\mathcal F(X)\\]given by \\(\\mathscr{F}\\mapsto \\mathscr{F}(\\mathbf 1_{X})\\). Proof Proposition 3.2.2 Olsson. It is often useful to think of a fibred category as the collection of categories \\(\\mathcal{F}(U)\\) with a pullback functor. Thus, we introduce split fibred categories. We will not go over the details of the rigorous definition, but the reader can check 3.3.1 in Olsson’s book.","link":"/archives/9693c172/"},{"title":"Grothendieck Topology, Sites, and Topoi","text":"“Complex analysis is the good twin and real analysis the evil one: beautiful formulas and elegant theorems seem to blossom spontaneously in the complex domain, while toil and pathology rule the reals.” Charles Pugh This week I plan to start writing about what I’ve learned in PMATH 965 on algebraic stacks. In the end of this semaster hopefully I will have written enough about them in this blog so that I can compile them into actual typesetted notes. We start by revisiting étale morphisms and introducing Grothendieck topologies and sites, and we define presheaves and sheaves on sites and show that they work almost the same as the usual presheaves and sheaves we are accostomed to. Then, we will define important sites such as the big and small Zariski sites and étale sites as well as the fppf site. Étale morphisms of schemesFirst, we revisit the definitions and properties of étale morphisms of schemes. Definition 3. A morphism of schemes \\(f:X\\rightarrow Y\\) is étale if one of these equivalent conditions holds \\(f\\) is smooth and locally quasi-finite, \\(f\\) is smooth and unramified, \\(f\\) is flat and unramified, \\(f\\) is locally of finite presentation and formally étale \\(f\\) is locally of finite presentation and locally a standard étale morphism, There are many more equivalent definitions of étale morphisms listed on wikipedia. Intuitively, I think of étale morphisms analogous to covering maps. We need this notion to define the étale topology which we will need to use later. As a side note, there is also something called the étale fundamental group, which also uses the notion of étale morphisms. We recall these properties of étale morphisms. Proposition 4. compotision of étale maps are étale, if \\(f:Y\\rightarrow X\\) is étale then its base change \\(Y\\times_XZ\\rightarrow Z\\) is étale, if \\(f:Y\\rightarrow X\\) and \\(g:Z\\rightarrow X\\) are étale and \\(g=f\\circ h\\) where \\(h:Z\\rightarrow Y\\), then \\(h\\) is étale given algebraically closed field \\(k\\) and \\(k\\)-algebra \\(A\\), then the morphism \\(\\mathrm{Spec}(A)\\rightarrow\\mathrm{Spec}(k)\\) is étale iff it is the disjoint union of spectra of finite separable field extensions of \\(k\\). Now, we are ready to define Grothendieck topology and sites. Grothendieck topology, sites, and topoiRecall that a presheaf (of sets) on a topological space \\(X\\) is a contravariant functor \\(\\mathscr{F}:\\mathrm{Op}(X)\\rightarrow\\mathbf{Set}\\), and a presheaf is a sheaf when \\(\\mathscr{F}(U)\\rightarrow\\prod_{i}\\mathscr{F}(U_i)\\rightrightarrows\\prod_{i,j}\\mathscr{F}(U_i\\cap U_j)\\) is an equalizer for every open cover \\(\\{U_{i}\\}\\) of any open \\(U\\subseteq X\\), which is equivalent to the identity and gluability axioms. We want to extend this from \\(\\mathrm{Op}(X)\\) to any category \\(\\mathcal C\\). To do this, we need to add some additional structure on the category \\(\\mathcal C\\) so that its objects can be viewed as “open sets” and morphisms can be viewed as “inclusions”. Grothendieck’s insight is that we don’t need the full strength of a topology to define sheaves, we only need intersections and a notion of when a collection of an open set forms an open cover of it. Definition 1. A Grothendieck topology on a category \\(\\mathcal C\\) is the data of a set of coverings of \\(U\\), written as \\(\\mathrm{Cov}(U)\\), for each object \\(U\\in \\mathcal C\\), where each covering \\(S\\in\\mathrm{Cov}(U)\\) is a set of morphisms of \\(\\mathcal C\\) with \\(U\\) as targets, such that for all \\(U\\in\\mathcal C\\) for each isomorphism \\(\\varphi:V\\rightarrow U\\), we have \\(\\{\\varphi\\}\\in \\mathrm{Cov}(U)\\) if \\(\\{V_i\\rightarrow U\\}\\in\\mathrm{Cov}(U)\\) and \\(\\{W_{i,j}\\rightarrow V_i\\}\\in\\mathrm{Cov}(V_i)\\) for each \\(i\\), then \\(\\{W_{i,j}\\rightarrow U\\}\\in\\mathrm{Cov}(U)\\) for \\(\\{V_i\\rightarrow U\\}\\in\\mathrm{Cov}(U)\\) and \\(W\\rightarrow U\\), all \\(W\\times_UV_i\\) exists and \\(\\{W\\times_UV_i\\rightarrow W\\}\\in\\mathrm{Cov}(W)\\) A category \\(\\mathcal C\\) equipped with a choice of Grothendieck topology, also denoted \\(\\mathcal C\\), is a site. A continuous functor between sites \\(f:\\mathcal C\\rightarrow\\mathcal D\\) is a functor between their underlying categories such that for all \\(\\{X_i\\rightarrow X\\}\\in \\mathrm{Cov}_{\\mathcal C}(X)\\) we have \\(\\{f(X_i)\\rightarrow f(X)\\}\\in \\mathrm{Cov}_{\\mathcal D}(f(X))\\), and it commutes with finite fibred products if they exist. For example, \\(\\mathrm{Op}(X)\\) for a topological space \\(X\\) can be made into a site using the usual notion of covering. We note that in \\(\\mathrm{Op}(X)\\) we have the fibered product \\(U\\times_X V=U\\cap V\\) for all open \\(U,V\\subseteq X\\), which agrees with the usual notion of intersection. For a category \\(\\mathcal C\\) with \\(X\\in\\mathcal C\\), the category of objects over \\(X\\), denoted \\(\\mathcal C/X\\) is the category where objects are morphisms \\(Y\\rightarrow X\\) in \\(\\mathcal C\\) and morphisms between \\(Y_1\\rightarrow X\\) and \\(Y_2\\rightarrow X\\) are all morphisms \\(Y_1\\rightarrow Y_2\\) in \\(\\mathcal C\\) such that the obvious triangle commutes, i.e. \\((Y_1\\rightarrow Y_2\\rightarrow X)=Y_1\\rightarrow X\\). If \\(\\mathcal C\\) is a site, then \\(\\mathcal C/X\\) can be given a site structure, by letting \\(\\mathrm{Cov}(U\\rightarrow X)\\) in \\(\\mathcal C/X\\) be \\(\\mathrm{Cov}(U)\\) in \\(\\mathcal C\\). The site \\(\\mathcal C/X\\) is called the localization of the site \\(\\mathcal C\\) at \\(X\\). Suppose \\(X\\) is a scheme, then we say that the big Zariski (resp. big étale, resp. fppf) site, denoted \\((\\mathbf{Sch}/X)_{\\mathrm{Zar}}\\) (resp. \\((\\mathbf{Sch}/X)_{\\mathrm{ét}}\\), resp. \\((\\mathbf{Sch}/X)_{\\mathrm{fppf}}\\)) of \\(X\\), is the site with the category \\(\\mathbf{Sch}/X\\) and \\(\\{Y_i\\rightarrow Y\\}\\in\\mathrm{Cov}(U)\\) iff each \\(Y_i\\rightarrow Y\\) is an open immersion with \\(Y=\\bigcup_i Y_i\\) (resp. each \\(Y_i\\rightarrow Y\\) is étale with \\(\\coprod_i Y_i\\rightarrow Y\\) surjective, resp. each \\(Y_i\\rightarrow Y\\) is flat and locally of finite presentation with \\(\\coprod_i Y_i\\rightarrow Y\\) surjective). An element of \\(\\mathrm{Cov}(U\\rightarrow X)\\) is called a Zariski cover (resp. étale cover, resp. fppf cover) of \\(U\\). The small Zariski site (resp. small étale site) of \\(X\\), denoted \\(X_{\\mathrm{Zar}}\\) (resp. \\(X_{\\mathrm{ét}}\\)) is the site whose category is the full subcategory of \\(\\mathrm{Sch}/X\\) where each object \\(U\\rightarrow X\\) is an open immersion (resp. étale), and the coverings are the same as the big Zariski (resp. big étale) site. The small Zariski site of \\(X\\) is equivalent to the site \\(\\mathrm{Op}(X)\\). Moreover, we have the following inclusions\\[\\{\\mathrm{Zariski\\ cover}\\}\\hookrightarrow\\{\\mathrm{étale\\ cover}\\}\\hookrightarrow\\{\\mathrm{fppf\\ cover}\\}\\]Next, we discuss presheaves and sheaves on a site. This whole business is to get new cohomology theories such as étale cohomology, because basic sheaf cohomology is insufficient for our needs. Definition 2. A presheaf (of sets) on a site \\(\\mathcal C\\) is a contravariant functor \\(\\mathscr{F}:\\mathcal C\\rightarrow\\mathbf{Set}\\), and a presheaf is a sheaf iff \\(\\mathscr{F}(U)\\rightarrow\\prod_{i}\\mathscr{F}(U_i)\\rightrightarrows\\prod_{i,j}\\mathscr{F}(U_i\\times_U U_j)\\) is an equalizer for all \\(U\\in\\mathcal C\\) and \\(\\{U_i\\rightarrow U\\}\\in\\mathrm{Cov}(U)\\). A presheaf is called separated if for all \\(U\\in\\mathcal C\\) and \\(\\{U_i\\rightarrow U\\}\\in\\mathrm{Cov}(U)\\), the map \\(\\mathscr{F}(U)\\rightarrow \\prod_i\\mathscr{F}(U_i)\\) is injective. We write \\(\\mathrm{Sh}(\\mathcal C)\\) (resp. \\(\\mathrm{PSh}(\\mathcal C)\\)) for the category of sheaves (resp. presheaves) of the site \\(\\mathcal C\\). Note that a separated presheaf can be viewed as a presheaf that only satisfies one of the axioms of a sheaf, the identity axiom, but not necessaily the gluability axiom, therefore we have the obvious inclusions\\[\\{\\mathrm{sheaves}\\}\\hookrightarrow\\{\\mathrm{separated\\ presheaves}\\}\\hookrightarrow\\{\\mathrm{presheaves}\\}\\]all of which admits left adjoints, the composition of them being sheafification. Usually, we can formulate sheafification in terms of compatible germs, but since we are working over sites, it does not make sense to take a point in an object and take the product of stalks. The way we construct the adjoint from presheaves to separated presheaves is to map a presheaf \\(\\mathscr{F}\\) to \\(\\mathscr{F}^{\\mathrm s}(U)=\\mathscr{F}(U)/\\sim\\) where \\(a\\sim b\\) iff exists \\(\\{U_i\\rightarrow U\\}\\in\\mathrm{Cov}(U)\\) such that \\(a,b\\) are mapped to the same element by the map \\(\\mathscr{F}(U)\\rightarrow \\prod_i\\mathscr{F}(U_i)\\). We can check that this is in fact a separated presheaf. All of the above works for (pre)sheaves of rings, abelian groups, etc. Definition 3. A topos is a category equivalent to \\(\\mathrm{Sh}(\\mathcal C)\\) for a site \\(\\mathcal C\\). A morphism of topoi \\(f:\\mathcal{T}_1\\rightarrow \\mathcal{T}_2\\) is an adjoint pair \\(f^*\\dashv f_*\\) of functors \\(f^*:\\mathcal{T}_1\\rightarrow \\mathcal{T}_2\\) and \\(f_*:\\mathcal{T}_2\\rightarrow \\mathcal{T}_1\\) with a choice of natural isomorphism\\[\\Phi:\\mathrm{Mor}_{\\mathcal T_1}(f^*(-),-)\\rightarrow \\mathrm{Mor}_{\\mathcal T_2}(-,f_*(-))\\]where each naturality here means \\(\\Phi\\) is natural in each of the two dashes, and \\(f^*\\) commutes with finite limits when they exist. Define composition in the obvious way. We remark that in the above definition, commuting with finite limits is equivalent to checking that \\(f^*\\) commutes with finite products and preserve equalizers. In many cases, though not always, a continuous functor between sites \\(f:\\mathcal C\\rightarrow \\mathcal D\\) induces a functor \\(f_*:\\mathrm{Sh}(\\mathcal D)\\rightarrow \\mathrm{Sh}(\\mathcal C)\\) by \\(f_*(\\mathscr{F})(X)=\\mathscr{F}(f(X))\\), where the well-definedness follows from \\(\\mathscr{F}(f(U_i\\times_U U_j))=\\mathscr{F}(f(U_i)\\times_{f(U)} f(U_j))\\) for any \\(\\{U_i\\rightarrow U\\}\\in\\mathrm{Cov}(U)\\), as illustrated by the diagram This induced functor does not always admit a left adjoint. However, we have the following theorem Proposition 4. If \\(\\mathcal C,\\mathcal D\\) are sites with small underlying categories, then the functor \\(f_*:\\mathrm{Sh}(\\mathcal D)\\rightarrow \\mathrm{Sh}(\\mathcal C)\\) induced by a continuous functor \\(f:\\mathcal C\\rightarrow \\mathcal D\\) admits a left adjoint \\(f^*:\\mathrm{Sh}(\\mathcal C)\\rightarrow \\mathrm{Sh}(\\mathcal D)\\). If, further, that finite limits in \\(\\mathcal C\\) are representable and \\(f\\) commutes with them, then \\(f^*\\) commutes with finite limits. Proof We construct this functor concretely. For each \\(U\\in\\mathcal D\\), let \\(\\mathcal I_U\\) be the category where objects are pairs \\(\\langle V,\\rho\\rangle\\) where \\(V\\in\\mathcal C\\) and \\(\\rho\\in \\mathrm{Mor}_\\mathcal{D}(U,f(V))\\), and a morphism \\(g:\\langle V_1,\\rho_1\\rangle \\rightarrow \\langle V_2,\\rho_2\\rangle\\) is a morphism \\(g:V_1\\rightarrow V_2\\) in \\(\\mathcal C\\) such that \\((fg)\\circ\\rho_1=\\rho_2\\). We define\\[f^*(\\mathscr{F})(U)=\\lim_{\\stackrel{\\longrightarrow}{\\langle V,\\rho\\rangle\\in\\mathcal I_{U}^\\mathrm{op}}}\\mathscr{F}(V)\\]and for each \\(h:U_1\\rightarrow U_2\\) in \\(\\mathcal C\\), there is functor \\(\\mathcal I_{U_2}\\rightarrow \\mathcal I_{U_1}\\) given by \\(\\langle V,\\rho\\rangle\\mapsto \\langle V,\\rho\\circ h\\rangle\\) which induces a morphism \\(f^*(\\mathscr{F})(U_2)\\rightarrow f^*(\\mathscr{F})(U_1)\\). We can check that this is well-defined.","link":"/archives/46fca3c5/"},{"title":"Schubert Calculus and Cohomology of Grassmannians","text":"Last week I gave a talk on the Canadian Undergraduate Mathematics Conference 2022 on Schubert calculus and cohomology of Grassmannians. Here are the slides of my talk. This was actually quite a challenging topic for me since I only began to learn about Grassmannians this term, and I didn’t have a ton of time to prepare. In the end, I didn’t feel I understood Chern classes so I only briefly mentioned how it could be used for proving that there are \\(27\\) lines on a smooth cubic surface. Origianlly, I had hoped to also learn about generalized flag varieties, Bruhat decomposition, and Borel–Weil–Bott theorem, but I really ran out of stamina. Perhaps I will find sometime to learn about them in the future.","link":"/archives/a5b2dbed/"},{"title":"Talk on SASMS: Category Theory Demystified","text":"Recently, I gave another talk on the Short Attention Span Math Seminars which is a friendly introduction to category theory. Here are my slides, and here are the slides for the first five minutes. In my talk, I first talked about the idea of abstractions, then I talked about the categorical way of thing and along the way talked about many ideas like universal properties, functors, natural transformations. In the end, this culminated in the Yoneda lemma or the fundamental theorem of category theory. I also discussed a little an application of it to algebraic geometry.","link":"/archives/ee8dd51d/"},{"title":"Nine Point Circle and Feuerbach's Theorem","text":"I’ve been playing with the Manim library lately. Here’s a test animation I made demonstrating the nine point circle and part of Feuerbach’s theorem. It should be noted that Feuerbach’s Theorem also tells us that the nine point circle of a triangle is tangent to the three excircles of that triangle, but I did not include that in the video.","link":"/archives/e3b6140a/"},{"title":"Triangulated Categories","text":"“It is impossible to be a mathematician without being a poet in soul.” Sofia Kovalevskaya Continuing last week where we defined the homotopy category of complexes, we will take a look at triangulated categories. This will help us build towards the definition of derived categories. In some sense, triangulated categories are approximations of abelian categories. They are not strictly speaking a weaker version of abelian categories, and they don’t really imply each other. Triangulated categories takes a different approach to abelian categories. Instead of kernels, cokernels, and strict morphisms, triangulated categories bypass these notions and start out with “distinguished triangles”, which are similar to exact sequences. A translation functor on an additive category \\(\\mathcal C\\) is an automorphism \\(T:\\mathcal C\\rightarrow\\mathcal C\\) where we denote \\(T^n(X)=X[n]\\) and \\(T^nf=f[n]\\) for \\(n\\in\\mathbb Z\\). A triangle is a diagram \\(X\\rightarrow Y\\rightarrow Z\\rightarrow X[1]\\), and a morphism of triangles is a diagramwhich commutes. A triangulated category is an additive category \\(\\mathcal C\\) with a translation functor and a family of triangles called distinguished triangles such that the following axioms are satisfied. For any \\(X\\in\\mathcal C\\), the triangle \\(X\\xrightarrow{\\mathbf 1_X} X\\rightarrow \\mathbf 0\\rightarrow X[1]\\) is distinguished. Any triangle isomorphic to a distinguished triangle is distinguished. Any morphism \\(X\\rightarrow Y\\) can be completed to a distinguished triangle \\(X\\rightarrow Y\\rightarrow Z\\rightarrow X[1]\\). (Rotation axiom) A triangle \\(X\\xrightarrow{u} Y\\rightarrow Z\\rightarrow X[1]\\) is distinguished iff \\(Y\\rightarrow Z\\rightarrow X[1]\\xrightarrow{-u[1]}Y[1]\\) is. Suppose the rows in the diagram are distinguished, and the left square commutes, then there exists a morphism \\(w:Z\\rightarrow Z^\\prime\\) (not necessarily unique) completing the diagram into a morphism of triangles. (Octahedral axiom) Suppose the first three rows are distinguished and the left two squares commute, then there exists morphisms \\(u,v,w\\) completing the diagram into two morphisms of triangles and the whole diagram commutes and the last row is also distinguished If all but the last axiom is satisfied, then it is known as a pre-triangulated category. It is conjectured that pre-triangulated categories are triangulated, i.e. the last axiom is redundant. The general concensus seems to be that this is not true. An additive functor between triangulated categories \\(F:\\mathcal C\\rightarrow\\mathcal D\\) is said to commute with translation if there is a natural isomorphism \\(FT_{\\mathcal C}\\cong T_{\\mathcal D} F\\), and \\(F\\) is said to be exact or triangulated if it commutes with translation and takes distinguished triangles to distinguished triangles. Let \\(F,G:\\mathcal C\\rightarrow\\mathcal D\\) be exact functors, and \\(\\eta_{F}:FT_{\\mathcal C}\\rightarrow T_{\\mathcal D}F\\) and \\(\\eta_{G}:GT_{\\mathcal C}\\rightarrow T_{\\mathcal D}G\\) be natural isomorphisms, then a natural transformation \\(w:F\\rightarrow G\\) is graded if for \\(X\\in\\mathcal C\\) commutes. Theorem 1. In a (pre)triangulated category \\(\\mathcal C\\), if \\(X\\xrightarrow{u} Y\\xrightarrow{v} Z\\xrightarrow{w} X[1]\\) is distinguished, then \\(vu=0\\) and \\(wv=0\\) any change of sign of exactly two of \\(u,v,w\\) is distinguished, if \\(U\\in\\mathcal C\\), then there exists long exact sequences of abelian groups \\[\\begin{aligned}&amp;\\cdots\\rightarrow\\mathrm{Hom}(U,X[i])\\xrightarrow{u[i]_*}\\mathrm{Hom}(U,Y[i])\\xrightarrow{v[i]_*} \\mathrm{Hom}(U,Z[i])\\xrightarrow{w[i]_*}\\mathrm{Hom}(U,X[i+1])\\rightarrow\\cdots\\\\ &amp;\\cdots\\leftarrow\\mathrm{Hom}(X[i],U)\\xleftarrow{u[i]^*}\\mathrm{Hom}(Y[i],U)\\xleftarrow{v[i]^*} \\mathrm{Hom}(Z[i],U)\\xleftarrow{w[i]^*}\\mathrm{Hom}(X[i+1],U)\\leftarrow\\cdots\\end{aligned}\\] where \\(f^*,f_*\\) for some \\(f\\) represents maps induced by Hom-functors. (triangulated 5-lemma) Consider a morphism of distinguished triangles, and let its components be \\(f:X\\rightarrow X^\\prime,g:Y\\rightarrow Y^\\prime,h:Z\\rightarrow Z^\\prime\\), then if any two of them are isomorphisms, so is the third. \\(u\\) is an isomorphism iff \\(Z\\cong\\mathbf{0}\\) Proof It suffice to show \\(vu=0\\), and \\(wv=0\\) can be obtained from the rotation axiom. To show this, we first note that \\(Z\\rightarrow Z\\rightarrow \\mathbf 0\\rightarrow Z[1]\\) is distinguished. The triangle \\(Y\\rightarrow Z\\rightarrow X[1]\\rightarrow Y[1]\\) is distinguished by axiom 4, and we construct a morphism between them via axiom 5, and then we can obtain \\(vu=0\\) from the commutativity of a square in the diagram. Straightforwardly, the triangle obtained by changing exactly two signs is isomorphic to the original triangle by an obvious morphism of triangles, so it is still distinguished. We will only prove the first one, and the second one is proved dually. Since \\(vu=0\\), we have \\((v[i])(u[i])=0\\), so \\(\\mathrm{Im}(u[i]_*)\\subseteq \\mathrm{Ker}(v[i]_*)\\). Conversely, suppose \\(f\\in \\mathrm{Ker}(v[i]_*)\\), so \\(f(v[i])=0\\). Consider the diagram as follows\\[\\require{AMScd}\\begin{CD}U[-i] @&gt;{}&gt;&gt; \\mathbf{0} @&gt;{}&gt;&gt; U[-i+1] @&gt;{-\\mathbf{1}}&gt;&gt; U[-i+1]\\\\@VV{f[-i]}V @VVV @. @VV{f[-i+1]}V \\\\Y @&gt;{v}&gt;&gt; Z @&gt;{w}&gt;&gt; X[1] @&gt;{-u[1]}&gt;&gt; Y[1]\\end{CD}\\] which we can complete to a morphism of triangles with some \\(h:U[-i+1]\\rightarrow X[1]\\). By the commutativity of the rightmost square, \\(-f[-i+1]=-(u[i])h\\) so \\(f=(u[i])(h[-i+1])\\), so \\(f\\in \\mathrm{Im}(u[i]_*)\\). By the rotation axiom, since we proved a short exact sequence, we have the exactness of the long exact sequence. By the rotation axiom, it suffice to show the case where the first two are isomorphisms. By using (3), we have a long exact sequence, and we can obtain the isomorphism using the usual 5-lemma, details ommited. A striaghtforward corollary. Let \\(\\mathcal C\\) be a triangulated category and \\(\\mathcal A\\) an abelian category, then an additive functor \\(H:\\mathcal C\\rightarrow\\mathcal A\\) is called cohomological if for every distinguished triangle \\(X\\rightarrow Y\\rightarrow Z\\rightarrow X[1]\\), the sequence \\(H(X)\\rightarrow H(Y)\\rightarrow H(Z)\\) is exact. It is then a straightforward consequence by the rotation axiom that for every distinguished triangle \\(X\\rightarrow Y\\rightarrow Z\\rightarrow X[1]\\), we have the following long exact sequence\\[\\cdots\\rightarrow H(X[i])\\xrightarrow{H(u[i])} H(Y[i])\\xrightarrow{H(v[i])}H(Z[i])\\xrightarrow{H(w[i])}H(X[i+1])\\rightarrow\\cdots\\] What we just proved in part 3 of the previous theorem is that the Hom-functor is cohomological. Definition 2. An object in an abelian category is simple if the only subobjects are zero and the object itself, and semisimple if it is a coproduct of simple objects. An abelian category is semisimple if every short exact sequence splits. Caution: some authors call a category semisimple if all objects are semisimple, which is a stronger definition and is NOT equivalent to our definition. Every semisimple abelian category has a triangulated structure. To do this, we let the translation functor be the identity functor, and we declare a triangle \\(X\\xrightarrow{u} Y\\xrightarrow{v} Z\\xrightarrow{w} X\\) distinguished if it is “exact” at \\(X\\), i.e. \\(\\mathrm{Ker}(u)=\\mathrm{Im}(w)\\). Verifying this is a triangulated category is a tedious, and we will not do it here. Moreover, all abelian triangulated categories are semisimple. We will not prove this either. In fact, the homotopy category of complexes \\(K(\\mathcal A)\\) is triangulated. To see this, we set the distinguished triangles to be the ones isomorphic to a standard triangle of the form \\[X^\\bullet\\xrightarrow{f^\\bullet} Y^\\bullet \\xrightarrow{i_f^\\bullet} \\mathrm{Cone}(f^\\bullet)\\xrightarrow{p_f^\\bullet} X^\\bullet[1]\\] and as expected, the cohomology functor \\(H^n:K(\\mathcal A)\\rightarrow\\mathcal A\\) is cohomological.","link":"/archives/3e09458/"},{"title":"Things I Learned From CUMC 2022","text":"“Why did the two algebraic geometers get arrested at the airport? Because they were talking about blowing up six points on the plane.” Anonymous I spent my last week in Quebec attending the Canadian Undergraduate Mathematics Conference 2022. It was really an intense week of learning. I learned a lot and met many smart and interesting people. So I wanted to write about the things I learned and the people I met during the conference. There were so many excellent talks but unfortunately I could only attend some of them. In particular, there are some very good ones in geometry, topology, representation theory, algebra, logic theory, etc. When Polynomials don’t Commute: An Introduction to Ore Extensions by Nick Priebe. Non-commutative algebra is a central topic in modern algebra research, which concerns objects such as non-commutative rings. Suppose \\(R\\) is a ring, \\(\\sigma:R\\rightarrow R\\) a homomorphism, \\(\\delta:R\\rightarrow R\\) a \\(\\sigma\\)-derivation i.e. a homomorphism s.t. \\(\\delta(rs)=\\sigma(r)\\delta(s)+\\delta(r)s\\), then an Ore extension or a skew polynomial ring is the noncommutative ring \\(R[x;\\sigma,\\delta]\\) where the multiplication satisfies \\(xr=\\sigma(r)x+\\delta(r)\\). Nick provided some examples of noncommutative rings that are useful in physics. He also introduced some basic results and open problems about their representations. I am actually quite curious about the relationship between noncommutative algebra and noncommutative geometry. A Brief Introduction to Homotopy Type Theory by Jacob Ender. Homotopy type theory is a new foundation of mathematics which is developed from intuitionist type theory. In HoTT, the fundamental objects are types, and we can build dependent types with \\(\\sum_{(x:A)}B(x)\\) (analogue of \\(\\exists x\\in A,B(x)\\)) and \\(\\prod_{(x:A)}B(x)\\) (analogue of \\(\\forall x\\in A,B(x)\\)). To avoid Russell’s paradox, we can build a tower of universes. Jacob also introduced Voevodsky’s Univalence axiom \\((A= B)\\simeq (A\\simeq B)\\) so isomorphic objects are equal. HoTT is very analogous to homotopy theory in the sense of its \\(\\infty\\)-groupoid structure. Currently there is a lot of research in their higher-categorical models and their application in computer proof assistants. Waring Squaring by Maya Gusak. A classical result in number theory is that each natural number is the sum of at most four squares. Waring’s problem asks for which \\(k\\in\\mathbb N\\) exists \\(s\\in\\mathbb Z^+\\) s.t. each \\(n\\in\\mathbb N\\) can be written as a sum \\(n=n_1^k+n_2^k+\\cdots+n_s^k\\), where \\(n_1,\\dots,n_s\\in\\mathbb N\\). To tackle this problem, mathematicians used so called circle method. Additionally, this method can be used to prove Vinogradov’s theorem (every odd natural number \\(n&gt;5\\) is the sum of three primes), but fails to solve Goldbach conjecture. ADE Classification for Quivers of Finite Representation Type by Xinrui You. A quiver is a multidigraph (i.e. a directed graph with multiple edges and loops allowed) which simulates underlying structure of a category. A representation of a quiver sends each vertex to a vector space or a module and each edge to a morphism. These representations decompose just as representations of finite groups. One fundamental result in the classification of quivers is Gabriel’s theorem. Gabriel’s theorem says that a quiver of finite representation type is a union of Dynkin graphs of type A, D, or E. The Nash Embedding Theorem for Tori in \\(3\\)-space by Diba Heydary. A fundamental result in Riemannian geometry is that every Riemannian manifold can be isometrically (preserving the length of every path) embedded into a Euclidean space. Diba talked about a specific example of an embedding of a torus in the Euclidean \\(3\\)-space. A torus has a polygonal representation which can be used to create this embedding. Whitney embedding theorem is a similar result for differentiable manifolds. Dissection of Polyhedra and the Dehn invariant by James Bona-Landry. The Wallace–Bolyai–Gerwien theorem says that that two polygons can be dissected and transformed to each other iff they have the same area. The natural generalization of this question into \\(3\\) dimensions does not hold. This is due to the Dehn invariant \\(\\sum_i\\ell_i\\otimes \\theta_i\\in \\mathbb R\\otimes (\\mathbb R/2\\pi \\mathbb Z)\\). We can show that there are polyhedra that share same volume but has different Dehn invariant, which means they can not transform to each other via dissection. In fact the Dehn-Sydler theorem says that they can transform to each other via dissection iff they have the same volume and same Dehn invariant. The generalization for higher dimensions is still open. An Introduction to Linear Logic by Amélie Comtois. Linear logic is different from classical logic in that if \\(A\\rightarrow B\\) is used then \\(A\\) is no longer available anymore. She also talked about sequent calculus, which is a formal calculus of logic. Linear logic uses drastically different logical symbols than classical logic as well. Linear logic is an extension of classical logic, and classical logic can be realized in linear logic. Linear logic is thought of as the language of quantum theory. Moreover, I discussed with Amélie about category theory, and I learned from her about multicategories and higher categories. Exploring Quivers, Representations, and Varieties via Multisegments by Iretomiwa Ajala. This is another talk about quivers, and much more technical than that of Xinrui. Iretomiwa introduced multisegments, and discussed how they related to quivers of type A. He also mentions parabolic induction, which is a method of obtaining a representation of a reductive group from the representations of its parabolic subgroups. An Introduction to Coxeter Groups and the Properties of their Weak Order by Kimia Shaban. A very interesting talk on the combinatorial side of Coxeter groups. Coxeter groups are a type of groups generated by reflections. She discussed their classification, and the Sperner property of the weak order on Coxeter groups. In the end, she also talked about a conjecture she and her supervisor wish to disprove about the Sperner property of the weak order. Univariate Tropical Polynomials by Charlotte Lavoie-Bel. Tropical polynomical replace addition with the minimum function and multiplication by the usual addition, which makes it a semifield. Tropical polynomials can be graphed and they will have a cell-looking structure. They can be thought of as the limit of logarithm under base \\(0\\). They also have a different notion of roots than regular polynomials. We can consider zero locus of tropical polynomials i.e. tropical varieties. The tropical version of some classical algebraic geometry theorems such as Riemann—Roch theorem, can be proven by combinatorial arguments. I like her quote that “tropical geometry is the combinatorial shadow of classical algebraic geometry”. There are many other excellent talks that I unfortunately did not attend, and I only wrote about some of the talks I went to. I also gave my own talk on Schubert calculus and cohomology of Grassmannians as the last student speaker of the conference, which you can view in a previous post.","link":"/archives/abde43b6/"},{"title":"Semisimple Lie Algebras, Weyl Groups, and Root Systems","text":"“Mathematics requires a small dose, not of genius, but of an imaginative freedom which, in a larger dose, would be insanity. And if mathematicians tend to burn out early in their careers, it is probably because life has forced them to acquire too much common sense, thereby rendering them too sane to work. But by then they are sane enough to teach, so a use can still be found for them.” Angus K. Rodgers For this week, I’ll write about the theory of root systems, especially things related to Weyl groups, weight spaces and etc, for the purpose of my URA. This is because one of the objectives of my URA is to generalise my previous blog post about a fraction of an \\(S_n\\)-orbit on a hyperplane to Weyl groups. First, a Lie algebra is simple if it is of degree greater than \\(1\\) (so we are excluding the one dimensional abelian Lie algebras) and has no proper ideals, and a semisimple Lie algebra is a direct sum of simple Lie algebras. Equivalently, a Lie algebra \\(\\mathfrak{g}\\) is semisimple if \\(\\mathrm{rad}(\\mathfrak{g})\\), the sum of all solvable ideals (or the maximal solvable ideal), is trivial. Any semisimple Lie algebra \\(\\mathfrak{g}\\) is the Lie algebra of an algebraic group \\(G\\). Let \\(\\mathrm{ad}:\\mathfrak{g}\\rightarrow \\mathfrak{gl}(\\mathfrak{g})\\) by \\((\\mathrm{ad} X)(Z)=[X,Z]\\) be the adjoint representation. Let \\(B:\\mathfrak{g}\\times \\mathfrak{g}\\rightarrow \\mathbf C\\) be the symmetric bilinear form defined by \\(B(X,Y)=\\mathrm{tr}(\\mathrm{ad}X\\mathrm{ad} Y)\\), called the Killing form which is invariant in the sense of \\(B([X,Y],Z)=B(X,[Y,Z])\\). Cartan’s criterion for semisimplicity says that a Lie algebra is semisimple iff the associated Killing form is nondegenerate. From now on, we let \\(\\mathfrak{g}\\) be a semisimple Lie algebra over \\(\\mathbf C\\). We start by discussing the root–space decomposition \\(\\mathfrak{g}=\\mathfrak{h}\\oplus \\bigoplus_{\\alpha\\in\\Phi}\\mathfrak{g}_{\\alpha}\\) of semisimple Lie algebras. Root–space decompositionBefore we begin, we review some terminology. We say that \\(\\mathfrak{g}\\) is abelian if the Lie bracket is identically zero, and a subspace \\(\\mathfrak{i}\\) is an ideal if \\([X,Y]\\in\\mathfrak{i}\\) for all \\(X\\in \\mathfrak{g}\\) and \\(Y\\in\\mathfrak{i}\\). Examples include \\(Z(\\mathfrak{g})=\\{Z\\in\\mathfrak{g}:[X,Z]=0,\\forall X\\in\\mathfrak{g}\\}\\) called the center, \\(N_{\\mathfrak{g}}(k)=\\{X\\in\\mathfrak{g}:[X,K]\\in k,\\,\\forall K\\in k\\}\\) called the normaliser where \\(k\\) is a subspace of \\(\\mathfrak g\\), and \\(C_{\\mathfrak g}(k)=\\{X\\in\\mathfrak{g}:[X,K]=0,\\,\\forall K\\in k\\}\\) called the centraliser where \\(k\\) is a subset of \\(\\mathfrak g\\). For ideals \\(\\mathfrak{i},\\mathfrak{j}\\) of \\(\\mathfrak{g}\\), define \\([\\mathfrak{i},\\mathfrak{j}]\\) to be the ideal spanned by \\([X,Y]\\) where \\(X\\in \\mathfrak{i},Y\\in \\mathfrak{j}\\). We say \\(\\mathfrak{g}\\) is nilpotent if the chain \\(\\mathfrak{g}\\ge [\\mathfrak{g},\\mathfrak{g}]\\ge [\\mathfrak{g},[\\mathfrak{g},\\mathfrak{g}]]\\ge \\cdots\\) called the lower central series terminates in zero. We say \\(\\mathfrak{g}\\) is solvable if the chain \\(\\mathfrak{g}\\ge [\\mathfrak{g},\\mathfrak{g}]\\ge [[\\mathfrak{g},\\mathfrak{g}],[\\mathfrak{g},\\mathfrak{g}]]\\ge \\cdots\\) called the derived series terminates in zero. We say \\(X\\in\\mathfrak{g}\\) is ad-nilpotent if \\(\\mathrm{ad}X\\) is a nilpotent endomorphism, and semisimple if \\(\\mathrm{ad}X\\) is diagonalisable. Definition 1. A subalgebra \\(\\mathfrak{h}\\) of \\(\\mathfrak{g}\\) is Cartan if \\(\\mathfrak h\\) satisfies one of the equivalent conditions nilpotent and self-normalising (\\(N_\\mathfrak{g}(\\mathfrak h)=\\mathfrak h\\)) (if \\(\\mathfrak g\\) is f.d. over field of char. 0) a maximal subalgebra consisting of semisimple elements, A Cartan subalgebra \\(\\mathfrak{h}\\) is abelian, and combine this with the fact that all elements are semisimple, we have \\(\\mathrm{ad}[\\mathfrak h]\\) are simultaneously diagonalisable and there is a direct sum decomposition \\(\\mathfrak{g}=\\bigoplus_{\\alpha\\in \\mathfrak h^*}\\mathfrak g_{\\alpha}\\) where \\(\\mathfrak{h}^*\\) is the dual space and \\(\\mathfrak{g}_{\\alpha}=\\{X\\in\\mathfrak g: (\\mathrm{ad}H)(X)=\\alpha (H)X,\\forall H\\in\\mathfrak h\\}\\). We have \\(\\mathfrak g_0=\\mathfrak h=C_{\\mathfrak g}(\\mathfrak h)\\). Let \\(\\Phi=\\{\\alpha\\in \\mathfrak{h}^*: \\alpha\\ne 0, \\mathfrak g_{\\alpha}\\ne 0\\}\\),\\[\\mathfrak g=\\mathfrak h\\oplus\\bigoplus_{\\alpha\\in\\Phi}\\mathfrak g_{\\alpha}\\]The elements of \\(\\Phi\\) are called roots, which there are only finitely many. The spaces \\(\\mathfrak g_{\\alpha}\\) with \\(\\alpha\\) a root is called the root spaces. It turns out that root spaces all have dimension \\(1\\). Example 2. Let \\(E_{i,j}\\) be the matrix with \\(1\\) at \\((i,j)\\) and \\(0\\) elsewhere. Suppose \\(\\mathfrak g=\\mathfrak{sl}_n(\\mathbf C)=\\{M\\in\\mathrm{Mat}_n(\\mathbf C): \\mathrm{tr}(M)=0\\}\\). We have the Cartan subalgebra \\(\\mathfrak h\\) consists of all diagonal matrices. Let \\(e_i\\in\\mathfrak h^*\\) output the \\(i\\)-th diagonal, then \\(\\mathrm{ad}(H)E_{i,j}=(e_i(H)-e_j(H))(E_{i,j})\\). Thus the roots are \\(\\alpha_{i,j}=e_{i}-e_{j}\\) for \\(i\\ne j\\) and the corresponding root spaces are \\(\\mathbf CE_{i,j}\\). Suppose \\(\\mathfrak g=\\mathfrak{so}_{2n+1}(\\mathbf C)=\\{M\\in\\mathrm{Mat}_{2n+1}(\\mathbf C): M^{\\mathrm T}=-M\\}\\). The Cartan subalgebra \\(\\mathfrak h\\) consists of the block diagonal matrices with a \\(1\\)-by-\\(1\\) zero block and \\(n\\) \\(2\\)-by \\(2\\) blocks of the form\\[\\begin{pmatrix}0 &amp; ih_j\\\\ -ih_j &amp; 0\\end{pmatrix}\\]Let \\(e_j\\in\\mathfrak h^*\\) output \\(h_j\\). The roots are \\(\\pm e_i\\pm e_j\\) for \\(i\\ne j\\) and \\(e_k\\) for \\(k\\). The root spaces are in Knapp II.1. Suppose \\(\\mathfrak{g}=\\mathfrak{sp}_{2n}(\\mathbf C)=\\{M\\in\\mathrm{Mat}_{2n}(\\mathbf C): M^\\mathrm{T}J=-JM\\}\\) where\\[J=\\begin{bmatrix}\\mathbf{0} &amp; I\\\\ -I&amp; \\mathbf{0}\\end{bmatrix}\\]The Cartan subalgebra \\(\\mathfrak h\\) consists of the diagonal matrices of the form\\[\\begin{bmatrix}H &amp; \\mathbf{0} \\\\ \\mathbf{0} &amp; -H\\end{bmatrix}\\]where \\(H\\in\\mathrm{Mat}_n(\\mathbf C)\\) is diagonal. Let \\(e_j\\in\\mathfrak{h}^*\\) output the the \\(j\\)-th diagonal of \\(H\\) in the above matrix. The roots are \\(\\pm e_i\\pm e_j\\) for \\(i\\ne j\\) and \\(\\pm 2e_k\\) for \\(k\\). The root spaces are in Knapp II.1. Suppose \\(\\mathfrak g=\\mathfrak{so}_{2n}(\\mathbf C)=\\{M\\in\\mathrm{Mat}_{2n}(\\mathbf C): M^{\\mathrm T}=-M\\}\\). The Cartan subalgebra is similar to that of \\(\\mathfrak g=\\mathfrak{so}_{2n}(\\mathbf C)\\) except the last zero block. The roots are \\(\\pm e_i\\pm e_j\\) with \\(i\\ne j\\). Note that we have \\([\\mathfrak g_{\\alpha},\\mathfrak{g}_{\\beta}]\\subseteq \\mathfrak{g}_{\\alpha+\\beta}\\), and if \\(\\alpha,\\beta\\in\\Phi\\) and \\(\\alpha\\ne -\\beta\\) then \\(B(\\mathfrak g_{\\alpha},\\mathfrak g_{\\beta})=0\\). Also, we note that \\(\\Phi\\) spans \\(\\mathfrak h^*\\). In the next section, we define abstract root systems and formalize how we could obtain the Weyl group from \\(\\Phi\\). There is a different way we could define Weyl groups using maximal torus. Root systemsA root system is a configuration of vectors in the euclidean space that satisfies some geometric properties, which helps us with some classification problems in representation theory of Lie algebras. Definition 3. A root system is a Euclidean space \\(E\\) and a finite set of nonzero vectors \\(\\Phi\\subseteq E\\) such that \\(\\mathrm{Span}(\\Phi)=E\\), for \\(\\alpha\\in\\Phi\\), the only scalar multiples of \\(\\alpha\\) in \\(\\Phi\\) are \\(\\pm \\alpha\\), for any \\(\\alpha,\\beta\\in\\Phi\\), we have \\(\\langle\\beta,\\alpha \\rangle=2\\frac{(\\alpha,\\beta)}{(\\alpha,\\alpha)}\\in\\mathbf Z\\) is an integer, for \\(\\alpha\\in\\Phi\\), we have the reflection of any \\(\\beta\\in\\Phi\\) about the hyperplane perpendicular to \\(\\alpha\\), i.e. \\[\\sigma_{\\alpha}(\\beta)=\\beta-\\langle \\beta,\\alpha\\rangle \\alpha=\\beta-2\\frac{(\\alpha,\\beta)}{(\\alpha,\\alpha)}\\alpha\\]is still in \\(\\Phi\\). where \\((\\cdot,\\cdot)\\) is the standard inner product. The elements of \\(\\Phi\\) are roots. The rank of \\(\\Phi\\) is the dimension of \\(E\\). A morphism of root systems is a linear morphism between the Euclidean spaces which preserves \\(\\langle \\cdot,\\cdot\\rangle\\). A root system \\(\\Phi\\) is reducible if \\(\\Phi=\\Phi_1\\cup\\Phi_2\\) s.t. \\((\\alpha,\\beta)=0\\) for all \\(\\alpha\\in\\Phi_1\\) and \\(\\beta\\in\\Phi_2\\). We can draw diagrams of root systems, for example, the following is an example of a root system called \\(G_2\\). This is in fact an irreducible root system. It does not decompose into disjoint unions that are orthogonal to each other. I credit this picture to this page of the wikipedia media repository. Here’s another picture of the root system \\(C_3\\) (arising from the sympletic Lie algebra \\(\\mathfrak{sp}_{6}\\)) drawn by my friend Maya, and a physical model we made together using coffee stirrers (it may not be the most accurate model but it’s hard work). The Weyl group of a root system \\(\\Phi\\) is the group of all reflections \\(W(\\Phi)=\\{\\sigma_{\\alpha}:\\alpha\\in\\Phi\\}\\le \\mathrm{GL}(E)\\). This is a Coxeter group, i.e. a group with a presentation of the form \\(\\langle r_1,\\dots,r_n\\mid (r_ir_j)^{m_{i,j}}\\rangle\\) where \\(m_{i,i}=1\\) and \\(m_{i,j}&gt;1\\) for \\(i\\ne j\\) where \\(m_{i,j}=\\infty\\) when there are no relation. The Weyl group acts faithfully on the roots. For a Lie algebra \\(\\mathfrak g\\) with root space decomposition \\(\\mathfrak h\\oplus \\bigoplus_{\\alpha\\in\\Phi}\\mathfrak g_{\\alpha}\\), the set \\(\\Phi\\) is a root system. The Weyl chambers of a root system is the set of connected components of the complement of the union of all hyperplanes perpendicular to a root. Definition 4. A base for the root system is a subset \\(\\Delta\\subseteq\\Phi\\), whose elements are called simple roots, such that \\(\\Delta\\) is a basis for \\(E\\), and each root is a linear combination of \\(\\Delta\\) with integer coefficients such that the coefficients are either all nonnegative or all nonpositive, which are called the positive and negative roots with respect to \\(\\Delta\\). The height of a root with respect to \\(\\Delta\\) is the sum of all its coefficients in the basis \\(\\Delta\\). Equivalently, we can take a hyperplane not containing any root and define the positive roots as a fixed side, where the simple roots are the positive roots that cannot be written as the sum of two positive roots. The simple roots generate the Weyl group. The fundamental Weyl chamber associated to a base \\(\\Delta\\) is the set of points \\(\\{v\\in E:(\\alpha,v)&gt;0,\\forall \\alpha\\in \\Delta\\}\\). For each root \\(\\alpha\\), define the coroot \\(\\alpha^{\\lor}=\\frac{2}{\\langle \\alpha,\\alpha\\rangle}\\alpha\\), the set of coroots forms the dual of the root system \\(\\Phi^\\lor\\). Classification of root systemsFor \\(\\alpha,\\beta\\in\\Phi\\), since \\(\\cos(\\theta_{\\alpha,\\beta})=\\frac{(\\alpha,\\beta)^2}{(\\alpha,\\alpha)(\\beta,\\beta)}\\), we have \\(\\langle \\alpha,\\beta\\rangle\\langle \\beta,\\alpha\\rangle=4\\cos^2(\\theta_{\\alpha,\\beta})\\le 4\\) which is an integer by assumption. Thus, we can list all the possibilities for the angles and for \\(\\langle \\alpha,\\beta\\rangle\\) If \\(\\Delta\\) is a base for \\(\\Phi\\), then the Cartan matrix associated to \\(\\Delta\\) is \\(C=(\\langle\\alpha_i,\\alpha_j \\rangle)\\in\\mathrm{Mat}_{\\ell}(\\mathbf Z)\\) where \\(\\Delta=\\{\\alpha_1,\\dots,\\alpha_{\\ell}\\}\\) where \\(\\ell=|\\Delta|\\). Changing the order of roots just permutes the Cartan matrix’s rows and columns. Definition 5. The Dynkin diagram of a root system \\(\\Phi\\) with respect to a base \\(\\Delta\\) is a graph with undirected or directed edges with possibly multiple edges, such that the vertices are \\(\\Delta\\) and the number of edges between \\(\\alpha,\\beta\\in\\Delta\\) is \\(\\max(|\\langle\\alpha,\\beta \\rangle|,|\\langle \\beta,\\alpha\\rangle |)\\), directed towards the longer root if the number of edges is more than one. Obviously the root system is irreducible iff the Dynkin diagram is connected. Two root systems are isomorphic iff they have the same Dynkin diagram. A classification of all Dynkin diagrams can be found here. The bases for the root systems according to these classification can be found here. The simply laced (no multiple edges) Dynkin diagrams shows up in classification problems in many different areas in mathematics: labelled graphs, quivers, 2d conformal field theories, etc. See ADE classification. The Dynkin diagram also tells us information about the presentation of the Weyl group. For two distinct simple roots \\(s,r\\in\\Delta\\), the order \\(m\\) of \\(sr\\) in the presentation of the Weyl group is determined by the number of edges between their corresponding vertices in the Dynkin diagram. If there are no edges then \\(m=2\\), if there is one edge then \\(m=3\\), if there are two edges then \\(m=4\\), and if there are three edges then \\(m=6\\). Bruhat order on Coxeter groupsAn important step in Pawlowski’s paper was bounding \\(\\mathcal O(v,w)\\) using the antichains in the Bruhat order. The Bruhat order can in fact be defined over any Coxeter group. Definition 6. If \\(W\\) is a Coxeter group with standard generators \\(S\\), the Bruhat order on \\(W\\) is defined by \\(u\\le v\\) iff some substring of a \\(S\\)-reduced word for \\(v\\) is a \\(S\\)-reduced word for \\(u\\). As an example, we calculate the Weyl group of the root system arising from \\(\\mathfrak{sp}_{2n}\\) and its Bruhat order. From Example 2.3 earlier, we have \\(\\Phi=\\{\\pm e_i\\pm e_j:i\\ne j\\}\\cup\\{\\pm 2e_k:k\\}\\). To compute the presentation, we first choose a set of simple roots \\(\\Delta=\\{2e_1,e_2-e_1,e_3-e_2,\\dots,e_{n}-e_{n-1}\\}\\), and by computing the Cartan matrix, we derive the following Dynkin diagram which then determines the Weyl group \\(W(\\Phi)\\). Next, we find the reduced words in the group. For a word in this group, if two neighboring letters differ by an index greater than \\(1\\) then we cannot reduce the two letters further, and if they do not differ then they reduce to \\(1\\). Thus the reduced words are the concatonation of proper substrings of \\((s_1s_2)^4\\) and \\((s_ks_{k+1})^3\\) for \\(k\\ge 2\\) such that each neighboring pair of such block do not form the string \\((s_1s_2)^4\\) or \\((s_ks_{k+1})^3\\) for \\(k\\ge 2\\) and such that the two neighboring ends are not the same letter. For example, the word \\(s_3s_4s_3s_4s_5s_4s_5s_7s_6\\) is reduced. Observe that the reduced words are unique.","link":"/archives/59e692ad/"},{"title":"Abelian Categories and Derived Functors","text":"“A mathematician is a person who can find analogies between theorems; a better mathematician is one who can see analogies between proofs and the best mathematician can notice analogies between theories. One can imagine that the ultimate mathematician is one who can see analogies between analogies.” Stefan Banach I have always been curious about derived categories. In particular, I read from the wikipedia page on homological mirror symmetry that the derived category of coherent sheaves is a popular research topic in algebraic geometry. Also, I’ve been told by a professor that derived categories are related to something called geometric Satake correspondance, which is also something I totally don’t understand but it sounds very cool. Therefore, I decided to study a little about derived categories, and write about my progress here. I want this post to be the first part in several parts of my notes. In this first part, we will focus on abelian categoires, derived functors, and homotopy category of complexes. We begin by reviewing abelian categories and their properties. In particular, the (co)chain complexes in an abelian category and their related notions. After that, we define derived functors. Eventually, we finish by defining the homotopy category of complexes \\(K(\\mathcal A)\\). Definition 1. An additive category \\(\\mathcal C\\) is a category where for each \\(A,B\\in\\mathcal C\\), the morphisms \\(\\mathrm{Mor}(A,B)\\) carry an additional additive abelian group structure, and satisfies \\(\\mathcal C\\) admits zero object, \\(\\mathcal C\\) admits finite products and finite coproducts which coincide, and addition is distributive, i.e. \\(g\\circ (f_1+f_2)=g\\circ f_1+g\\circ f_2\\) and \\((f_1+f_2)\\circ g=f_1\\circ g+ f_2\\circ g\\) We use the notation \\(\\mathrm{Hom}(A,B)\\) for \\(\\mathrm{Mor}(A,B)\\) in additive categories to emphasize that the morphisms have an abelian group structure. An additive functor \\(\\mathcal F:\\mathcal C\\rightarrow\\mathcal D\\) between additive categories is a functor such that the associated map \\(\\mathrm{Hom}(A,B)\\rightarrow \\mathrm{Hom}(\\mathcal F(A),\\mathcal F(B))\\) is a group homomorphism for each \\(A,B\\in\\mathcal C\\). Moreover, we denote by \\(0_{A,B}\\) (or \\(0\\) if there is no confusion) the identity element of \\(\\mathrm{Hom}(A,B)\\). Note \\(0_{A,B}\\) is the zero morphism since it’s the unique morphism \\(A\\rightarrow B\\) which factors through \\(\\mathbf 0\\), i.e. \\(A\\rightarrow\\mathbf 0\\rightarrow B\\). In particular, note that \\(0_{A,B}\\circ f=0_{X,A}\\) and \\(g\\circ 0_{A,B}=0_{B,X}\\) for any \\(f:X\\rightarrow A\\) and \\(g:B\\rightarrow X\\), for any object \\(X\\). We note that equivalently, an additive functor maybe defined as a functor that preserves all finite biproducts. We recall that in a category \\(\\mathcal C\\), the equalizer \\(\\mathrm{Eq}(f,g)\\) of morphisms \\(f,g:A\\rightarrow B\\) is an object \\(E\\in\\mathcal C\\) and a morphism \\(e:E\\rightarrow A\\) s.t. the diagram \\(E\\rightarrow A\\rightrightarrows B\\) commutes and is universal with respect to this construction. Dually, the coequalizer \\(\\mathrm{Coeq}(f,g)\\) is an object \\(Q\\in\\mathcal C\\) and a morphism \\(q:B\\rightarrow Q\\) s.t. the diagram \\( A\\rightrightarrows B\\rightarrow Q\\) commutes and is universal with respect to this construction. In an additive category, for a morphism \\(f:A\\rightarrow B\\), define its kernel \\(\\mathrm{Ker}(f)=\\mathrm{Eq}(f,0_{A,B})\\), cokernel \\(\\mathrm{Coker}(f)=\\mathrm{Coeq}(f,0_{A,B})\\). Spelled out explicitly, a kernel of \\(f:A\\rightarrow B\\) is an object \\(K\\) and a morphism \\(k:K\\rightarrow A\\) such that \\(f\\circ k=0_{K,B}\\), and given any \\(K^\\prime\\) and \\(k^\\prime:K^\\prime\\rightarrow A\\) with \\(f\\circ k^\\prime=0_{K^\\prime,B}\\), there exists unique \\(u:K^\\prime\\rightarrow K\\) s.t. \\(k\\circ u=k^\\prime\\). Dually, a cokernel of \\(f:A\\rightarrow B\\) is an object \\(Q\\) with a morphism \\(q:B\\rightarrow Q\\) with \\(q\\circ f=0_{A,Q}\\), such that for any object \\(Q^\\prime\\) and morphism \\(q^\\prime:B\\rightarrow Q\\) with \\(q^\\prime\\circ f=0_{A,Q^\\prime}\\), there exists unique \\(u:Q\\rightarrow Q^\\prime\\) such that \\(q^\\prime=u\\circ q\\). Recall a subobject of an object \\(X\\) is an object \\(A\\) with a monomorphism \\(A\\hookrightarrow X\\), and a quotient object of \\(X\\) is an object \\(Q\\) with an epimorphism \\(X\\twoheadrightarrow Q\\). We remark that \\(\\mathrm{Ker}(f)\\) is a subobject of \\(A\\) and \\(\\mathrm{Coker}(f)\\) is a quotient object of \\(B\\), when they exist (it is an easy exercise to show equalizers are monic and coequalizers are epic). Definition 2. An abelian category is an additive category where every morphism has a kernel and a cokernel, every monomorphism is the kernel of its cokernel, and every epimorphism is the cokernel of its kernel. Moreover, in an abelian category, for any morphism \\(f:A\\rightarrow B\\), we define its image as the kernel of its cokernel \\(\\mathrm{Im}(f)=\\mathrm{Ker}(\\mathrm{Coker}(f))\\), and coimage as the cokernel of its kernel \\(\\mathrm{Coim}(f)=\\mathrm{Coker}(\\mathrm{Ker}(f))\\). A quintessential example of an abelian category is the category of \\(R\\)-modules. In fact, the Freyd–Mitchell embedding theorem states that any abelian category can be embedded to the category of \\(R\\)-modules for some \\(R\\) via a fully faithful functor. So we may use element-wise diagram chasing in abelian categories, which may help us derive diagram chasing theorems such as \\(5\\)-lemma and snake lemma. In an abelian category, all finite limits and colimits exist, in particular, pullbacks exist and they preserve monomorphisms and epimorphisms. Lemma 3. In an abelian category, a morphism \\(f:A\\rightarrow B\\) is monic iff \\(\\mathrm{Ker}(f)=\\mathbf 0\\), and epic iff \\(\\mathrm{Coker}(f)=\\mathbf 0\\), a morphism \\(f:A\\rightarrow B\\) is an isomorphism iff it is monic and epic, each morphism \\(f:X\\rightarrow Y\\) factorizes canonically as \\(X\\twoheadrightarrow \\mathrm{Im}(f)\\hookrightarrow Y\\) and \\(X\\twoheadrightarrow \\mathrm{Coim}(f)\\hookrightarrow Y\\) for a morphism \\(f:A\\rightarrow B\\), if it factorizes as \\(A\\twoheadrightarrow X\\rightarrow B\\) then \\(\\mathrm{Coker}(f)=\\mathrm{Coker}(X\\rightarrow B)\\), and if it factorizes as \\(A\\rightarrow X\\hookrightarrow B\\), then \\(\\mathrm{Ker}(f)=\\mathrm{Ker}(A\\rightarrow X)\\). Proof Left as an exercise. Left as an exercise. We will only prove the factorization \\(X\\twoheadrightarrow \\mathrm{Coim}(f)\\hookrightarrow Y\\), and the other one can be proved dually. First, we have \\(\\mathrm{Ker}(f)\\hookrightarrow X\\rightarrow Y\\) is zero and \\(\\mathrm{Ker}(f)\\hookrightarrow X\\twoheadrightarrow \\mathrm{Coim}(f)\\) is zero, so we have a factorization \\(X\\twoheadrightarrow \\mathrm{Coim}(f)\\rightarrow Y\\) by the universal property of cokernels. It remains to show that \\(\\beta:\\mathrm{Coim}(f)\\rightarrow Y\\) is a monomorphism. Suppose \\(\\varphi_1,\\varphi_2:Z\\rightarrow \\mathrm{Coim}(f)\\) with \\(\\beta\\circ \\varphi_1=\\beta\\circ \\varphi_2\\), therefore \\(\\beta\\circ \\sigma=0\\) where \\(\\sigma=\\varphi_1-\\varphi_2\\). Consider the pullback \\(W=X\\times_{\\mathrm{Coim}(f)}Z\\) with \\(\\tau:W\\rightarrow Z\\) and \\(\\pi:W\\rightarrow X\\) of the maps \\(\\mathrm{Coim}(f)\\) and \\(\\sigma\\). We note that \\(f\\circ\\pi=\\beta\\circ\\mathrm{Coim}(f)\\circ \\pi=\\beta\\circ\\sigma\\circ\\tau=0\\), so \\(\\pi\\) factors through \\(\\mathrm{Ker}(f)\\) by \\(W\\rightarrow \\mathrm{Ker}(f)\\hookrightarrow X\\) say \\(w:W\\rightarrow \\mathrm{Ker}(f)\\). Therefore, \\(\\sigma\\circ\\tau=\\mathrm{Coim}(f)\\circ \\mathrm{Ker}(f)\\circ w=0\\circ w=0\\). Since pullbacks preserve epimorphisms, \\(\\tau\\) is epic. Thus \\(\\sigma\\circ\\tau=0\\) implies \\(\\sigma=0\\), so \\(\\varphi_1=\\varphi_2\\). Left as an exercise. For a morphism \\(f:A\\rightarrow B\\) in an abelian category, we factor \\(f:A\\rightarrow B\\) canonically as \\(A\\twoheadrightarrow \\mathrm{Coim}(f)\\hookrightarrow B\\), and since \\(A\\twoheadrightarrow \\mathrm{Coim}(f)\\hookrightarrow B\\rightarrow \\mathrm{Coker}(f)\\) is zero and \\(A\\twoheadrightarrow \\mathrm{Coim}(f)\\) is epic, \\(\\mathrm{Coim}(f)\\hookrightarrow B\\rightarrow \\mathrm{Coker}(f)\\) is zero, so we can factor \\(\\mathrm{Coim}(f)\\hookrightarrow B\\) as \\(\\mathrm{Coim}(f)\\rightarrow \\mathrm{Im}(f)\\hookrightarrow B\\). We denote by \\(\\overline{f}:\\mathrm{Coim}(f)\\rightarrow \\mathrm{Im}(f)\\) the map induced by this factorization, and say \\(f\\) is strict if \\(\\overline{f}\\) is an isomorphism. Theorem 4. (First isomorphism theorem) In an abelian category, all morphisms are strict. Proof Suppose \\(f:A\\rightarrow B\\) is a morphism in an abelian category, and factorize as \\(A\\twoheadrightarrow\\mathrm{Coim}(f)\\hookrightarrow B\\). By Lemma 3, \\(\\mathrm{Coker}(f)=\\mathrm{Coker}(\\mathrm{Coim}(f)\\hookrightarrow B)\\). Since \\(\\mathrm{Coim}(f)\\hookrightarrow B\\) is monic, it is the kernel of its cokernel, so it is the kernel of \\(\\mathrm{Coker}(f)\\). Since \\(\\mathrm{Im}(f)\\hookrightarrow B\\) in our construction is also the kernel of \\(\\mathrm{Coker}(f)\\), the induced map \\(\\overline{f}\\) is an isomorphism by the universal property of kernels. In an abelian category, suppose \\(f:A\\rightarrow B\\) and \\(g:B\\rightarrow C\\) are such that \\(g\\circ f=0\\). We factor \\(A\\twoheadrightarrow \\mathrm{Im}(f)\\hookrightarrow B\\), and since \\(A\\twoheadrightarrow \\mathrm{Im}(f)\\hookrightarrow B\\rightarrow C\\) is zero and \\(A\\twoheadrightarrow\\mathrm{Im}(f)\\) is epic, we have \\(\\mathrm{Im}(f)\\hookrightarrow B\\rightarrow C\\) is zero. Thus, we can factor \\(\\mathrm{Im}(f)\\hookrightarrow B\\) as \\(\\mathrm{Im}(f)\\rightarrow \\mathrm{Ker}(g)\\hookrightarrow B\\), and the map \\(\\mathrm{Im}(f)\\rightarrow \\mathrm{Ker}(g)\\) is the canonical map. We say such sequence \\(A\\rightarrow B\\rightarrow C\\) is exact if the canonical map is an isomorphism. More generally, a sequence \\(d_A^i:A^i\\rightarrow A^{i+1}\\)\\[\\cdots\\longrightarrow A^{i-1}\\xrightarrow{\\ d^{i-1}_A\\ } A^i\\xrightarrow{\\ \\ d^{i}_A\\ \\ } A^{i+1}\\longrightarrow\\cdots\\]is called a (co)chain complex if each three term subsequence compose to zero, and exact or acyclic if each three term subsequence is exact. A chain map \\(f^\\bullet:A^\\bullet\\rightarrow B^\\bullet\\) is a commutative diagram A chain homotopy is a collection of maps $h^i:A^i\\rightarrow B^{i-1}$ s.t. $f^i-g^i=d^{i-1}_B\\circ h^i+h^{i+1}\\circ d^i_A$ for all $i$, illustrated by which typically does NOT commute. We write \\(f^\\bullet\\simeq g^\\bullet\\) if they are chain homotopic, and we say \\(A^\\bullet\\) and \\(B^\\bullet\\) are chain homotopy equivalent if there are chain maps \\(f^\\bullet:A\\rightarrow B\\) and \\(g^\\bullet:B\\rightarrow A\\) s.t. \\(f^\\bullet\\circ g^\\bullet \\simeq \\mathbf{1}_{B^\\bullet}\\) and \\(g^\\bullet\\circ f^\\bullet \\simeq \\mathbf{1}_{A^\\bullet}\\), in which case \\(f^\\bullet\\) are \\(g^\\bullet\\) called homotopy pseudo-inverses. If \\(A\\) is a category, let \\(C(\\mathcal A)\\) be the category of chain complexes in \\(\\mathcal A\\) with chain maps are morphisms. If \\(\\mathcal A\\) is additive, then \\(C(\\mathcal A)\\) inherits an obvious group structure on its morphisms, and they make it an additive category as well. Also, if \\(\\mathcal A\\) is abelian then so is \\(C(\\mathcal A)\\). Let \\(C^+(\\mathcal A)\\) be the full subcategory of \\(C(\\mathcal A)\\) where the complexes are bounded below (exists \\(N\\in\\mathbb Z\\) s.t. \\(A^i=\\mathbb 0\\) for \\(i &lt; N \\)), and similarly \\(C^-(\\mathcal A)\\) is the full subcategory \\(C(\\mathcal A)\\) where the complexes are bounded above. Let \\(C^b(\\mathcal A)\\) be the full subcategory of \\(C(\\mathcal A)\\) where the complexes are bounded below and above. Definition 5. Let \\(A^\\bullet\\) be a cochain complex in \\(\\mathcal A\\) with canonical morphisms \\(\\mathrm{Im}(d^{n-1})\\rightarrow\\mathrm{Ker}(d^{n})\\), define\\[H^n(A^\\bullet)=\\mathrm{Coker}(\\mathrm{Im}(d^{n-1})\\rightarrow\\mathrm{Ker}(d^{n}))\\]as the \\(n\\)-th cohomology object. In fact, for a chain map \\(f^\\bullet: A^\\bullet\\rightarrow B^\\bullet\\), we associate an induced morphism \\(H^nf^\\bullet:H^n(A^\\bullet)\\rightarrow H^n(B^\\bullet)\\), which makes \\(H^n\\) an additive functor \\(C(\\mathcal A)\\rightarrow\\mathcal A\\). Moreover, \\(f^\\bullet\\) is said to be a quasi-isomorphism if \\(H^nf^\\bullet\\) is an isomorphism for all \\(n\\in\\mathbb Z\\). Let \\(\\mathcal A\\) be an abelian category. The translation functor \\(T:C(\\mathcal A)\\rightarrow C(\\mathcal A)\\) sends a complex \\(A^\\bullet =(A^i,d^i)\\) to the complex \\(T(A^\\bullet) =(A^{i+1},-d^{i+1})\\), and \\(T(f^\\bullet):T(A^\\bullet)\\rightarrow T(B^\\bullet)\\) for \\(f^\\bullet:A^\\bullet\\rightarrow B^\\bullet\\) is given by \\(T(f^\\bullet)^i=f^{i+1}\\). The functor essentially shifts the complex left by one, where the negative sign of the differential is a convention useful later. We denote by \\(A^\\bullet[n]=T^n(A^\\bullet)\\) for \\(n\\in\\mathbb Z\\) (negative integers correspond to right translations). The right truncation functor \\(\\tau_{\\le n}:C(\\mathcal A)\\rightarrow C^-(\\mathcal A)\\) sends a complex in the following way where the red arrow is induced via universal property. The functor \\(\\tau_{\\le n}:C(\\mathcal A)\\rightarrow \\mathcal A\\) sends the morphisms in the obvious way. Moreover, we have a canonical monomorphism \\(\\tau_{\\le n}(A^\\bullet)\\rightarrow A^\\bullet\\) which induces isomorphisms on their cohomology objects. The left truncation functor \\(\\tau_{\\ge n}:C(\\mathcal A)\\rightarrow C^+(\\mathcal A)\\) is defined dually. Definition 6. Suppose \\(f^\\bullet:A^\\bullet\\rightarrow B^\\bullet\\) is a morphism in \\(C(\\mathcal A)\\) for some abelian category \\(\\mathcal A\\). The cone of \\(f^\\bullet\\) is \\(\\mathrm{Cone}(f^\\bullet)=A^\\bullet[1]\\oplus B^\\bullet\\). Spelled out explicitly, the cochain complex consists of objects \\(A^{n+1}\\oplus B^n\\), and the differential \\(d^n:A^{n+1}\\oplus B^n\\rightarrow A^{n+2}\\oplus B^{n+1}\\) is given by\\[d^n=\\begin{pmatrix}-d_{A^\\bullet}^{n+1}&amp;0\\\\ f^{n+1}&amp; d_{B^\\bullet}^n\\end{pmatrix}\\]acting as though on column vectors. We remark that a short exact sequence of complexes induces a long exact sequence of cohomology. Say we have\\[\\mathbf 0\\longrightarrow A^{\\bullet}\\xrightarrow{\\ f^{\\bullet}\\ } B^\\bullet\\xrightarrow{\\ g^\\bullet\\ } C^\\bullet\\longrightarrow\\mathbf 0\\]a short exact sequence of complexes, then for each \\(n\\), exists \\(\\delta^n:H^n(C^\\bullet)\\rightarrow H^{n+1}(A^\\bullet)\\) making\\[\\cdots\\rightarrow H^n(A^\\bullet)\\rightarrow H^n(B^\\bullet)\\rightarrow H^n(C^\\bullet)\\xrightarrow{\\delta^n} H^{n+1}(A^\\bullet)\\rightarrow H^{n+1}(B^\\bullet)\\rightarrow H^{n+1}(C^\\bullet)\\rightarrow\\cdots\\]exact. This is a very common construction in homological algebra, and the way we construct these connecting morphisms is by applying the snake lemma twice. Suppose \\(f^\\bullet:A^\\bullet\\rightarrow B^\\bullet\\) is a chain map with cone \\(C^\\bullet=\\mathrm{Cone}(f^\\bullet)\\), then the map \\(\\iota^{n}=0 \\oplus \\operatorname{Id}_{B^{n}}: B^{n} \\rightarrow C^{n}\\) and the canonical projection \\(\\rho^n:C^n\\rightarrow A^{n+1}\\) gives chain maps \\(\\iota^\\bullet:B^\\bullet\\rightarrow C^\\bullet\\) and \\(\\rho^\\bullet:C^\\bullet \\rightarrow A^\\bullet [1]\\) which fits into a short exact sequence \\[\\mathbf 0\\longrightarrow B^{\\bullet}\\xrightarrow{\\ \\iota^{\\bullet}\\ } C^\\bullet\\xrightarrow{\\ \\rho^\\bullet\\ } A^\\bullet[1]\\longrightarrow\\mathbf 0\\]Hence this induces a long exact sequence on cohomology objects. Working out the connecting morphism, we find out that the connecting morphisms are nothing more than the induced morphisms \\(\\delta^n=H^{n+1}f^\\bullet\\). From this fact, we deduce that \\(f^\\bullet\\) is a quasi-isomorphism iff the cone \\(\\mathrm{Cone}(f^\\bullet)\\) is acyclic. Definition 7. Suppose \\(\\mathcal A\\) is an abelian category. An object \\(X\\) in \\(\\mathcal A\\) is injective (resp. projective) if the contravariant (resp. covariant) left exact (resp. right exact) hom-functor \\(\\mathrm{Hom}(-,X):\\mathcal A\\rightarrow\\mathbf{Ab}\\) (resp. \\(\\mathrm{Hom}(X,-):\\mathcal A\\rightarrow\\mathbf{Ab}\\)) is exact. Moreover, we say \\(\\mathcal A\\) has enough injectives (resp. enough projectives) if for any object \\(Y\\) there is an injective object (resp. projective object) \\(X\\) and a monomorphism \\(Y\\rightarrow X\\) (resp. epimorphism \\(X\\rightarrow Y\\)). An injective resolution of an object \\(X\\) is a complex \\(I^\\bullet\\) bounded below \\(0\\) and a quasi-isomorphism \\(X\\rightarrow I^\\bullet\\), or equivalently, an exact sequence\\[\\mathbf 0\\rightarrow X\\rightarrow I^0\\rightarrow I^1\\rightarrow \\cdots\\]where each \\(I^i\\) is injective. Dually, a projective resolution of an object \\(X\\) is a complex \\(P_\\bullet\\) bounded above \\(0\\) and a quasi-isomorphism \\(P_\\bullet\\rightarrow X\\), or equivalently, an exact sequence\\[\\cdots\\rightarrow P_1\\rightarrow P_0\\rightarrow X\\rightarrow \\mathbf 0\\]where each \\(P_i\\) is projective. It is a familiar result in homological algebra that if an abelian category has enough injectives (resp. enough projectives) then every object has an injective resolution (resp. projective resolution). Moreover, given a long exact sequence \\(\\mathbf 0\\rightarrow X\\rightarrow M^\\bullet\\) and an injective resolution of \\(I^\\bullet\\) of \\(Y\\), then every \\(f:X\\rightarrow Y\\) extends to a chain map and two such construction of chain maps are homotopic. The dual can be said about projective resolutions. I should also mention the Horseshoe lemma or the simultaneous resolution theorem, which states that if we have a short exact sequence \\(\\mathbf 0\\rightarrow X\\rightarrow Y\\rightarrow Z\\rightarrow\\mathbf 0\\) and injective resolutions \\(I^\\bullet\\) for \\(Y\\) and \\(K^\\bullet\\) for \\(Z\\), then there is an injective resolution \\(J^\\bullet\\) of \\(Y\\) that and a short exact sequence of complexes \\(\\mathbf 0\\rightarrow I^\\bullet\\rightarrow J^\\bullet \\rightarrow K^\\bullet\\rightarrow\\mathbf 0\\) which splits. This does NOT commute. This implies that additive functors take split exact sequences to split exact sequences.Suppose \\(\\mathscr{F}:\\mathcal A\\rightarrow\\mathcal B\\) is a left exact functor betweeen abelian categories, then applying \\(\\mathscr{F}\\) to a short exact sequence \\(\\mathbf 0\\rightarrow A\\rightarrow B\\rightarrow C\\) gives a short exact sequence \\(\\mathbf 0\\rightarrow \\mathscr{F}(A)\\rightarrow \\mathscr{F}(B)\\rightarrow \\mathscr{F}(C)\\). A natural question to ask is whether we could continue this exact sequence to the right. It turns out that there is a canonical way of doing so, by defining the right derived functors \\(R^i\\mathscr{F}:\\mathcal A\\rightarrow \\mathcal B\\), we may continue the exact sequence\\[\\mathbf 0\\rightarrow \\mathscr{F}(A)\\rightarrow\\mathscr{F}(B)\\rightarrow\\mathscr{F}(C)\\rightarrow R^1\\mathscr{F}(A)\\rightarrow R^1\\mathscr{F}(B)\\rightarrow R^1\\mathscr{F}(C)\\rightarrow\\cdots\\]Note that \\(\\mathscr{F}\\) is exact iff \\(R^1\\mathscr{F}=0\\), so in a sense the right derived functors measures how far \\(\\mathscr{F}\\) is from exact. Definition 8. Let \\(\\mathcal A,\\mathcal B\\) be abelian categories and \\(\\mathcal A\\) has enough injectives. Suppose \\(\\mathscr{F}:\\mathcal A\\rightarrow\\mathcal B\\) is a left-exact functor. Let \\(X\\in\\mathcal A\\) and suppose \\(I^\\bullet\\) is an injective resolution, then we obtain a complex\\[\\mathbf 0\\rightarrow \\mathscr{F}(I^0)\\rightarrow\\mathscr{F}(I^1)\\rightarrow\\mathscr{F}(I^2)\\rightarrow\\cdots\\]Define the right derived functors as the additive functors \\(R^i\\mathscr{F};\\mathcal A\\rightarrow\\mathcal B\\)\\[R^i\\mathscr{F}(X)=H^i(\\mathscr{F}I^\\bullet)\\]for \\(i\\ge 0\\). Left derived functors \\(L_i\\mathscr{F}\\) are defined dually via projective resolution. The most important examples of derived functors are the Ext and Tor functors. The Ext functor is the right derived functor of the hom-functor, and the Tor functor is the left derived functor of tensor product. Recall that there is a tensor-Hom adjunction \\(\\mathrm{Hom}(Y\\otimes X,Z)\\cong \\mathrm{Hom}(Y,\\mathrm{Hom}(X,Z))\\), so these functors are related very closely. Definition 9. For \\(A,B\\in \\mathbf{Mod}_R\\), define the Ext functors\\[\\begin{aligned}\\mathrm{Ext}_R^i(A,B)&amp;=(R^i\\mathrm{Hom}_R(A,-))(B)\\\\ &amp;\\cong (R^i\\mathrm{Hom}_R(-,B))(A)\\end{aligned} \\] and the Tor functors \\[\\begin{aligned}\\mathrm{Tor}_i^R(A,B)&amp;= (L_i(A\\otimes_R -))(B)\\\\ &amp;\\cong (L_i(-\\otimes_R B))(A)\\end{aligned}\\] for all \\(i\\ge 0\\). Example 10. Derived functors can help us defined many (co)homology theory. Sheaf cohomology. Let \\(X\\) be a topological space, then the global section functor \\(\\Gamma:\\mathrm{Sh}(X)\\rightarrow \\mathbf{Ab}\\) which sends \\(\\mathscr{F} \\mapsto \\mathscr{F}(X)\\) is left exact, its right derived functor \\(H^i(X,-):\\mathrm{Sh}(X)\\rightarrow \\mathbf{Ab}\\) is the sheaf cohomology \\(H^i(X,\\mathscr{F})\\). Its special cases include the de Rham cohomology. Group cohomology. Let \\(k\\) be an algebraically closed field and \\(G\\) a group, then the invariant functor \\((-)^G:\\mathbf{Mod}_{k[G]}\\rightarrow\\mathbf{Mod}_{k[G]}\\), which is the same as \\(\\mathrm{Hom}_{k[G]}(k,-)\\), is left exact, its right derived functor \\(H^i(G;-):\\mathbf{Mod}_{k[G]}\\rightarrow\\mathbf{Mod}_{k[G]}\\) gives the group cohomology \\(H^i(G;M)=\\mathrm{Ext}^i_{k[G]}(k,M)\\). Hochschild cohomology. This one I’m not really familiar, so I will not write about it in detail. The derived functors are natural in the sense that if we have a morphism of two short exact sequence in \\(\\mathcal A\\), then the induced morphisms of the long exact sequences in \\(\\mathcal B\\) commutes with the long exact sequences. Finally, I’d like to finish with the definition of the homotopy category of complexes. We say that a chain map is nullhomotopic if it is homotopic to the zero chain. Definition 11. Let \\(\\mathcal A\\) be an abelian category, the homotopy category of complexes \\( K(\\mathcal A)\\) is the category where objects are (co)chain complexes in \\(\\mathcal A\\) and morphisms are chain maps up to homotopy, i.e. \\[\\mathrm{Hom}_{K(\\mathcal A)}(A^\\bullet,B^\\bullet)=\\mathrm{Hom}_{C(\\mathcal A)}(A^\\bullet,B^\\bullet)/G\\] where \\(G\\) is the subgroup of nullhomotopic chain maps. There are many things that needs to be checked here for it to be well defined, which we omit. We will see that this category is not typically abelian, but it is triangulated. A triangulated category is an approximation of an abelian category.","link":"/archives/4bee11dc/"},{"title":"A Go Variant: Terrain Go","text":"“The rules of go are so elegant, organic, and rigorously logical that if intelligent life forms exist elsewhere in the universe, they almost certainly play go. “ Edward Lasker The game of Go is an ancient and profound abstract strategy board game that I, albeit losing most of my games, enjoy playing very much. If you have not heard of Go before, see here for a quick guide to the rules of Go. I’ve been recently designing my own variant of Go, which I call “Terrain Go” tentatively for lack of a better name. This variant is inspired by Bobby Fischer’s Fischer random chess, which is a chess variant that, at the outset of the game, randomizes the initial positions of pieces at the players’ home ranks in a certain way that preserves the dynamic nature of the game. The variant is designed to “eliminate the complete dominance of openings preparation in classical chess, replacing it with creativity and talent.” In a similar spirit, we introduce randomness at the outset of Go by way of “terrain”, in a way that preserves the dynamic nature of Go. RulesAt the beginning of the game, each intersection on the 19 by 19 board will be assigned one of the following types Mountain, indicated by a triangle \\(\\Delta\\) Water, indicated by a square \\(\\square\\) Plains, with no indication and they are generated randomly in a way such that each group of \\(\\Delta\\) or \\(\\square\\) does not surround empty intersections, and that there are exactly 60 in 2 to 4 groups of each \\(\\Delta\\) or \\(\\square\\), each group having at least 12 stones. Therefore, 60 intersections are mountain, 60 intersections are water, and 240 intersections are plains. In classical Go, with area scoring, each intersection is worth 1 point. However, in Terrain Go, each \\(\\Delta\\) is worth 0 point, each \\(\\square\\) is worth 1.5 points, and each plain is worth 1 point. Additionally, at the beginning, players will take turns placing 3 markings each, called their “forts”, on a “plain” intersection of their choice, which will be indicated by letters. They will each be worth 12 points for the opponent if at the end of the game they end up in the oppoent’s territory (and 0 if it ends up in their own), and once placed, they cannot be captured or removed from the board, or occupied by a stone, or serve as a liberty for another group. Here’s an example of a configuration of the board, where A, B, C are white’s forts, and C, D, E are black’s. The game will begin with the player who played second in placing the marking, and the rules of capture and Ko, etc, will all follow that of classical Go with the area scoring described above. Additionally, there are special rules for placing stones at moutain or water areas: A stone can only be placed at an intersection marked as \\(\\Delta\\) if it will be a part of a group that has at least 1 liberty outside; a stone can only be placed at an intersection marked as \\(\\square\\) if it will be a part of a group that has at least 1 stone outside. Since the initial position is randomized, we wouldn’t be able to know the appropriate komi, so the initial positions must be checked by an AI program to make sure it is relatively fair for both players, compensating with a small komi for black or white if necessary. New Tactics and StrategiesAn obvious consequence of the new rules is that any Joseki/Fuseki are rendered obsolete, thus the player cannot obtain any advantage by pre-memorizing openings. The uneven distribution of value of intersections could also lead to interesting strategies. This is arguably closer to real-life war, in which not all areas are of equal strategic value. I would also imagine that it is probably good strategy to start the game around the forts, which are the most valuable positions. In addition, the special rules for placing stones at mountains and waters could lead to novel life and death situations and local tactics. It is more difficult to traverse water because a stone cannot jump in the water alone, it must connect to an existing group that bridges to land. It is even more difficult to traverse mountains since the opponent could try to eliminate outside liberties easily. Therefore, it is possible, for example, to imagine a position where a group of stones is sorrounded “against” a group of mountains or waters. The reader is welcomed to think about more tactics unique to this variant.","link":"/archives/14bc455e/"},{"title":"What is This Thing Called Knowledge?","text":"“Epistemology without contact with science becomes an empty scheme. Science without epistemology is – insofar as it is thinkable at all – primitive and muddled.” Albert Einstein Epistemology is a branch of philosophy which studies knowledge. It concerns problems such as: how is knowledge defined (what does it mean to know something)? What is the value of knowledge? What is the structure of knowledge? I became interested in epistemology recently and have started reading Duncan Pritchard’s introductory text What is This Thing Called Knowledge? I can’t help but want to write down some of the things I’ve learned from my reading. In this post, I will talk about some key ideas from Pritchard’s book. The Problem of CriterionWhen we think about what we know, we usually think about one of two kinds of knowledge: 1. propositional knowledge, knowledge expressible with a proposition, such as “the sky is blue”, or 2. ability knowledge, such as the knowledge of how to swim. Henceforth, when talking about knowledge, we will always be referring to the former. It is agreed upon epistemologists that the two basic elements for one to posess a piece of knowledge are truth and belief: one should believe the knowledge and the knowledge itself should be true. However, these two conditions not sufficient. Knowledge is not merely true beliefs: one can have true beliefs completely by accident. Suppose that there is a doctor who diagnoses a patient by a toss of a coin. Suppose also that the coin toss happens to give the correct diagnoses, then does it follow that the doctor knows what is wrong with the patient? Obviously not. Thus, it is a problem for epistemologists to try and figure out what is needed to be added to give a satisfactory definition (i.e. criterion) of knowledge. However, anyone who wishes to define knowledge faces the an immediate problem. To know the criterion of knowledge we need to know all that we do know, but to know all that we do know requires us to know the criterion of knowledge itself. It’s a Catch-22. This is the problem of the criterion. What do we know (what is the extent of our knowledge)? How do we know (what is the criterion of knowledge)? Each of these two problems are impossible to answer without first answering the other. One approach seeks to answer the first question first – this is stance called particularism, advocated by Roderick Chisholm “we start with particular cases of knowledge and then from those we generalise and formulate criteria [which tell] us what it is for a belief to be epistemologically respectable.” The antithesis of this position is methodism, exemplified by René Descartes, which seeks to answer the second question first. This position states that it is possible, through philosophical reflection alone, to identify criterions of knowledge, and through which to identify instances of knowledge. This is the position taken by classical empiracists. There is also a third stance, skepticism, which proclaims that since it is impossible to answer one question without the other, we are unable to answer either question, and hence unable to justify any of our beliefs. Gettier CasesA very natural methodist attempt to the problem of criterion, typically attributed to Plato, is to proclaim that knowledge are justified true beliefs, i.e. true beliefs with some good basis or grounds. This is the tripartite theory of knowledge. However, things are not that simple. The philosopher Edmund Gettier, in a three-page article, gave a list of devastating counter-examples to the tripartite theory, which we call the Gettier Cases, showing that it is completely untenable. In essence, it shows that you could have a justified true belief but still lack knowledge because your true belief was gained by luck in the same way as the previous example of the doctor. I will here paraphrase an example of such a case from Pritchard’s book. Imagine a man named, say, John, comes downstairs one morning and sees the clock on the living room says it’s 8 o’clock. On this basis, John believes it is 8 o’clock. John usually comes downstairs around this time, and the clock has been very realiable in the past, so John is justified in his belief. Suppose, however, it was unbeknownst to him that the clock had stopped precisely 12 hours ago. So John had a justified true belief which does not intuitively constitute knowledge – other Gettier cases more or less have the same structure as this example. Therefore, the tripartite account is insufficient for the criterion of knowledge (it is, however, agreed among epistemologists that the tripartite conditions are necessary for having knowledge). It was at first believed that the Gettier cases could be amended by tweaking the tripartite condition, such as stipulating that the belief should be true, justified, and not based on false presuppositions. However, it is difficult to specify the meaning of “presuppositions”, e.g. you could have a justification of a true belief with a false presupposition. For example, John could have a friend Sally who looks at a working clock and thinks that the time is 8 o’clock, but she might justify this by presupposing the clock is regularly maintained, which happens to not be the case. Moreover, it is also not clear that a presuppoosition is needed at all. For example, suppose a farmer forms a belief that there is a sheep in the field by looking at a shaggy dog which looks like a sheep, but there actually is a sheep on the field, standing behind the dog. Thus, it is difficult to respond to Gettier cases. Agrippa’s trilemmaThe nature of justification is enigmatic. Pick any belief for which you have a justification, then it still remains the question: what justifies the justification itself? And if we have a justification of that justification, what justifies it then? We could keep asking this question ad infinitum. Thus, we find ourselves in the following predicament called the Agrippa’s trilemma (or Münchhausen trilemma): in order to justify any statement, we must accept one of the following kind of arguments, each of which is unsatisfactory: circular argument: the justification of a proposition presupposes itself, regressive argument: each justification requires a further justification ad infinitum, dogmatic argument: some statements are regarded as accepted precepts (merely asserted but not defended). Some philosophers embrace option 1, and proclaim that a circular chain of arguments can justify a claim, which is a position called coherentism. This is usually supplemented with the proviso that the circular chain must be large enough. Other philosophers embrace option 2, and proclaim that we can justify a claim by an infinite chain of arguments, which is a position called infinitism. The third position is to embrace option 3, and proclaim some beliefs are justified without without any further justification, which is a position known as foundationalism – the position taken in modern mathematics. The dominant foundationalist view states that some beliefs do not require further justification because there are self-justifying – this is known as classical foundationalism. An example of a classical foundationalist is Descartes. He argued that the foundations for our knowledge are those that immune to doubt and are hence self-evident. He gave the example of ones belief of ones own existance. I cannot doubt my own existance because for me to doubt – to think – requires my existing in the first place. Hence his famous line, “I think, therefore I am.” The Problem of PerceptionA large portion of our knowledge comes from our senses, i.e. perceptual knowledge. We tend to think that our sensory faculties are reliable, but perceptual knowledge can deceive us. This is because fundamentally perceptions are an indirect way of gaining knowledge – our perceived reality could be hallucinations undetectable from reality. This is the argument from illusion. It is odd as it contradicts our intuitive sense that we are directly experiencing reality, hence we have a problem: could we ever directly directly perceive the physical world? This is the problem of perception. One response to this problem is indirect realism, which embraces the apparent indirectness of our perception, and proclaims that we gain knowledge of the objective world by making inferences from our sense impressions. John Locke makes the distinction between primary and secondary qualities of an object perceived: a primary quality of an object is a quality independent of anyone perceiving the object e.g. shape, and a secondary quality is a quality dependent upon the perception of an object, e.g. color. Indirect realists use this notion to distinguish world-as-it-is and world-as-perceived. This view, however, threatens to dislocate ourselves from the world. Skeptics respond by the famous thought experiment of the brain in a vat: how do we know whether our perceived reality is simulated with a supercomputer? This is the problem of the external world. How could I, in this case, infer anything at all about the objective world? Thus, there is no reason to assume so in the first place. The view that denies there is a world independent of our experience is idealism, a famous exponent of which is George Berkeley. This position claims that perceptual knowledge is not knowledge of a world independent of perception, but knowledge of a world constituted by our perception of it. In this view, the world is constructed out of perception – “to be is to be perceived.” However, idealist typically don’t agree that the world cease to exist when no one is to perceive it. To avoid such dramatic consequence, Berkeley proclaims that there is a God who perceives everything, which does not convince me very much. Another version of idealism is transcendental idealism by Immanuel Kant. Kant argues that although what we perceive may not be the world itself, we are required to suppose that there is an external world which gives rise to such experience, without which we cannot make sense of it. This sounds like indirect realism, but it is idealism in the sense that Kant rejects the possibility of gaining knowledge independent of experience through experience at all, directly or not A Priori, A Posteriori, and Problem of InductionWe distinguish between a priori knowledge, knowledge gained independent of empircal investigation, and a posteriori knowledge i.e. empircal knowledge. For example, an important variety of a priori knowledge is introspection – the examination of one’s own psychology. All proposition that one could have a priori knowledge of, one could also have a posteriori knowledge of. From these knowledge, we could infer more with argument. The general types of arguments are: deduction, induction, abduction, analogy and fallacy. Inductive arguments infer from a large number of a posteriori knowledge, the sample, a general claim that goes beyond the sample. David Hume raised the problem of induction which questions whether inductive arguments are justified. There seem that the only way to justify inductive arguments is by further use of the argument – by observing the correlation between observed regularity in a large sample and unrestricted regularity. The justification of the inductive inference is circular. Some respond to the problem by claiming it is a fundamental epistemic practice, and some claim that it does not matter as long as inductive arguments work, but those defenses are hardly intellectually satisfying. Karl Popper’s response to this problem is critical rationalism: inductive inference are never used in science, instead they conjecture hypotheses, deductively infer consequences from them, and empiracally try to falsify the consequences. Therefore, scientists in fact use deductive inferences rather than inductive inferences. There are some problems with this position. One problem is in this view, we do not actually know the generalizations that scientists make, but only the falsity of the falsified theories. This would mean we don’t know that the “correct” scientific theories are true, only that they have not been falsified yet. Another problem is that it is not clear how much counter evidence is needed to falsify a claim. If it is been observed for many years that emus are flightless, then a testimony that one has seen a flying emus does not necessarily constitude enough evidence to falsify that claim. An alternative approach is given by Hans Reichenbach’s pragmatism. Reichenbach agrees that there is no justification for inductive reference, but it is pragmatic to use it since it gives us a lot of true beliefs of the world, thus it is nevertheless a rational thing to do. Problem of Other MindsWe take for granted that other people have minds like we do, but this is not entirely obvious. We cannot observe other minds like we observe objects, and we cannot experience other’s perspective like we experience our own either. Thus, there is skepticism to whether other people also have the first person experience like I do. This is the problem of other minds The most famous response is from John Stuart Mill, who make use of inductive reasoning. I observe that the behaviors of others mirror our own, from this I inductively infer that they have minds like I do. This is the argument from analogy. There are problems with this argument as well. In the 1956 film Invasion of the Body-Snatchers, aliens quitely replace real people but they act and behave just like regular people, but they do not experience the world as we do. This points out the flaw in the argument from analogy: we cannot be sure just by observing behavior. In this argument, we could infer that things, such as a highly advanced robot, has a mind, when it is not clear if it is true. A series of videos on this topic (in Chinese) can be found here. Radical Skeptical ParadoxA skeptical hypothesis is a scenario whereby one is severely deceived about the world but unable to detect such deception. In epistemology, skeptical hypotheses are used as a litmus test for any theory of knowledge. Thus skepticism is seen as a methodological devil’s advocate. This gives rise to the radical skeptical paradox: since we are unable to know the denials of skeptical hypotheses, we are unable to know anything of substance at all about the world. There is a lot more about this topic, but I’m tired and I think I will stop here.","link":"/archives/cba08641/"},{"title":"What the Frobenius!","text":"“The mathematics are usually considered as being the very antipodes of Poesy. Yet Mathesis and Poesy are of the closest kindred, for they are both works of the imagination.” Thomas Hill The Frobenius endomorphism of schemes confuses the hell out of me. There’s the absolute Frobenius, the relative Frobenius, the arithmetic Frobenius, the geometric Frobenius… It’s a huge mess of concepts. So, I think it’ll probably benefit me to write an article elucidating these ideas. Our task is to generalize the Frobenius endomorphism \\(\\mathrm{Frob}_R:R\\rightarrow R\\) defined by \\(x\\mapsto x^p\\) for a commutative ring \\(R\\) of characteristic \\(p\\) (recall \\(\\mathrm{Frob}_{\\mathbb F_{p^n}}\\) generates the Galois group \\(\\mathrm{Gal}(\\mathbb F_{p^n}/\\mathbb F_p)\\)), to the more general case of an endomorphism of a scheme of characteristic \\(p\\). We begin by defining the absolute Frobenius, and show that it has some undesirable properties, which prompts us to make modifications. Definition. Let \\(X\\) be a scheme of characteristic \\(p&gt;0\\). The absolute Frobenius endomorphism \\(\\mathrm{Frob}_X:X\\rightarrow X\\) (sometimes written as \\(F_X\\)) is defined as the identity on the topological space, and \\(\\mathrm{Frob}_X^{\\flat }\\) is given by the usual Frobenius \\(\\mathrm{Frob}_A\\) for each open affine \\(\\mathrm{Spec}(A)=U\\subseteq X\\). This seems to be a natural generalization, but we run into the problem that for an \\(S\\)-scheme \\(f:X\\rightarrow S\\), we have \\(\\mathrm{Frob}_X\\) is in general not an \\(S\\)-scheme morphism. For example, take \\(X=S=\\mathrm{Spec}(A)\\) where \\(A=\\mathbb F_{p^2}\\) with identity as the structure map. Note that \\(\\mathrm{Frob}_{A}\\) is not a \\(A\\)-algebra morphism, hence \\(\\mathrm{Frob}_X\\) is not an \\(S\\)-morphism. Thus, this motivates us to define a relative variant. Let \\(f:X\\rightarrow S\\) be an \\(S\\)-scheme, consider the diagram where \\(X^{(p)}=X\\times_S S\\) is the base change of \\(X\\) by the Frobenius (as in Cartesian square in the diagram), and \\(F_{X/S}=\\mathrm{Frob}_{X/S}:X\\rightarrow X^{(p)}\\) is the unique morphism for the diagram to commute i.e. defined by the universal property, called the relative Frobenius of \\(X\\) over \\(S\\). For example, take \\(A\\) a ring of characteristic \\(p\\), \\(R\\) a finitely presented algebra over \\(A\\), and \\(X=\\mathrm{Spec}R\\), then \\(X^{(p)}=\\mathrm{Spec}(R\\otimes_{A,F_A} A)\\), which is an extension of scalars. Therefore if \\(R=A[X_1,\\dots,X_n]/(f_1,\\dots,f_m)\\) then \\(R^{(p)}\\cong A[X_1,\\dots,X_n]/(f_1^{(p)},\\dots,f_m^{(p)})\\) where \\(f^{(p)}=\\sum_\\alpha s_\\alpha^p X^\\alpha\\) for \\(f=\\sum_\\alpha s_\\alpha X^\\alpha\\), and \\(X=\\mathrm{Spec}(R^{(p)})\\). The morphism \\(\\sigma_X^*\\) is induced by the endomorphism \\(f \\mapsto f^{(p)}\\) on \\(A[X_1,\\dots,X_n]\\), and the morphism \\(F_{X/S}^*=\\mathrm{Frob}_{X/S}^*\\) is induced by the endmorphism of \\(A\\)-algebras \\(X_i\\mapsto X_i^p\\) on \\(A[X_1,\\dots,X]\\). Theorem. The relative Frobenius is compatible with base change in the sense that\\[\\mathrm{Frob}_{X/S}\\times_S \\mathbf{1}_T = \\mathrm{Frob}_{(X\\times_S T)/T}\\] identifying \\(X^{(p/S)}\\times_S T\\cong (X\\times_S T)^{(p/T)}\\) canonically. There is also the arithmetic and geometric Frobenius, which are defined as base changes of the absolute Frobenius. The arithmetic Frobenius \\(\\mathrm{Frob}_{X / S}^a: X^{(p)} \\rightarrow X \\times_S S \\cong X\\) is the base change \\(\\mathrm{Frob}_{X / S}^a=\\mathbf{1}_X \\times_S \\mathrm{Frob}_S\\). Assume that the absolute Frobenius \\(\\mathrm{Frob}_S\\) is invertible, then the geometric Frobenius \\(\\mathrm{Frob}_{X / S}^g: X^{(1 / p)} \\rightarrow X \\times_S S \\cong X\\) is the base change \\(\\mathrm{Frob}^g_{X/S}=\\mathbf{1}_X\\times_S \\mathrm{Frob}_S^{-1}\\).","link":"/archives/a22e0346/"},{"title":"Simplicial Sets and $\\infty$-Categories: Part I","text":"“I am not saying that I believe in the law of the excluded middle, I am just saying that it isn’t not true. ” Kavin Satheeskumar Recently, I’ve been reading Cisinski’s Higher Categories and Homotopical Algebra. I wanted to write down some of the things I’ve learned. In this post, we start from a review of presheaves of sets and simplicial sets, and then build towards the definition of an \\(\\infty\\)-category. Let \\(A\\) be a category, recall a presheaf on \\(A\\) is a contravariant functor \\(X:A^{\\mathrm{op}}\\rightarrow \\mathbf{Set}\\), where we denote \\(X_a=X(a)\\) and \\(u^*:b\\rightarrow a\\) the induced morphism for each \\(u:a\\rightarrow b\\). And the category of presheaves on \\(A\\) is denoted as \\(\\widehat{A}\\). The category of elements \\(\\int_AX\\) (or \\(\\int X\\)) is the category where objects are \\((a,s)\\) where \\(a\\in A\\) and \\(s\\in X_a\\), and a morphisms \\(u:(a,s)\\rightarrow (b,t)\\) is a morphism \\(u:a\\rightarrow b\\) where \\(u^*(t)=s\\). It comes equipped with a faithful functor \\(\\varphi_X:\\int_A X\\rightarrow \\widehat{A}\\) given by \\((a,s)\\mapsto \\mathscr{H}_a\\) on objects and \\(u\\mapsto \\mathscr{H}(u)\\) on morphisms, where \\(\\mathscr{H}:A\\rightarrow \\widehat{A}\\) is the Yoneda embedding. In this post, we ignore all set-theoretic size issues. PresheavesFirst, we prove a variation of the Yoneda lemma (the coend calculus version). Theorem. The cocone defined by the collection of maps \\(s:\\mathscr{H}_a\\rightarrow X\\) for \\((a,s)\\in \\int_AX\\) (identifying via Yoneda lemma) exhibits \\(X\\) as a colimit of \\(\\varphi_X\\) viewed as a diagram, that is, \\(X=\\mathrm{colim}\\ \\varphi_X\\). Proof Let \\(Y\\) be a presheaf on \\(A\\). By the Yoneda lemma \\(\\mathrm{Hom}_{\\widehat{A}}(\\mathscr{H}_a,Y)\\cong Y_a\\), so a cocone from \\(\\varphi_X\\) to \\(Y\\) can be viewed as a collection of sections \\(f_s\\in Y_a\\) for \\((a,s)\\in \\int_AX\\) such that \\(u^*(f_t)=f_s\\) for all \\(u:(a,s)\\rightarrow (b,t)\\). This means the collection of maps \\(X_a\\rightarrow Y_a\\) by \\(s\\mapsto f_s\\) is a morphism of presheaves. Hence, the map \\(\\Phi: \\mathrm{Hom}(X,Y)\\rightarrow (\\varphi_X\\downarrow Y)\\) given by composition with \\(s:\\mathscr{H}_a\\rightarrow X\\) for \\((a,s)\\in \\int_AX\\) has a two-sided inverse, therefore we have \\(X=\\mathrm{colim}\\varphi_X\\). Let \\(C\\) be a category with limits. For \\(u:A\\rightarrow C\\), we can define a functor of evaluation \\[u^*:C\\rightarrow \\widehat{A}\\quad\\quad Y\\mapsto \\left[a\\mapsto \\mathrm{Hom}_{C}(u(a),Y)\\right]\\] i.e. \\(u^*(Y)=\\mathrm{Hom}_C(-,Y)\\circ u\\). By this version of Yoneda lemma, we have the following consequence. Theorem. (Kan) The functor \\(u^*:C\\rightarrow \\widehat{A}\\) has left ajoint \\(u_{!}:\\widehat{A}\\rightarrow C\\). Moreover, there exists a natural isomorphism \\(u(a)\\xrightarrow{\\sim} u_{!}(\\mathscr{H}_a)\\) for \\(a\\in A\\), such that for any \\(Y\\in C\\), the induced bijection \\[\\mathrm{Hom}_C(u(a),Y)\\xrightarrow{\\sim} \\mathrm{Hom}_C(\\mathscr{H}_a,Y)\\] is the inverse of the composition \\[\\mathrm{Hom}_C(u(a),Y)=u^*(Y)_a\\xrightarrow{\\sim} \\mathrm{Hom}_{\\widehat{A}}(\\mathscr{H}_a,u^*(Y))\\xrightarrow{\\sim} \\mathrm{Hom}_C(u_!(\\mathscr{H}_a), Y)\\] of the Yoneda equivalence with the adjunction formula. Simplicial SetsLet \\(\\Delta\\) be the category where the objects are finite sets \\([n]=\\{0,\\dots,n\\}\\) for \\(n\\in\\mathbb N\\), and the morphisms are order preserving functions, called the simplex category. A simplicial set is a presheaf on \\(\\Delta\\), and we denote the category of simplicial sets by \\(\\mathbf{SSet}=\\widehat{\\Delta}\\). For \\(n\\in\\mathbb N\\), denote \\(\\Delta^n=\\mathscr{H}_n\\) as the standard \\(n\\)-simplex. For a simplicial set \\(X\\), we write \\(X_n=X([n])=\\mathrm{Hom}(\\Delta^n,X)\\) the set of \\(n\\)-simplices of \\(X\\). For integer \\(n\\ge 1\\) and \\(0\\le i\\le n\\), the map \\(\\partial^n_i:\\Delta^{n-1}\\rightarrow \\Delta^n\\) corresponds to the map \\([n-1]\\rightarrow [n]\\) where the value \\(i\\) is not taken, and for \\(n\\ge 0\\), the map \\(\\sigma^n_i:\\Delta^{n+1}\\rightarrow \\Delta^n\\) corresponds to the map \\([n+1]\\rightarrow [n]\\) that takes the value \\(i\\) twice. We also write \\(d^i_n=(\\partial_i^n)^*:X_n\\rightarrow X_{n-1}\\) and \\(s^i_n=(\\sigma_i^n)^*:X_n\\rightarrow X_{n+1}\\). The category \\(\\Delta\\) is uniquely captured by a set of identities involving these operations. There is a geometric realization functor \\(|\\cdot|:\\mathbf{SSet}\\rightarrow \\mathbf{Top}\\) where \\(\\mathbf{Top}\\) is the category of compactly generated Hausdorff topological spaces, given by \\[|\\Delta^n|=\\left\\{(x_j)_{0\\le j\\le n}\\in\\mathbb R^{n+1}_{\\ge 0}: \\sum_{j=0}^n x_j= 1\\right\\}\\] and \\(|X|=\\mathrm{colim}_{\\Delta^n\\rightarrow X}|\\Delta^n|\\) for a simplicial set \\(X\\). For each \\(f:[m]\\rightarrow [n]\\), we get an associated continuous map \\(|f|:|\\Delta^m|\\rightarrow |\\Delta^n|\\), defined by \\(|f|(x_0,\\dots,x_m)=(y_0,\\dots,y_n)\\) where \\(y_j=\\sum_{f(i)=j}x_i\\). By virtue of the preceeding theorem, we have singular complex functor \\(\\mathrm{Sing}:\\mathbf{Top}\\rightarrow\\mathbf{SSet}\\), given by \\(Y\\mapsto \\left[[n]\\mapsto \\mathrm{Hom}(|\\Delta^n|,Y)\\right]\\) which is right adjoint to the geometric realization functor, i.e. \\(|\\cdot|\\dashv \\mathrm{Sing}\\) Definition. An Eilenberg-Zilber category is a quadruple \\((A,A_{+},A_{-},d)\\) where \\(A\\) is a category, \\(A_{+},A_{-}\\) subcategories, and \\(d:A\\rightarrow\\mathbb N\\) a set-function, such that An isomorphism of \\(A\\) is an isomorphism of \\(A_{+}\\) and \\(A_{-}\\) If a morphism \\(a\\rightarrow b\\) in \\(A_{+}\\) (resp. \\(A_{-}\\)) is not the identity then \\(d(a)&lt;d(b)\\) (resp. \\(d(b)&lt;d(a)\\)) Any morphism \\(u:a\\rightarrow b\\) in \\(A\\) factors uniquely as \\(u=ip\\) where \\(p:a\\rightarrow c\\) in \\(A_{-}\\) and \\(i:c\\rightarrow b\\) in \\(A_{+}\\) For a morphism \\(\\pi:a\\rightarrow b\\) in \\(A_{-}\\), there exists \\(\\sigma:b\\rightarrow a \\) in \\(A\\) such that \\(\\pi\\sigma=\\mathbf{1}_b\\). For \\(\\pi,\\tau:a\\rightarrow b\\) in \\(A_{-}\\), if \\(\\pi\\) and \\(\\tau\\) have the same set of sections then \\(\\pi=\\tau\\). We say an object \\(a\\in A\\) has dimension \\(n\\) if \\(d(a)=n\\). The category \\(\\Delta\\) is Eilenberg-Zilber with \\(\\Delta_{+}\\) (resp. \\(\\Delta_{-}\\)) the subcategory of monos (resp. epis), and \\(d([n])=n\\). Let \\(X\\) be a presheaf on an Eilenberg-Zilber category \\(A\\). For \\(a\\in A\\), we say \\(x\\in X_a\\) is degenerate if there is a map \\(\\sigma:a\\rightarrow b\\) in \\(A\\) with \\(d(b)n\\) any section of \\(\\mathrm{Sk}_n(X)\\) over an object \\(a\\) of dimension \\(m\\) is degenerate, that is \\(\\mathrm{Sk}_n(X)\\) restricts the sections to dimensions \\(\\le n\\). We can easily make the construction \\(\\mathrm{Sk}_n\\) functorial, so it can be viewed as a functor. NervesEvery poset \\(E\\) can be viewed as a category where objects are elements, and there is a unique morphism \\(x\\rightarrow y\\) if \\(x\\le y\\) and none otherwise. Let \\(i:\\Delta\\rightarrow\\mathbf{Cat}\\) the inclusion functor, then the nerve functor \\(N=i^*:\\mathbf{Cat}\\rightarrow\\mathbf{SSet}\\) is given by \\(C\\mapsto [[n]\\mapsto \\mathrm{Hom}_{\\mathbf{Cat}}([n],C)]\\). Thus the \\(n\\)-simplex of \\(N(C)\\) is a string of arrows of length \\(n\\) in \\(C\\). By the preceeding theorem, the nerve functor has a left adjoint \\(\\tau=i_{!}:\\mathbf{SSet}\\rightarrow\\mathbf{Cat}\\). We’ll stop here and continue more in Part II.","link":"/archives/bf63e237/"},{"title":"Bundles and Divisors on Schemes","text":"“Algebra is but written geometry and geometry is but figured algebra.” Sophie Germain Recall that for a topological space \\(X\\), a fibre bundle of fibres \\(F\\), where \\(F\\) is a topological space, is a topological space \\(E\\), with a surjective map \\(\\pi: E\\rightarrow X\\) such that for all \\(x\\in X\\), exists an open nbhd \\(x\\in U\\subseteq X\\) such that there is a homeomorphism \\(\\varphi: \\pi^{-1}(U)\\rightarrow U\\times F\\) such that \\(\\mathrm{pr}_U\\circ \\varphi=\\pi|_{\\pi^{-1}(U)}\\) where \\(\\mathrm{pr}_U:U\\times F\\rightarrow U\\) is the projection onto \\(U\\). Fibre bundles generalize vector bundles and covering spaces. In this post, we interpret this algebraically and generalize this notion to schemes. Symmetric Algebra and Quasi-coherent BundlesRecall that for \\(M\\) an \\(A\\)-module, its tensor algebra is the graded algebra \\(T(M)=\\bigoplus_{n\\in\\mathbb N}T^n(M)\\) where \\(T^n(M)=M^{\\otimes n}\\). The symmetric algebra is the algebra \\(\\mathrm{Sym}(M)=T(M)/I\\) where \\(I\\) is the ideal generated by the set \\(\\{m\\otimes n-n\\otimes m:m,n\\in M\\}\\), which is a graded algebra \\(\\mathrm{Sym}(M)=\\bigoplus_{n\\in\\mathbb N}\\mathrm{Sym}^n(M)\\) since \\(I\\) is homogeneous. Note that \\(\\mathrm{Sym}^0(M)=A\\) and \\(\\mathrm{Sym}^1(M)=M\\), so there is a map \\(i:\\mathrm{Sym}^1(M)=M\\rightarrow \\mathrm{Sym}(M)\\). The symmetric algebra has the universal property that the precomposition \\(\\varphi\\mapsto \\varphi\\circ i\\) induces a bijection \\[\\mathrm{Hom}_{A-\\mathrm{Alg}}(\\mathrm{Sym}(M),B)\\rightarrow\\mathrm{Hom}_{A-\\mathrm{Mod}}(M,B)\\] for every \\(A\\)-algebra \\(B\\). Setting \\(B=\\mathrm{Sym}(N)\\), we see from this that we can find \\(\\mathrm{Sym}(u):\\mathrm{Sym}(M)\\rightarrow\\mathrm{Sym}(N)\\) which is a graded morphism, so \\(\\mathrm{Sym}\\) is a functor from the category of \\(A\\)-modules to the category of graded \\(A\\)-algebras. We globalize this construction to schemes. Let \\(X\\) be a scheme (a more generally a ringed space), and \\(\\mathcal E\\) and \\(\\mathcal O_X\\)-module, then define the graded \\(\\mathcal O_X\\)-algebra \\(\\mathrm{Sym}(\\mathcal E)=\\bigoplus_{n\\in\\mathbb N}\\mathrm{Sym}^n(\\mathcal E)\\) be the sheafification of \\(U\\mapsto \\mathrm{Sym}_{\\Gamma(U,\\mathcal O_X)}(\\Gamma(U,\\mathcal E))\\), and similar to the local case, we have a bijection \\[\\mathrm{Hom}_{\\mathcal O_X-\\mathrm{Alg}}(\\mathrm{Sym}(\\mathcal E), \\mathcal A)\\rightarrow \\mathrm{Hom}_{\\mathcal O_X-\\mathrm{Mod}}(\\mathcal E, \\mathcal A)\\] Let \\(\\mathcal B\\) be a quasicoherent \\(\\mathcal O_X\\)-algebra. There exists an \\(X\\)-scheme \\(\\underline{\\mathrm{Spec}}(\\mathcal B)\\), such that for all \\(X\\)-schemes \\(f:T\\rightarrow X\\) there are bijections functorial in \\(T\\) of the following form \\[\\mathrm{Hom}_{\\mathrm{Sch}/X}(T,\\underline{\\mathrm{Spec}}(\\mathcal B))\\rightarrow\\mathrm{Hom}_{\\mathcal O_X-\\mathrm{Alg}}(\\mathcal B,f_*\\mathcal O_T)\\] In other words, the functor \\((\\mathrm{Sch}/X)^{\\mathrm{op}}\\rightarrow \\mathbf{Set}\\) given by \\((f: T \\rightarrow X) \\mapsto \\mathrm{Hom}_{\\mathcal{O}_X-\\mathrm{Alg}}\\left(\\mathcal{B}, f_* \\mathcal{O}_T\\right)\\) is representable. To see this, we note that this is a sheaf on the Zariski site, since \\(f_*\\) and \\(\\mathrm{Hom}(\\mathcal B,-)\\) are left-exact. We also have this is covered by representable open subfunctors. More concretely, the points of \\(\\underline{\\mathrm{Spec}}(\\mathcal B)\\) above \\(x\\in X\\) is that of \\(\\mathrm{Spec}(\\mathcal \\Gamma(B,\\mathcal O_X)\\otimes \\kappa(p))\\) and the topology above an open affine \\(U=\\mathrm{Spec}(A)\\) is \\(\\mathrm{Spec}(\\Gamma(U,\\mathcal B))\\). For every quasi-coherent \\(\\mathcal O_X\\)-module \\(\\mathcal E\\), we define \\(\\mathbb V(\\mathcal E)=\\underline{\\mathrm{Spec}}(\\mathrm{Sym}(\\mathcal E))\\) functorial in \\(E\\) which the call the quasi-coherent bundle associated to \\(E\\). When restricted to locally free \\(\\mathcal O_X\\)-modules, this functor provides a correspondance to algebraic vector bundles, where algebraic vector bundles are understood as follows, Definition. A vector bundle of rank \\(n\\in\\mathbb N\\) on \\(X\\) is an \\(X\\)-scheme \\(V\\) with an equivalence class of families \\((U_i, c_i)\\) where \\((U_i)_i\\) is an open cover of \\(V\\) and isomorphisms \\(c_i:V|_{U_i}\\rightarrow \\mathbb A^{n}_{U_i}\\) of \\(U_i\\)-schemes, such that for all \\(i,j\\), the automorphisms \\(c_i\\circ c_j:\\mathbb A^n_{U_i\\cap U_j}\\rightarrow \\mathbb A^n_{U_i\\cap U_j}\\) are linear, where two such families, called atlases, are equivalent if their union is an atlas. Moreover, define a morphisms of vector bundles \\((V,U_i,c_i)\\rightarrow (V^\\prime,U^\\prime_i,c^\\prime_i)\\) as a \\(X\\)-morphism \\(f:V\\rightarrow V^\\prime\\) such that \\(c^\\prime_j\\circ f\\circ c_i^{-1}:\\mathbb A^n_{U_i\\cap U^\\prime_j}\\rightarrow \\mathbb A^n_{U_i\\cap U^\\prime_j}\\) is linear. The locally free \\(\\mathcal O_X\\)-modules are interpreted as sheaf of sections over the vector bundle. More specifically, for a vector bundle \\(E\\) as above, we define a locally free \\(\\mathcal O_X\\)-module \\(\\mathcal E_V\\) as the following. Define the sheaf \\(\\mathcal P( V/X)\\) of abelian groups by attaching to \\(U\\subseteq X\\) the sections of \\(V\\) over \\(U\\), that is, morphisms \\(s:U\\rightarrow V|_U\\) with \\(f\\circ s=\\mathrm{id}_U\\), and restrictions are given by restrictions of scheme morphisms. Locally, this has the structure of \\(\\mathcal O_X^n\\) which gives the module structure. This gives the inverse to \\(\\mathbb V(-)\\). This correspondance is part of what is known as Serre-Swan theorem Cartier Divisors and Weil divisorsIt is an important question to determine the configuration of zeros and poles of a rational (or meromorphic) function. Let \\(X\\) be an integral scheme (i.e. reduced and irreducible). We denote by \\(\\mathcal K_X\\) the constant sheaf on \\(X\\) with value the function field \\(K(X)\\) of \\(X\\). Definition. A Cartier divisor on \\(X\\) is a family \\((U_i,f_i)\\) where \\((U_i)_i\\) is an open cover of \\(X\\) and \\(f_i\\in K(X)^\\times\\) with \\(f_if_j^{-1}\\in \\Gamma(U_i\\cap U_j,\\mathcal O_X^\\times) \\) for all \\(i,j\\), where two families \\((U_i,f_i)\\), \\((V_i,g_i)\\) give rise to the same Cariter divisor if \\(f_ig_j^{-1}\\in\\Gamma(U_i\\cap V_j,\\mathcal O_X^\\times)\\) for all \\(i,j\\). The Cartier divisors form an abelian group \\(\\mathrm{Div}(X)\\), where adding the family \\((U_i,f_i)\\) and \\((V_i,g_i)\\) gives \\((U_i\\cap V_j,f_ig_j)\\). A Cartier divisor is principle if it is given by some \\((X,f)\\), and two divisors \\(D,E\\) are linearly equivalent if \\(D-E\\) is principle. Alernatively, we can set \\(\\mathrm{Div}(X)=\\Gamma(X,\\mathcal K_X^\\times/\\mathcal O_X^\\times)\\), and principle divisors the ones in the image of \\(\\Gamma(X,\\mathcal K_X^\\times)\\). We call the ones in \\(\\Gamma(X,(\\mathcal K_X^\\times\\cap \\mathcal O_X)/\\mathcal O_X^\\times)\\) effective divisors and denote it by \\(D\\ge 0\\). Let \\(\\mathrm{Cl}(X)\\) denote \\(\\mathrm{Div}(X)\\) modulo the principle divisors, which we call the divisor class group. We have\\[1\\longrightarrow \\Gamma(X,\\mathcal O_X)^\\times\\longrightarrow K(X)\\longrightarrow \\mathrm{Div}(X) \\longrightarrow \\mathrm{Cl}(X)\\longrightarrow 0\\] a short exact sequence. To a Cartier divisor \\(D\\), we associate the line bundle \\(\\mathcal O_X(D)\\)\\[\\Gamma(V,\\mathcal O_X(D))=\\{f\\in K(X): \\forall i,f_if\\in \\Gamma(U_i\\cap V,\\mathcal O_X)\\}\\] for all open \\(V\\subseteq X\\). This association \\(D\\mapsto \\mathcal O_X(D)\\) induces an isomorphism \\(\\mathrm{Cl}(X)\\cong \\mathrm{Pic}(X)\\). Call an invertible \\(\\mathcal O_X\\)-submodule of \\(\\mathcal K_X\\) an invertible fractional ideal of \\(\\mathcal O_X\\). Then we can associate a Cartier divisor \\(D\\) an invertible fractional ideal \\(\\mathcal F_X(D)\\) such that \\(\\mathcal F_X(D) (U_i)=f_i\\mathcal O_X\\). This correspondance provides an isomorphism between \\(\\mathrm{Div}(X)\\) and the invertible fractional ideal on \\(X\\). Cartier divisors considered more geometrically is so called Weil divisors. Let \\(Z^k(X)\\) be the free abelian group generated on the set of closed integral subscheme of codimension \\(k\\). The elements of \\(Z^1(X)\\) are then called Weil divisors and their generators called the prime divisors, and the ones with nonnegative coefficients are called the effective Weil divisors. We now connect Weil divisors with Cartier divisors with a homomorphism \\(\\mathrm{cyc}: \\mathrm{Div}(X)\\rightarrow Z^1(X) \\). To this end, we need to define, for a prime Weil divisor \\(C\\), the order \\(\\mathrm{ord}_C(f)\\) for some meromorphic function \\(f\\in \\Gamma(U,\\mathcal K_X)\\) where the generic point \\(\\xi\\) of \\(C\\) is contained in \\(C\\). If the local ring \\(\\mathcal O_{X,C}=\\mathcal O_{X,\\xi}\\) is a DVR, for example, when \\(X\\) is normal, then we can just set \\(\\mathrm{ord}_C(f)=\\nu (f)\\) the normalized discrete valuation of \\(f\\). In general, the local ring is a local noetherian ring of dimension \\(1\\). For a nonzero \\(f\\in \\mathrm{Frac}(\\mathcal O_{X,C})\\) where \\(f=a/b\\) we set \\(\\mathrm{ord}_C(f)=\\mathrm{lg}(\\mathcal O_{X,C}/(a))-\\mathrm{lg}(\\mathcal O_{X,C}/(b))\\). For a Cartier divisor \\(D\\), we choose some element of its atlas \\((U_i,f_i)\\) where \\(\\xi_C\\in U_i\\), and define \\(\\mathrm{ord}_C(D)=\\mathrm{ord}_C(f_i)\\), and then we can define \\(\\mathrm{cyc}(D)=\\sum_C\\mathrm{ord}_C(D)\\left[C\\right]\\). This provides the desired correspondance. Like Cartier divisors, we can associate to each Weil divisor \\(D\\), a fractional ideal \\(\\mathcal L\\) where\\[\\Gamma(U,\\mathcal L)=\\{f\\in \\mathcal K_X(U): \\mathrm{div}(f)+D\\ge 0\\}\\] which is the same one as the one with the corresponding Cartier divisor. TorsorsFor a sheaf \\(T\\) on some \\(X\\) and a sheaf of groups \\(G\\) on \\(X\\), we say \\(T\\) is a \\(G\\)-torsor if \\(G\\) acts on \\(T\\) simply transitively and \\(X\\) has an open cover \\((U_i)_i\\) such that \\(T(U_i)\\) is nonempty for all \\(i\\). The sheaf cohomology \\(H^1(X,G)\\) classifies the \\(G\\)-torsors. For a locally free \\(\\mathcal O_X\\)-module \\(\\mathcal E\\) of rank \\(n\\). The sheaf \\(\\mathrm{Isom}(\\mathcal O_X^n,\\mathcal E)\\) is a \\(\\mathrm{GL}_n(\\mathcal O_X)\\)-torsor by \\(\\mathrm{GL}_n(\\mathcal O_X)(U)\\) acts on \\(\\mathrm{Isom}(\\mathcal O_X^n,\\mathcal E)(U)\\) by \\(g\\cdot u\\mapsto u\\circ g^{-1}\\). We have a bijection between rank \\(n\\) vector bundles and \\(H^1(X,\\mathrm{GL}_n(\\mathcal O_X))\\), so rank \\(n\\) vector bundles are identified with \\(\\mathrm{GL}_n(\\mathcal O_X)\\)-torsors.","link":"/archives/9e4b6689/"},{"title":"Grothendieck's Proof of van Kampen theorem","text":"“It’s to that being inside of you who knows how to be alone, it is to this infant that I wish to speak, and no-one else. ” Alexander Grothendieck In this post, we present a proof of van Kampen theorem in algebraic topology that is different from the standard proof in most texts. This is a proof due to Grothendieck and it generalizes better into algebraic geometry, which is an algebraic analogue known as the étale fundamental group. This proof is shorter, more conceptual (uses universal properties without invoking concrete generators and relations), and uses covering spaces. Let \\(X\\) be a topological space with all the nice connectedness properties, in particular, we assume it has a universal covering \\(u:\\widetilde{X}\\rightarrow X\\). Let \\(G\\) be a group, \\(x\\in X\\), and \\(\\rho:\\pi_1(X,x)\\rightarrow G\\) a homomorphism. We define a based \\(G\\)-covering \\(p_{\\rho}:(Y_\\rho,y_\\rho)\\rightarrow (X,x)\\). Take the product \\(\\widetilde{X}\\times G\\) with \\(G\\) having the discrete topology, and \\(\\pi_1(X,x)\\) acts on it by \\(\\sigma\\cdot(z,g)=(\\sigma\\cdot z,g\\rho(\\sigma^{-1}) )\\). Take \\(Y_\\rho=(\\widetilde{X}\\times G)/\\pi_1(X,x)\\) by this action, and \\(y_{\\rho}\\) the image of \\((\\widetilde{x},1)\\). Note that we have \\((\\sigma\\cdot z,g)=(z,g\\rho(\\sigma))\\) in \\(Y_\\rho\\). Let \\(p_\\rho:Y_{\\rho}\\rightarrow X\\) be \\((z,g)\\mapsto u(z)\\). The group \\(G\\) acts on \\(Y_\\rho\\) by \\(h\\cdot (z,g)=(z,hg)\\) evenly, making \\(Y_{\\rho}\\) a \\(G\\)-covering. Conversely, suppose \\(p:(Y,y)\\rightarrow (X,x)\\) is a \\(G\\)-covering, we constrct a morphism \\(\\pi_1(X,x)\\rightarrow G\\). For \\(\\sigma\\in \\pi_1(X,x)\\), we let \\(\\rho(\\sigma)\\) be the element that acts by \\(\\rho(\\sigma)\\cdot y=y*\\sigma\\) where \\(y*\\sigma\\) is the end point of the path that lifts \\(\\sigma\\). Theorem. This construction gives a bijection\\[\\mathrm{Hom}(\\pi_1(X,x),G)\\leftrightarrow \\{G\\textrm{-coverings}\\ \\textrm{of}\\ (X,x)\\}\\] up to isomorphisms. Checking this is routine. Let \\(X=U\\cup V\\) with \\(U,V\\) path-connected and intersect nontrivially, with base point \\(x\\in U\\cap V\\). Suppose there are coverings \\(p:\\widetilde{U}\\rightarrow U\\) and \\(q:\\widetilde{V}\\rightarrow V\\) and an isomorphism \\(\\nu:p^{-1}(U\\cap V)\\rightarrow q^{-1}(U\\cap V)\\), then one can glue them together to a covering of \\(X\\), by taking \\(\\widetilde{X}=\\widetilde{U}\\times\\widetilde{V}/(\\nu(y_1)\\sim \\nu(y_2))\\). We can generalize this to the case where \\(X\\) is the union of a family of open sets, in which case we require a cocycle condition to be satisfied in order to be able to glue the covering spaces. Theorem (van Kampen). For any \\(h_1:\\pi_1(U,x)\\rightarrow G\\) and \\(h_2:\\pi_1(V,x)\\rightarrow G\\) with \\(h_1\\circ i_1=h_2\\circ i_2\\) where \\(i_1,i_2\\) are induced by inclusions \\(U\\cap V\\hookrightarrow U \\) and \\(U\\cap V\\hookrightarrow V \\), there exists a unique morphism \\(h:\\pi_1(X,x)\\rightarrow G\\) such that \\(h\\circ j_1=h_1\\) and \\(h\\circ j_2=h_2\\) where \\(j_1,j_2\\) are induced by inclusions \\(U\\hookrightarrow X\\) and \\(V\\hookrightarrow X\\). Diagrammically, this is saying \\(\\pi_1(X,x)\\) is a fibred coproduct in the category of groups, which is a free product with amalgamation, as shown below The homomorphisms \\(h_1,h_2\\) determine \\(G\\)-coverings \\(Y_1\\rightarrow U\\) and \\(Y_2\\rightarrow V\\). The commutativity of the square means that their restrictions to \\(U\\cap V\\) are isomorphic \\(G\\)-coverings, thus by previous work, they glue to a covering which restricts to \\(U,V\\). This is given by a \\(h:\\pi_1(X,x)\\rightarrow G\\) which is precisely the morphism desired. Corollary. If \\(U\\cap V\\) is simply connected then\\[\\mathrm{Hom}(\\pi_1(X,x),G)=\\mathrm{Hom}(\\pi_1(U,x),G)\\times \\mathrm{Hom}(\\pi_1(V,x),G)\\] which implies \\(\\pi_1(X,x)\\) is a free product. It is also worth mentioning that this proof is an example of descent.","link":"/archives/b80e1240/"},{"title":"Uniformization Theorem for Elliptic Curves","text":"“The pursuit of mathematics is a divine madness of the human spirit.” Alfred North Whitehead In this post, we prove the uniformization theorem for elliptic curves. The theorem states that every elliptic curve over the complex numbers arose from the complex plane modulo a lattice, and vice versa. In fact there is an isomorphism between them which is both complex analytic and algebraic. This shows that elliptic curves over complex numbers is a torus. A lattice \\(L=[\\omega_1,\\omega_2]\\subseteq \\mathbb C\\) is an additive subgroup \\(\\omega_1\\mathbb Z+\\omega_2\\mathbb Z\\subseteq \\mathbb C\\) with \\(\\omega_1,\\omega_2\\) linearly independent. For example, if \\(\\mathcal O=\\mathbb Z[\\tau]\\) is an imaginary quadratic order, the it gives rise to lattice \\([1,\\tau]\\). An elliptic function for a lattice \\(L\\) is a meromorphic function \\(f:D\\subseteq \\mathbb C\\rightarrow\\mathbb C\\) that is doubly-periodic w.r.t. \\(L\\), i.e. \\(f(z+\\omega)=f(z)\\) for all \\(\\omega\\in L\\). Elliptic functions form a field \\(\\mathbb C(L)\\). We recall Cauchy’s principle argument. Theorem (Cauchy). Let \\(\\gamma\\) be a simply closed positively oriented curve with interior \\(\\Gamma\\). Let \\(f\\) be a function meromorphic on an open set \\(\\Omega\\) containing \\(\\Gamma\\) and \\(\\gamma\\) that has no zero or pole on \\(\\gamma\\), and \\(g\\) a nonzero function holomorphic on \\(\\Omega\\), then for \\(z_0\\in\\Gamma\\) \\[\\frac{1}{2\\pi i}\\oint_{\\gamma}g(z)\\frac{f^\\prime(z)}{f(z)}\\mathrm dz=\\sum_{\\omega\\in \\Gamma}g(z_0)\\mathrm{ord}_{w}(f)\\] when \\(g(z)=1\\), the rhs is the difference between the number of zeros and poles in \\(\\Omega\\). This theorem is proved by writing \\(f,g\\) in terms of their Laurent series about \\(z_0\\) and using Residue theorem. A corollary from this is that in any fundamental paralellogram \\(F_{\\alpha}=\\alpha+\\{t_1\\omega_1+t_2\\omega_2:0\\le t_1,t_2&lt;1\\}\\), the number of poles is equal to the number of zeros. Definition. Let \\(L\\) be a lattice and \\(k&gt;2\\) an integer. The Einsenstein series of weight \\(k\\) is \\[G_{k}(L)=\\sum_{\\omega\\in L\\setminus\\{0\\}}\\frac{1}{\\omega^k}\\] Consider lattices \\([1,\\tau]\\) for \\(\\tau\\in\\mathbb H\\) where \\(\\mathbb H=\\{z\\in\\mathbb C:\\mathrm{Im}(z)&gt;0\\}\\) is the upper-half plane, we define \\(G_{k}(\\tau)=G_{k}([1,\\tau])\\), so that \\(G_k\\) is a funciton on the upper-half plane \\(\\mathbb H\\). If \\(k\\) is odd then the term \\(\\frac{1}{\\omega^k}\\) cancels with \\(\\frac{1}{(-\\omega)^k}\\), so the only interesting Einsenstein series are those of even weight. The Einsenstein series converges absolutely. Definition. A Weierstrass \\(\\wp\\)-function of a lattice \\(L\\) is \\[\\wp(z ; L)=\\frac{1}{z^2}+\\sum_{\\omega \\in L^*}\\left(\\frac{1}{(z-\\omega)^2}-\\frac{1}{\\omega^2}\\right)\\] we write \\(\\wp(z)\\) when there is no confusion of the lattice. The \\(\\wp\\)-function has a pole of order \\(w\\) at each lattice point, and these are all the poles. Its derivative is \\[\\wp^\\prime(z)=-2\\sum_{\\omega\\in L}\\frac{1}{(z-\\omega)^3}\\] It follows that \\(\\wp, \\wp^\\prime\\) are elliptic functions. We will now derive a differential equation that reveals its link to elliptic curves. By expanding the \\(\\wp\\)-function into series, we can write it in terms of Einsenstein series. \\[\\wp(z)=\\frac{1}{z^2}+\\sum_{n=1}^{\\infty}(2 n+1) G_{2 n+2}(L) z^{2 n}\\] The critical observation is that \\(\\wp \\) satisfies the following differential equations. Theorem. Let \\(L\\) be a lattice, then \\[\\wp^{\\prime}(z)^2=4 \\wp(z)^3-g_2(L) \\wp(z)-g_3(L),\\] where \\(g_2(L)=60G_4(L)\\) and \\(g_3(L)=140 G_6(L)\\) This corresponds to an elliptic curve by letting \\(y=\\wp^\\prime(z)\\) and \\(x=\\wp(z)\\), so we have an elliptic curve \\(y^2=4 x^3-g_2(L) x-g_3(L)\\), iff the discriminant \\(\\Delta(L)=g_2(L)^3-27g_3(L)^2\\) is nonzero, and this is always nonzero. We now have a map that gives an elliptic curve for each lattice \\[\\Phi:\\mathbb C/L\\rightarrow E(\\mathbb C)\\quad z\\mapsto (\\wp(z),\\wp^\\prime(z))\\] This is an isomorphism of groups and complex manifolds. Moreover, all elliptic curves arise this way. For a proof, consult here, becuase I’m too lazy to prove the rest.","link":"/archives/abffc691/"},{"title":"Adeles and Ideles","text":"“God exists since mathematics is consistent, and the Devil exists since we cannot prove it.” André Weil I’ve recently finished my final project for my algebraic number theory course on adeles and ideles, which can be found here. Adeles is an object in algebraic number theory that solves the technical problem of doing analysis over \\(\\mathbb Q\\) so to speak. It lets us work over all completions of a global field simultaneously. One of the applications of it is that certain compactness theorems on it proves the Dirichlet unit theorem and class number theorem. If I had more time, I would have elaborated further at the last part in my project but i unfortunately did not have enough time. In this post, I’ll give a quick summery of my project. Fix a global field \\(K\\). Definition. The adele ring \\(\\mathbb A_K\\) associated to \\(K\\) is the restricted direct product\\[\\mathbb A_K=\\prod_{\\nu}(K_\\nu,\\mathcal O_\\nu)\\] where \\(\\mathcal O_\\nu\\) is the valuation ring of \\(K_\\nu\\), as a topological ring. More generally, for \\(S\\) a set of places of \\(K\\), the \\(S\\)-adele ring is the product \\[\\mathbb A_{K,S}=\\prod_{\\nu\\in S}K_\\nu\\times \\prod_{\\nu\\not\\in S}\\mathcal O_\\nu\\] and we have further that \\(\\mathbb{A}_K \\simeq \\displaystyle\\lim_{\\longrightarrow} \\mathbb{A}_{K, S}\\). This is a locally compact and Hausdorff topological ring, by giving it a basis consisting of \\(\\prod_{\\nu}U_\\nu\\) where \\(U_\\nu\\subseteq K_{\\nu}\\) open with almost all \\(U_\\nu=\\mathcal O_\\nu\\). We have a product formula \\[\\prod_{\\nu}|x|_\\nu=1\\] for \\(x\\in K^\\times\\) for normalized absolute values. The ideles \\(\\mathbb I_K\\) are the unit group in \\(\\mathbb A_K^\\times\\), given the subspace topology by diagonal embedding in \\(\\mathbb A_K\\times \\mathbb A_K\\). The \\(1\\)-ideles is the subgroup of the ideles with norm \\(1\\), which inherits the same topology from \\(\\mathbb I_K\\) and \\(\\mathbb A_K\\). The important result is Proposition. \\(\\mathbb A_K/K\\) and \\(\\mathbb I^1_K/K^\\times\\) are compact. This is what leads to Dirichlet unit theorem and class number theorem.","link":"/archives/6b46c65/"},{"title":"Dold-Kan correspondence","text":"“Mathematics is not the rigid and rigidity-producing schema that the layman thinks it is; rather, in it we find ourselves at that meeting point of constraint and freedom that is the very essence of human nature.” Hermann Weyl Dold-Kan correspondence is a basic result in homotopy theory that establishes correspondence between simplicial abelian groups and (connective) chain complexes of abelian groups. This is given by functors that form an equivalence of categories between the category of simplicial abelian groups \\(\\mathbf{SAb}\\) and the category of connective chain complexes of abelian groups \\(\\mathrm{Ch}_{+}(\\mathbf{Ab})\\). Thus, this correspondence interpolates between homological algebra and (simplicial) homotopy theory. Theorem. Let \\(\\mathcal A\\) be an abelian category. There is an equivalence of categories\\[N:\\mathrm{Fun}(\\Delta^{\\mathrm{op}}, A)\\rightleftharpoons \\mathrm{Ch}_+(\\mathcal A):\\Gamma \\]where \\(N\\) is the normalized chain complex functor, defined as \\[(NA)_n=\\bigcap_{i=1}^n\\mathrm{Ker}(d_i^n)\\] with \\(\\partial_n:=\\left.d_0^n\\right|_{(N A)_n}:(N A)_n \\rightarrow(N A)_{n-1}\\). And $\\Gamma$ is the simplicialization functor, where \\[\\Gamma(C)_n=\\bigoplus_{n\\twoheadrightarrow k}C_k\\] where the maps are given in here. I haven’t have time to finish reading the proof yet. I will write more here when i do finish reading the proof.","link":"/archives/9bdfdff9/"},{"title":"Talk on OGMC","text":"“The pursuit of mathematics is a divine madness of the human spirit.” Alfred North Whitehead Yesterday I gave a talk on OGMC (Ontario Graduate Math Conference) at Waterloo on rigid analytic geometry. Here are the slides. I had a lot of fun at OGMC, and went to lots of great talks. The talks I liked the most was one on algebraic K-theory, and another one on categorical logic (eventhough I can’t say I understood most of them). They seem to be very interesting topics.","link":"/archives/ab08f85b/"},{"title":"Grothendieck-Witt Ring","text":"“What is mathematics? It is only a systematic effort of solving puzzles posed by nature.” Shakuntala Devi Recently I’ve been learning about Grothendieck-Witt rings because I want to know about \\(\\mathbb A^1\\)-enumerative geometry. The Grothendieck-Witt ring of a field (of characteristic different from \\(2\\)) is formed using quadratic forms over it. Let \\(k\\) be a field of characteristic not \\(2\\). A quadratic form is a degree \\(2\\) homogeneous polynomial over \\(k\\), say \\(f=\\sum_{1\\le i,j\\le n}a_{i,j}x_{i}x_{j}\\). Of course \\(x_{i}x_{j}=x_{j}x_{i}\\), so we can rewrite \\(f=\\sum_{1\\le i,j\\le n}a^\\prime_{i,j}x_{i}x_{j}\\) where \\(a^\\prime_{i,j}=\\frac{1}{2}(a_{i,j}+a_{j,i})\\), we can then associate to it a symmetric matrix \\(M_f=(a^\\prime_{i,j})_{1\\le i,j\\le n}\\). We see that \\(f=\\mathbf{x}^{\\mathrm T}M_f\\mathbf{x}\\) where \\(\\mathbf{x}=(x_i)_{1\\le i\\le n}\\). Two \\(n\\)-ary quadratic forms \\(f,g\\) are said to be equivalent if there is \\(A\\in \\mathrm{GL}_n(k)\\) such that \\(f(\\mathbf{x})=g(A\\mathbf{x})\\). Equivalently their associated symmetric matrix are equivalent iff \\(M_f=A^{\\mathrm T}M_g A\\) for some \\(A\\in \\mathrm{GL}_n(k)\\), i.e. congruence of matrices. Example. \\(f(x,y)=xy\\) and \\(g(x,y)=x^2-y^2\\) are equivalent by change of variables \\(x\\mapsto x+y\\) and \\(y\\mapsto x-y\\). Their associated matrices are\\[M_f=\\begin{pmatrix}0 &amp; 1/2\\\\ 1/2 &amp; 0\\end{pmatrix}\\quad M_g=\\begin{pmatrix}1 &amp; 0\\\\ 0 &amp; -1\\end{pmatrix}\\] and the change of variable matrix \\(A=\\begin{pmatrix}1 &amp; 1\\\\ 1 &amp; -1\\end{pmatrix}\\). In all following, all vector spaces are finite-dimensional. A quadratic space \\((V,q)\\) over \\(k\\) is a vector space \\(V\\) over \\(k\\) and a function \\(q:V\\rightarrow k\\) called a quadratic map satisfying \\(q(ax)=a^2q(x)\\) for all \\(a\\in k\\) and \\(x\\in V\\), and such that \\((u,v)\\mapsto q(u+v)-q(u)-q(v)\\) is bilinear. An equivalence of quadratic spaces \\((V_1,q_1),(V_2,q_2)\\) is an isomorphism \\(\\varphi:V_1\\rightarrow V_2\\) such that \\(q_1(x)=q_2(\\varphi(x))\\) for all \\(x\\in V_1\\). Obviously an \\(n\\)-ary quadratic form \\(f\\) gives rise to a quadratic space \\((k^n,f)\\) where \\(f\\) is the map of evaluating \\(f\\). In the other direction, for a quadratic space \\((V,q)\\), choose a basis \\(e_i\\), then this corresponds to a quadratic form \\(f=\\sum_{1\\le i,j\\le n}a_{i,j} x_ix_j\\) where \\(a_{i,j}=\\frac{1}{2}(q(e_i+e_j)-q(e_i)-q(e_j))\\), and in particular \\(a_{i,i}=q(e_i)\\). We see that a quadratic space is equivalent to a quadratic form. Another equivalent structure is \\((V,B)\\), a vector space \\(V\\) over \\(k\\) with a symmetric bilinear form \\(B:V^2\\rightarrow k\\). Each \\((V,B)\\) determines a quadratic space \\((V,q)\\) where \\(q(x)=B(x,x)\\). In the other direction, for a quadratic space \\((V,q)\\) we have a symmetric bilinear form \\(B(v,w)=\\frac{1}{2}(q(v+w)-q(v)-q(w))\\), called its polarization. An equivalence or isometry between \\((V_1,B_1),(V_2,B_2)\\) is a linear isomorphism \\(\\varphi:V_1\\rightarrow V_2\\) such that \\(B_1(v,w)=B_2(\\varphi(v),\\varphi(w))\\). We say a quadratic form is nondegenerate if the associated symmetric bilinear form is nondegenerate, or equivalently the associated symmetric matrix is invertible. A diagonal quadratic form is a quadratic form with a diagonal symmetric matrix. Every quadratic form is equivalent to a diagonal form. Definition. A quadratic form \\(f\\) represents some \\(d\\in k^\\times\\) if there exists \\(\\lambda\\in k^n\\) with \\(f(\\lambda)=d\\). Let \\(D(f)\\) be the subset of \\(k^\\times\\) represented by \\(f\\). For quadratic forms \\(f,g\\), their orthogonal sum \\(f\\oplus g\\) is \\(f(x)+g(y)\\), equivalent to taking block diagonal of their matrices, equivalent to direct sum of quadratic space (with sum of quadratic map), and equivalent to direct sum of symmetric bilinear space (with sum of symmetric bilinear form). Theorem. For a quadratic form \\(f\\) on \\(V\\), some \\(d\\in k^\\times\\) is representable iff \\(V\\cong \\langle d\\rangle\\otimes W\\) for \\(W\\) another quadratic space. As a result, \\(V\\cong \\langle a_1,\\dots,a_n\\rangle \\) for some \\(a_i\\). Define the determinant of a quadratic form \\(f\\) to be the image of \\(\\det M_f\\) in \\(k^\\times/(k^\\times)^2\\). Define \\(\\mathbb H=\\langle 1, -1\\rangle\\) the hyperbolic plane, and its arbitrary orthogonal sum is hyperbolic space (including zero space). A quadratic space is isotropic if there is a nonzero vector \\(x\\) such that \\(q(x)=0\\) (an isotropic vector), and totally isotropic if every nonzero vector is isotropic, and anisotrpic if not isotropic. Theorem (Witt Decomposition). Each quadratic space is a orthogonal sum of a totally isotropic space, a hyperbolic space, and an anisotropic space, all unique up to equivalence. Theorem (Witt Cancellation). If \\(q\\oplus q_1\\cong q\\oplus q_2\\) then \\(q_1\\cong q_2\\). We can define tensors of quadratic spaces by tensoring their underlying space and multiplying the quadratic map. Then orthogonal sum and tensor define a semiring on the set \\(M\\) of equivalence classes of quadratic spaces. Define inverse formally on \\(M^2\\) by \\((x,y)\\sim (s,t)\\) iff \\(x+t=s+y\\). Multiplication is defined in the obvious way. The resulting ring is the Grothendieck-Witt ring \\(\\mathrm{GW}(k)\\). The integer multiples of hyperbolic space \\((\\mathbb H)\\) is an ideal in the GW ring, the quotient \\(\\mathrm{W}(k)=\\mathrm{GW}(k)/(\\mathbb H)\\) is the Witt ring. For more read here.","link":"/archives/6b138191/"},{"title":"Symmetric Polynomials","text":"“And every science, when we understand it not as an instrument of power and domination but as an adventure in knowledge pursued by our species across the ages, is nothing but this harmony, more or less vast, more or less rich from one epoch to another, which unfurls over the course of generations and centuries, by the delicate counterpoint of all the themes appearing in turn, as if summoned from the void.” Alexander Grothendieck This post is about symmetric polynomials. A symmetric polynomial is \\(f(x_1,\\dots,x_n)\\in \\mathbb Z[x_1,\\dots,x_n]\\) such that for any permutation \\(\\sigma\\in S_n\\), we have \\(\\sigma f=f\\) where \\(\\sigma\\) acts by permuting the variables. The symmetric polynomials form a subring of \\(\\mathbb Z[x_1,\\dots,x_n]\\) which we denote as \\(\\Lambda_n\\). One example of symmetric polynomials is the Newton power sums \\(p_k=x_1^k+\\cdots+x_n^k\\) for \\(k\\ge 1\\). Another example is elementary symmetric polynomials \\(e_k=\\sum_{1\\le i_1&lt;\\cdots&lt; i_k\\le n}x_{i_1}\\cdots x_{i_k}\\) for \\(1\\le k\\le n\\). They arise in Vieta’s relations for a polynomial equation. Obviously \\(\\Lambda_n\\) is a graded ring in degree. For a monomial \\(u=ax^{k_1}_1\\cdots x^{k_n}_n\\), we define its weight as \\(\\mathrm{wt}(u)=k_1+2k_2+\\cdots+nk_n\\), and for a polynomial \\(f\\) define \\(\\mathrm{wt}(f)\\) as the largest weight occuring among its monomials. We note that the weight of a polynomial is the same as the degree of \\(f(e_1,\\dots,e_n)\\). One of the first results in symmetric polynomials is that the elementary symmetric polynomials forms a generating set of \\(\\Lambda_n\\) as a (graded) algebra over \\(\\mathbb Z\\). This is our first theorem. Theorem (Fundamental Theorem of Symmetric Polynomials). For each symmetric polynomial \\(g\\) of degree \\(d\\) there exists a unique polynomial \\(f\\) of weight at most \\(d\\) such that \\(g(x_1,\\dots,x_n)=f(e_1,\\dots,e_n)\\). Another set of generators is the complete symmetric polynomial \\(h_k=\\sum_{1\\le i_1\\le \\cdots\\le i_k\\le n}x_{i_1}\\cdots x_{i_k}\\) for \\(1\\le k\\le n\\). Consider the generating functions \\(E(t)=\\sum_{k=0}^\\infty e_kt^k\\) and \\(H(t)=\\sum_{k=0}^\\infty h_k t^k\\). One can show that\\[E(t)=\\prod_{i=1}^n(1+x_it)\\quad H(t)=\\prod_{i=1}^n\\frac{1}{1-x_it}\\]Therefore one has \\(E(t)H(-t)=1\\). By multiplying out coefficients this gives a relation between \\(e_k\\) and \\(h_k\\). When the polynomials are over \\(\\mathbb Q\\) or any field, we have another set of generators which is the Newton power sums \\(p_k\\). For a partition \\(\\lambda\\), we define \\(e_{\\lambda}=e_{\\lambda_1}\\cdots e_{\\lambda_m}\\), and similarly for \\(h_{\\lambda},p_{\\lambda}\\) and so on. Define the symmetric monomial basis \\(m_{\\lambda}=\\sum_{\\sigma\\in S(\\lambda)}x^{\\lambda_1}_{\\sigma(1)}\\cdots x^{\\lambda_n}_{\\sigma(n)}\\) where \\(S(\\lambda)=S_{n}/\\mathrm{Stab}_{S_n}(\\lambda)\\), then this is an integral basis as well. A polynomial is skew-symmetric if \\(\\sigma f=\\mathrm{sgn}(\\sigma)f\\) for all permutations \\(\\sigma\\). The skew-symmetric polynomials \\(\\mathrm{Skew}(n)\\) is a module over \\(\\Lambda_n\\). Define the alteration of a polynomial \\(\\mathrm{Alt}(f)=\\sum_{\\sigma\\in S_n}\\mathrm{sgn}(\\sigma) \\sigma f\\). Let \\(a_{\\alpha}=\\mathrm{Alt}(x_1^{\\alpha_1}\\cdots x_n^{\\alpha_n})\\) where \\(\\alpha\\) is a partition without repetitions, they form a basis for \\(\\mathrm{Skew}(n)\\). Let \\(\\delta_n=(n-1,n-2,\\dots,1)\\). For a partition \\(\\lambda=(\\lambda_1,\\dots,\\lambda_n)\\), define the Schur polynomial \\(s_{\\lambda}=a_{\\lambda+\\delta_n}/a_{\\delta}\\), they also form a basis for symmetric functions. Here are some identities for transition of basis Theorem (First Jacobi-Trudi Identity).\\[s_{\\lambda}=\\mathrm{det}(\\{h_{\\lambda_{i}+j-i}\\}_{i,j})=\\operatorname{det}\\left(\\begin{array}{cccc}h_{\\lambda_1} &amp; h_{\\lambda_1+1} &amp; \\ldots &amp; h_{\\lambda_1+n-1} \\\\ h_{\\lambda_2-1} &amp; h_{\\lambda_2} &amp; \\ldots &amp; h_{\\lambda_2+n-2} \\\\ \\vdots &amp; \\vdots &amp; \\ddots &amp; \\vdots \\\\ h_{\\lambda_n-n+1} &amp; h_{\\lambda_n-n+2} &amp; \\ldots &amp; h_{\\lambda_n}\\end{array}\\right) .\\] There are similar transition determinental identities between \\(h_k,e_k,p_k\\). Note that \\(s_\\lambda s_\\mu=\\sum_\\nu c_{\\lambda \\mu}^v s_v\\) where \\(c_{\\lambda \\mu}^v\\) is called the structure constant. This constant is usually difficult to find. To find them we need the following theorem. Theorem (Pieri formulas). Let \\(\\lambda\\otimes 1^k\\) (resp. \\(\\lambda\\otimes k\\)) be the partitions obtained from \\(\\lambda\\) by adding \\(k\\) boxes to its Young diagram such that no two boxes belong to the same row (resp. column).\\[s_\\lambda e_k=\\sum_{\\mu \\in \\lambda \\otimes 1^k} s_\\mu,\\quad s_\\lambda h_k=\\sum_{\\mu \\in \\lambda \\otimes k} s_\\mu\\] Littlewood showed that Schur polynomials can be represented by sum indexed by semistandard Young tableaus \\(s_\\lambda\\left(x_1, \\ldots, x_n\\right)=\\sum_{T \\in \\operatorname{SSYT}_\\lambda(n)} \\mathbf{x}^T .\\) Define \\(\\Lambda=\\displaystyle\\lim_{\\longleftarrow}\\Lambda_n\\) the ring of symmetric functions. Let \\(\\omega:\\Lambda\\rightarrow\\Lambda\\) be \\(\\omega(h_{\\lambda})=e_{\\lambda}\\), then \\(\\omega^2=\\mathrm{id}\\). Define also bilinear form \\(\\langle \\cdot,\\cdot\\rangle:\\Lambda^2\\rightarrow\\mathbb R\\) extended by \\(\\langle m_{\\lambda},h_{\\mu}\\rangle=\\delta_{\\lambda\\mu}\\). Wrt this form, the Schur polynomials form an orthonormal basis with \\(\\omega\\) an isometry of it. This is the Hall inner product. One application of symmetric polynomials is Lagrange’s solution to depressed quartic equation. Let \\(\\alpha_i\\) be the roots of \\(x^4+a_2x^2+a_3x+a_4=0\\). Let \\(f_1=(\\alpha_1+\\alpha_2)(\\alpha_3+\\alpha_4)\\) and \\(f_2,f_3\\) the other two in its orbit, then for any symmetric polynomial \\(s\\), we have \\(s(f_1,f_2,f_3)\\) is symmetric. Thus \\(u_{i}=e_i(f_1,f_2,f_3)\\) are symmetric for \\(i=1,2,3\\). Then \\(u_i\\) can be written as a polynomial in terms of \\(a_i\\) by Vieta. Since \\(x^3-u_1x^2+u_2x+u_3\\) has coefficients polynomials in \\(a_i\\), we can use the cubic formula to solve for \\(f_i\\) in terms of \\(a_i\\). Using \\(f_1=(\\alpha_1+\\alpha_2)(\\alpha_3+\\alpha_4)=-(\\alpha_1+\\alpha_2)^2\\) since \\(\\alpha_1+\\alpha_2+\\alpha_3+\\alpha_4=0\\), and likewise for \\(f_2,f_3\\), we can solve for \\(\\alpha_i\\) in terms of \\(a_i\\). For further connection between Galois theory and symmetric functions, read this.","link":"/archives/4c0fcf8b/"}],"tags":[{"name":"Number Theory","slug":"Number-Theory","link":"/tags/Number-Theory/"},{"name":"Combinatorics","slug":"Combinatorics","link":"/tags/Combinatorics/"},{"name":"Algebra","slug":"Algebra","link":"/tags/Algebra/"},{"name":"Category Theory","slug":"Category-Theory","link":"/tags/Category-Theory/"},{"name":"Algebraic Geometry","slug":"Algebraic-Geometry","link":"/tags/Algebraic-Geometry/"},{"name":"Arithmetic Geometry","slug":"Arithmetic-Geometry","link":"/tags/Arithmetic-Geometry/"},{"name":"Euclidean Geometry","slug":"Euclidean-Geometry","link":"/tags/Euclidean-Geometry/"},{"name":"Algebraic geometry","slug":"Algebraic-geometry","link":"/tags/Algebraic-geometry/"},{"name":"Representation Theory","slug":"Representation-Theory","link":"/tags/Representation-Theory/"},{"name":"Differential Geometry","slug":"Differential-Geometry","link":"/tags/Differential-Geometry/"},{"name":"Logic Theory","slug":"Logic-Theory","link":"/tags/Logic-Theory/"},{"name":"Lie Groups and Lie Algebras","slug":"Lie-Groups-and-Lie-Algebras","link":"/tags/Lie-Groups-and-Lie-Algebras/"},{"name":"Algebraic Topology","slug":"Algebraic-Topology","link":"/tags/Algebraic-Topology/"},{"name":"Category theory","slug":"Category-theory","link":"/tags/Category-theory/"},{"name":"Philosophy","slug":"Philosophy","link":"/tags/Philosophy/"},{"name":"Homotopy Theory","slug":"Homotopy-Theory","link":"/tags/Homotopy-Theory/"},{"name":"Complex Analysis","slug":"Complex-Analysis","link":"/tags/Complex-Analysis/"}],"categories":[{"name":"Articles","slug":"Articles","link":"/categories/Articles/"},{"name":"This Week I Learned","slug":"This-Week-I-Learned","link":"/categories/This-Week-I-Learned/"}]}